espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_HCDMA4_REG register
 *  Host Channel 4 DMA Address Register
 */
#define USB_HCDMA4_REG (SOC_DPORT_USB_BASE + 0x594)
/** USB_H_DMAADDR4 : R/W; bitpos: [32:0]; default: 0;
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *  [31:9]: DMA Address
 *  [8:3]: Current Transfer Desc
 *  [2:0]: Reserved
 */
#define USB_H_DMAADDR4    0xFFFFFFFF
#define USB_H_DMAADDR4_M  (USB_H_DMAADDR4_V << USB_H_DMAADDR4_S)
#define USB_H_DMAADDR4_V  0xFFFFFFFF
#define USB_H_DMAADDR4_S  0


/** USB_HCCHAR5_REG register
 *  Host Channel 5 Characteristics Register
 */
#define USB_HCCHAR5_REG (SOC_DPORT_USB_BASE + 0x5a0)
/** USB_H_MPS5 : R/W; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size.
 */
#define USB_H_MPS5    0x000007FF
#define USB_H_MPS5_M  (USB_H_MPS5_V << USB_H_MPS5_S)
#define USB_H_MPS5_V  0x000007FF
#define USB_H_MPS5_S  0
/** USB_H_EPNUM5 : R/W; bitpos: [15:11]; default: 0;
 *  Endpoint Number.
 */
#define USB_H_EPNUM5    0x0000000F
#define USB_H_EPNUM5_M  (USB_H_EPNUM5_V << USB_H_EPNUM5_S)
#define USB_H_EPNUM5_V  0x0000000F
#define USB_H_EPNUM5_S  11
/** USB_H_EPDIR5 : R/W; bitpos: [15]; default: 0;
 *  1'b0: OUT
 *  1'b1: IN
 */
#define USB_H_EPDIR5    (BIT(15))
#define USB_H_EPDIR5_M  (USB_H_EPDIR5_V << USB_H_EPDIR5_S)
#define USB_H_EPDIR5_V  0x00000001
#define USB_H_EPDIR5_S  15
/** USB_H_LSPDDEV5 : R/W; bitpos: [17]; default: 0;
 *  0x0: Not Communicating with low speed device
 *  0x1: Communicating with low speed device
 */
#define USB_H_LSPDDEV5    (BIT(17))
#define USB_H_LSPDDEV5_M  (USB_H_LSPDDEV5_V << USB_H_LSPDDEV5_S)
#define USB_H_LSPDDEV5_V  0x00000001
#define USB_H_LSPDDEV5_S  17
/** USB_H_EPTYPE5 : R/W; bitpos: [20:18]; default: 0;
 *  0x0 (CTRL): Control
 *  0x1 (ISOC): Isochronous
 *  0x2 (BULK): Bulk
 *  0x3 (INTERR): Interrupt
 */
#define USB_H_EPTYPE5    0x00000003
#define USB_H_EPTYPE5_M  (USB_H_EPTYPE5_V << USB_H_EPTYPE5_S)
#define USB_H_EPTYPE5_V  0x00000003
#define USB_H_EPTYPE5_S  18
/** USB_H_EC5 : R/W; bitpos: [21]; default: 0;
 *  Multi Count (MC) / Error Count(EC)
 *  0x0 (RESERVED): Reserved. This field yields undefined result
 *  0x1 (TRANSONE): 1 transaction
 *  0x2 (TRANSTWO):2 transactions to be issued for this endpoint per microframe
 *  0x3 (TRANSTHREE): 3 transactions to be issued for this endpoint per microframe
 */
#define USB_H_EC5    (BIT(21))
#define USB_H_EC5_M  (USB_H_EC5_V << USB_H_EC5_S)
#define USB_H_EC5_V  0x00000001
#define USB_H_EC5_S  21
/** USB_H_DEVADDR5 : R/W; bitpos: [29:22]; default: 0;
 *  Device Address .    This field selects the specific device serving as the data
 *  source or sink.
 */
#define USB_H_DEVADDR5    0x0000007F
#define USB_H_DEVADDR5_M  (USB_H_DEVADDR5_V << USB_H_DEVADDR5_S)
#define USB_H_DEVADDR5_V  0x0000007F
#define USB_H_DEVADDR5_S  22
/** USB_H_ODDFRM5 : R/W; bitpos: [29]; default: 0;
 *  Odd Frame
 *  1'b0: Even (micro)Frame
 *  1'b1: Odd (micro)Frame
 */
#define USB_H_ODDFRM5    (BIT(29))
#define USB_H_ODDFRM5_M  (USB_H_ODDFRM5_V << USB_H_ODDFRM5_S)
#define USB_H_ODDFRM5_V  0x00000001
#define USB_H_ODDFRM5_S  29
/** USB_H_CHDIS5 : R/W; bitpos: [30]; default: 0;
 *  Channel Disable
 *  0x0 : Transmit/Receive norma
 *  0x1 : Stop transmitting/receiving data on channel
 */
#define USB_H_CHDIS5    (BIT(30))
#define USB_H_CHDIS5_M  (USB_H_CHDIS5_V << USB_H_CHDIS5_S)
#define USB_H_CHDIS5_V  0x00000001
#define USB_H_CHDIS5_S  30
/** USB_H_CHENA5 : R/W; bitpos: [31]; default: 0;
 *  Channel Enable
 *  0x0 :If Scatter/Gather mode is enabled, indicates that the descriptor structure is
 *  not yet ready. If Scatter/Gather mode is disabled, indicates that the channel is
 *  disabled
 *  0x1 : If Scatter/Gather mode is enabled, indicates that the descriptor structure
 *  and data buffer with data is set up and this channel can access the descriptor. If
 *  Scatter/Gather mode is disabled, indicates that the channel is enabled
 */
#define USB_H_CHENA5    (BIT(31))
#define USB_H_CHENA5_M  (USB_H_CHENA5_V << USB_H_CHENA5_S)
#define USB_H_CHENA5_V  0x00000001
#define USB_H_CHENA5_S  31


/** USB_HCDMA5_REG register
 *  Host Channel 5 DMA Address Register
 */
#define USB_HCDMA5_REG (SOC_DPORT_USB_BASE + 0x5b4)
/** USB_H_DMAADDR5 : R/W; bitpos: [32:0]; default: 0;
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *  [31:9]: DMA Address
 *  [8:3]: Current Transfer Desc
 *  [2:0]: Reserved
 */
#define USB_H_DMAADDR5    0xFFFFFFFF
#define USB_H_DMAADDR5_M  (USB_H_DMAADDR5_V << USB_H_DMAADDR5_S)
#define USB_H_DMAADDR5_V  0xFFFFFFFF
#define USB_H_DMAADDR5_S  0


/** USB_HCCHAR6_REG register
 *  Host Channel 6 Characteristics Register
 */
#define USB_HCCHAR6_REG (SOC_DPORT_USB_BASE + 0x5c0)
/** USB_H_MPS6 : R/W; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size.
 */
#define USB_H_MPS6    0x000007FF
#define USB_H_MPS6_M  (USB_H_MPS6_V << USB_H_MPS6_S)
#define USB_H_MPS6_V  0x000007FF
#define USB_H_MPS6_S  0
/** USB_H_EPNUM6 : R/W; bitpos: [15:11]; default: 0;
 *  Endpoint Number.
 */
#define USB_H_EPNUM6    0x0000000F
#define USB_H_EPNUM6_M  (USB_H_EPNUM6_V << USB_H_EPNUM6_S)
#define USB_H_EPNUM6_V  0x0000000F
#define USB_H_EPNUM6_S  11
/** USB_H_EPDIR6 : R/W; bitpos: [15]; default: 0;
 *  1'b0: OUT
 *  1'b1: IN
 */
#define USB_H_EPDIR6    (BIT(15))
#define USB_H_EPDIR6_M  (USB_H_EPDIR6_V << USB_H_EPDIR6_S)
#define USB_H_EPDIR6_V  0x00000001
#define USB_H_EPDIR6_S  15
/** USB_H_LSPDDEV6 : R/W; bitpos: [17]; default: 0;
 *  0x0: Not Communicating with low speed device
 *  0x1: Communicating with low speed device
 */
#define USB_H_LSPDDEV6    (BIT(17))
#define USB_H_LSPDDEV6_M  (USB_H_LSPDDEV6_V << USB_H_LSPDDEV6_S)
#define USB_H_LSPDDEV6_V  0x00000001
#define USB_H_LSPDDEV6_S  17
/** USB_H_EPTYPE6 : R/W; bitpos: [20:18]; default: 0;
 *  0x0 (CTRL): Control
 *  0x1 (ISOC): Isochronous
 *  0x2 (BULK): Bulk
 *  0x3 (INTERR): Interrupt
 */
#define USB_H_EPTYPE6    0x00000003
#define USB_H_EPTYPE6_M  (USB_H_EPTYPE6_V << USB_H_EPTYPE6_S)
#define USB_H_EPTYPE6_V  0x00000003
#define USB_H_EPTYPE6_S  18
/** USB_H_EC6 : R/W; bitpos: [21]; default: 0;
 *  Multi Count (MC) / Error Count(EC)
 *  0x0 (RESERVED): Reserved. This field yields undefined result
 *  0x1 (TRANSONE): 1 transaction
 *  0x2 (TRANSTWO):2 transactions to be issued for this endpoint per microframe
 *  0x3 (TRANSTHREE): 3 transactions to be issued for this endpoint per microframe
 */
#define USB_H_EC6    (BIT(21))
#define USB_H_EC6_M  (USB_H_EC6_V << USB_H_EC6_S)
#define USB_H_EC6_V  0x00000001
#define USB_H_EC6_S  21
/** USB_H_DEVADDR6 : R/W; bitpos: [29:22]; default: 0;
 *  Device Address .    This field selects the specific device serving as the data
 *  source or sink.
 */
#define USB_H_DEVADDR6    0x0000007F
#define USB_H_DEVADDR6_M  (USB_H_DEVADDR6_V << USB_H_DEVADDR6_S)
#define USB_H_DEVADDR6_V  0x0000007F
#define USB_H_DEVADDR6_S  22
/** USB_H_ODDFRM6 : R/W; bitpos: [29]; default: 0;
 *  Odd Frame
 *  1'b0: Even (micro)Frame
 *  1'b1: Odd (micro)Frame
 */
#define USB_H_ODDFRM6    (BIT(29))
#define USB_H_ODDFRM6_M  (USB_H_ODDFRM6_V << USB_H_ODDFRM6_S)
#define USB_H_ODDFRM6_V  0x00000001
#define USB_H_ODDFRM6_S  29
/** USB_H_CHDIS6 : R/W; bitpos: [30]; default: 0;
 *  Channel Disable
 *  0x0 : Transmit/Receive norma
 *  0x1 : Stop transmitting/receiving data on channel
 */
#define USB_H_CHDIS6    (BIT(30))
#define USB_H_CHDIS6_M  (USB_H_CHDIS6_V << USB_H_CHDIS6_S)
#define USB_H_CHDIS6_V  0x00000001
#define USB_H_CHDIS6_S  30
/** USB_H_CHENA6 : R/W; bitpos: [31]; default: 0;
 *  Channel Enable
 *  0x0 :If Scatter/Gather mode is enabled, indicates that the descriptor structure is
 *  not yet ready. If Scatter/Gather mode is disabled, indicates that the channel is
 *  disabled
 *  0x1 : If Scatter/Gather mode is enabled, indicates that the descriptor structure
 *  and data buffer with data is set up and this channel can access the descriptor. If
 *  Scatter/Gather mode is disabled, indicates that the channel is enabled
 */
#define USB_H_CHENA6    (BIT(31))
#define USB_H_CHENA6_M  (USB_H_CHENA6_V << USB_H_CHENA6_S)
#define USB_H_CHENA6_V  0x00000001
#define USB_H_CHENA6_S  31


/** USB_HCDMA6_REG register
 *  Host Channel 6 DMA Address Register
 */
#define USB_HCDMA6_REG (SOC_DPORT_USB_BASE + 0x5d4)
/** USB_H_DMAADDR6 : R/W; bitpos: [32:0]; default: 0;
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *  [31:9]: DMA Address
 *  [8:3]: Current Transfer Desc
 *  [2:0]: Reserved
 */
#define USB_H_DMAADDR6    0xFFFFFFFF
#define USB_H_DMAADDR6_M  (USB_H_DMAADDR6_V << USB_H_DMAADDR6_S)
#define USB_H_DMAADDR6_V  0xFFFFFFFF
#define USB_H_DMAADDR6_S  0


/** USB_HCCHAR7_REG register
 *  Host Channel 7 Characteristics Register
 */
#define USB_HCCHAR7_REG (SOC_DPORT_USB_BASE + 0x5e0)
/** USB_H_MPS7 : R/W; bitpos: [11:0]; default: 0;
 *  Maximum Packet Size.
 */
#define USB_H_MPS7    0x000007FF
#define USB_H_MPS7_M  (USB_H_MPS7_V << USB_H_MPS7_S)
#define USB_H_MPS7_V  0x000007FF
#define USB_H_MPS7_S  0
/** USB_H_EPNUM7 : R/W; bitpos: [15:11]; default: 0;
 *  Endpoint Number.
 */
#define USB_H_EPNUM7    0x0000000F
#define USB_H_EPNUM7_M  (USB_H_EPNUM7_V << USB_H_EPNUM7_S)
#define USB_H_EPNUM7_V  0x0000000F
#define USB_H_EPNUM7_S  11
/** USB_H_EPDIR7 : R/W; bitpos: [15]; default: 0;
 *  1'b0: OUT
 *  1'b1: IN
 */
#define USB_H_EPDIR7    (BIT(15))
#define USB_H_EPDIR7_M  (USB_H_EPDIR7_V << USB_H_EPDIR7_S)
#define USB_H_EPDIR7_V  0x00000001
#define USB_H_EPDIR7_S  15
/** USB_H_LSPDDEV7 : R/W; bitpos: [17]; default: 0;
 *  0x0: Not Communicating with low speed device
 *  0x1: Communicating with low speed device
 */
#define USB_H_LSPDDEV7    (BIT(17))
#define USB_H_LSPDDEV7_M  (USB_H_LSPDDEV7_V << USB_H_LSPDDEV7_S)
#define USB_H_LSPDDEV7_V  0x00000001
#define USB_H_LSPDDEV7_S  17
/** USB_H_EPTYPE7 : R/W; bitpos: [20:18]; default: 0;
 *  0x0 (CTRL): Control
 *  0x1 (ISOC): Isochronous
 *  0x2 (BULK): Bulk
 *  0x3 (INTERR): Interrupt
 */
#define USB_H_EPTYPE7    0x00000003
#define USB_H_EPTYPE7_M  (USB_H_EPTYPE7_V << USB_H_EPTYPE7_S)
#define USB_H_EPTYPE7_V  0x00000003
#define USB_H_EPTYPE7_S  18
/** USB_H_EC7 : R/W; bitpos: [21]; default: 0;
 *  Multi Count (MC) / Error Count(EC)
 *  0x0 (RESERVED): Reserved. This field yields undefined result
 *  0x1 (TRANSONE): 1 transaction
 *  0x2 (TRANSTWO):2 transactions to be issued for this endpoint per microframe
 *  0x3 (TRANSTHREE): 3 transactions to be issued for this endpoint per microframe
 */
#define USB_H_EC7    (BIT(21))
#define USB_H_EC7_M  (USB_H_EC7_V << USB_H_EC7_S)
#define USB_H_EC7_V  0x00000001
#define USB_H_EC7_S  21
/** USB_H_DEVADDR7 : R/W; bitpos: [29:22]; default: 0;
 *  Device Address .    This field selects the specific device serving as the data
 *  source or sink.
 */
#define USB_H_DEVADDR7    0x0000007F
#define USB_H_DEVADDR7_M  (USB_H_DEVADDR7_V << USB_H_DEVADDR7_S)
#define USB_H_DEVADDR7_V  0x0000007F
#define USB_H_DEVADDR7_S  22
/** USB_H_ODDFRM7 : R/W; bitpos: [29]; default: 0;
 *  Odd Frame
 *  1'b0: Even (micro)Frame
 *  1'b1: Odd (micro)Frame
 */
#define USB_H_ODDFRM7    (BIT(29))
#define USB_H_ODDFRM7_M  (USB_H_ODDFRM7_V << USB_H_ODDFRM7_S)
#define USB_H_ODDFRM7_V  0x00000001
#define USB_H_ODDFRM7_S  29
/** USB_H_CHDIS7 : R/W; bitpos: [30]; default: 0;
 *  Channel Disable
 *  0x0 : Transmit/Receive norma
 *  0x1 : Stop transmitting/receiving data on channel
 */
#define USB_H_CHDIS7    (BIT(30))
#define USB_H_CHDIS7_M  (USB_H_CHDIS7_V << USB_H_CHDIS7_S)
#define USB_H_CHDIS7_V  0x00000001
#define USB_H_CHDIS7_S  30
/** USB_H_CHENA7 : R/W; bitpos: [31]; default: 0;
 *  Channel Enable
 *  0x0 :If Scatter/Gather mode is enabled, indicates that the descriptor structure is
 *  not yet ready. If Scatter/Gather mode is disabled, indicates that the channel is
 *  disabled
 *  0x1 : If Scatter/Gather mode is enabled, indicates that the descriptor structure
 *  and data buffer with data is set up and this channel can access the descriptor. If
 *  Scatter/Gather mode is disabled, indicates that the channel is enabled
 */
#define USB_H_CHENA7    (BIT(31))
#define USB_H_CHENA7_M  (USB_H_CHENA7_V << USB_H_CHENA7_S)
#define USB_H_CHENA7_V  0x00000001
#define USB_H_CHENA7_S  31


/** USB_HCDMA7_REG register
 *  Host Channel 7 DMA Address Register
 */
#define USB_HCDMA7_REG (SOC_DPORT_USB_BASE + 0x5f4)
/** USB_H_DMAADDR7 : R/W; bitpos: [32:0]; default: 0;
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *  [31:9]: DMA Address
 *  [8:3]: Current Transfer Desc
 *  [2:0]: Reserved
 */
#define USB_H_DMAADDR7    0xFFFFFFFF
#define USB_H_DMAADDR7_M  (USB_H_DMAADDR7_V << USB_H_DMAADDR7_S)
#define USB_H_DMAADDR7_V  0xFFFFFFFF
#define USB_H_DMAADDR7_S  0


/** USB_DCFG_REG register
 *  Device Configuration Register
 */
#define USB_DCFG_REG (SOC_DPORT_USB_BASE + 0x800)
/** USB_NZSTSOUTHSHK : R/W; bitpos: [2]; default: 0;
 *  1'b0: Send the received OUT packet to the application (zero-length or non-zero
 *  length) and send a handshake based on NAK and STALL bits for the endpoint in the
 *  Device Endpoint Control Register
 *  1'b1: Send a STALL handshake on a nonzero-length status OUT transaction and do not
 *  send the received OUT packet to the application
 */
#define USB_NZSTSOUTHSHK    (BIT(2))
#define USB_NZSTSOUTHSHK_M  (USB_NZSTSOUTHSHK_V << USB_NZSTSOUTHSHK_S)
#define USB_NZSTSOUTHSHK_V  0x00000001
#define USB_NZSTSOUTHSHK_S  2
/** USB_ENA32KHZSUSP : R/W; bitpos: [3]; default: 0;
 *  This bit can be set only if FS PHY interface is selected.
 *  Otherwise, this bit needs to be set to zero.
 *  1'b0: USB 1.1 Full-Speed Serial transiver not selected
 *  1'b1: If FS PHY interface is chosen and this bit is set, the PHY clock during Suspend
 *  must be switched from 48 MHz to 32 KHz
 */
#define USB_ENA32KHZSUSP    (BIT(3))
#define USB_ENA32KHZSUSP_M  (USB_ENA32KHZSUSP_V << USB_ENA32KHZSUSP_S)
#define USB_ENA32KHZSUSP_V  0x00000001
#define USB_ENA32KHZSUSP_S  3
/** USB_DEVADDR : R/W; bitpos: [11:4]; default: 0;
 *  Device Address.
 */
#define USB_DEVADDR    0x0000007F
#define USB_DEVADDR_M  (USB_DEVADDR_V << USB_DEVADDR_S)
#define USB_DEVADDR_V  0x0000007F
#define USB_DEVADDR_S  4
/** USB_PERFRLINT : R/W; bitpos: [13:11]; default: 0;
 *  0x0 (EOPF80): 80% of the (micro)Frame interval
 *  0x1 (EOPF85): 85% of the (micro)Frame interval
 *  0x2 (EOPF90): 90% of the (micro)Frame interval
 *  0x3 (EOPF95): 95% of the (micro)Frame interval
 */
#define USB_PERFRLINT    0x00000003
#define USB_PERFRLINT_M  (USB_PERFRLINT_V << USB_PERFRLINT_S)
#define USB_PERFRLINT_V  0x00000003
#define USB_PERFRLINT_S  11
/** USB_ENDEVOUTNAK : R/W; bitpos: [13]; default: 0;
 *  1'b0:The core does not set NAK after Bulk OUT transfer complete
 *  1'b1: The core sets NAK after Bulk OUT transfer complete
 */
#define USB_ENDEVOUTNAK    (BIT(13))
#define USB_ENDEVOUTNAK_M  (USB_ENDEVOUTNAK_V << USB_ENDEVOUTNAK_S)
#define USB_ENDEVOUTNAK_V  0x00000001
#define USB_ENDEVOUTNAK_S  13
/** USB_XCVRDLY : R/W; bitpos: [14]; default: 0;
 *  0x0 : No delay between xcvr_sel and txvalid during Device chirp
 *  0x1 : Enable delay between xcvr_sel and txvalid during Device chirp
 */
#define USB_XCVRDLY    (BIT(14))
#define USB_XCVRDLY_M  (USB_XCVRDLY_V << USB_XCVRDLY_S)
#define USB_XCVRDLY_V  0x00000001
#define USB_XCVRDLY_S  14
/** USB_ERRATICINTMSK : R/W; bitpos: [15]; default: 0;
 *  0x0 : Early suspend interrupt is generated on erratic error
 *  0x1: Mask early suspend interrupt on erratic error
 */
#define USB_ERRATICINTMSK    (BIT(15))
#define USB_ERRATICINTMSK_M  (USB_ERRATICINTMSK_V << USB_ERRATICINTMSK_S)
#define USB_ERRATICINTMSK_V  0x00000001
#define USB_ERRATICINTMSK_S  15
/** USB_EPMISCNT : R/W; bitpos: [23:18]; default: 4;
 *  IN Endpoint Mismatch Count.
 */
#define USB_EPMISCNT    0x0000001F
#define USB_EPMISCNT_M  (USB_EPMISCNT_V << USB_EPMISCNT_S)
#define USB_EPMISCNT_V  0x0000001F
#define USB_EPMISCNT_S  18
/** USB_DESCDMA : R/W; bitpos: [23]; default: 0;
 *  1'b0: Disable Scatter/Gather DMA
 *  1'b1: Enable Scatter/Gather DMA
 */
#define USB_DESCDMA    (BIT(23))
#define USB_DESCDMA_M  (USB_DESCDMA_V << USB_DESCDMA_S)
#define USB_DESCDMA_V  0x00000001
#define USB_DESCDMA_S  23
/** USB_PERSCHINTVL : R/W; bitpos: [26:24]; default: 0;
 *  Periodic Scheduling Interval
 *  0x0 (MF25): 25% of (micro)Frame
 *  0x1 (MF50): 50% of (micro)Frame
 *  0x2 (MF75): 75% of (micro)Frame
 *  0x3 (RESERVED): Reserved
 */
#define USB_PERSCHINTVL    0x00000003
#define USB_PERSCHINTVL_M  (USB_PERSCHINTVL_V << USB_PERSCHINTVL_S)
#define USB_PERSCHINTVL_V  0x00000003
#define USB_PERSCHINTVL_S  24
/** USB_RESVALID : R/W; bitpos: [32:26]; default: 2;
 *  This field is effective only when DCFG.Ena32KHzSusp is set. It controls the resume
 *  period when the core resumes from suspend.
 *  The core counts for ResValid number of clock cycles to detect a valid resume when
 *  this bit is set
 */
#define USB_RESVALID    0x0000003F
#define USB_RESVALID_M  (USB_RESVALID_V << USB_RESVALID_S)
#define USB_RESVALID_V  0x0000003F
#define USB_RESVALID_S  26


