espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_DIEPCTL3_REG register
 *  Device Control IN Endpoint $n Control Register
 */
#define USB_DIEPCTL3_REG (SOC_DPORT_USB_BASE + 0x960)
/** USB_DI_MPS3 : R/W; bitpos: [2:0]; default: 0;
 *  Maximum Packet Size
 *  0x0 : 64 bytes
 *  0x1 : 32 bytes
 *  0x2 : 16 bytes
 *  0x3 : 8 bytes
 */
#define USB_DI_MPS3    0x00000003
#define USB_DI_MPS3_M  (USB_DI_MPS3_V << USB_DI_MPS3_S)
#define USB_DI_MPS3_V  0x00000003
#define USB_DI_MPS3_S  0
/** USB_DI_USBACTEP3 : RO; bitpos: [15]; default: 1;
 *  USB Active Endpoint
 *  0x1 : Control endpoint is always active
 */
#define USB_DI_USBACTEP3    (BIT(15))
#define USB_DI_USBACTEP3_M  (USB_DI_USBACTEP3_V << USB_DI_USBACTEP3_S)
#define USB_DI_USBACTEP3_V  0x00000001
#define USB_DI_USBACTEP3_S  15
/** USB_DI_NAKSTS3 : RO; bitpos: [17]; default: 0;
 *  NAK Status
 *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
 *  0x1 : The core is transmitting NAK handshakes on this endpoint
 */
#define USB_DI_NAKSTS3    (BIT(17))
#define USB_DI_NAKSTS3_M  (USB_DI_NAKSTS3_V << USB_DI_NAKSTS3_S)
#define USB_DI_NAKSTS3_V  0x00000001
#define USB_DI_NAKSTS3_S  17
/** USB_DI_EPTYPE3 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 0
 */
#define USB_DI_EPTYPE3    0x00000003
#define USB_DI_EPTYPE3_M  (USB_DI_EPTYPE3_V << USB_DI_EPTYPE3_S)
#define USB_DI_EPTYPE3_V  0x00000003
#define USB_DI_EPTYPE3_S  18
/** USB_DI_STALL3 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it
 *  0x0 : No Stall
 *  0x1 : Stall Handshake
 */
#define USB_DI_STALL3    (BIT(21))
#define USB_DI_STALL3_M  (USB_DI_STALL3_V << USB_DI_STALL3_S)
#define USB_DI_STALL3_V  0x00000001
#define USB_DI_STALL3_S  21
/** USB_DI_TXFNUM3 : R/W; bitpos: [26:22]; default: 0;
 *  TxFIFO Number.
 */
#define USB_DI_TXFNUM3    0x0000000F
#define USB_DI_TXFNUM3_M  (USB_DI_TXFNUM3_V << USB_DI_TXFNUM3_S)
#define USB_DI_TXFNUM3_V  0x0000000F
#define USB_DI_TXFNUM3_S  22
/** USB_DI_CNAK3 : WO; bitpos: [26]; default: 0;
 *  A write to this bit clears the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_DI_CNAK3    (BIT(26))
#define USB_DI_CNAK3_M  (USB_DI_CNAK3_V << USB_DI_CNAK3_S)
#define USB_DI_CNAK3_V  0x00000001
#define USB_DI_CNAK3_S  26
/** USB_DI_SNAK3 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DI_SNAK3    (BIT(27))
#define USB_DI_SNAK3_M  (USB_DI_SNAK3_V << USB_DI_SNAK3_S)
#define USB_DI_SNAK3_V  0x00000001
#define USB_DI_SNAK3_S  27
/** USB_DI_SETD0PID3 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DI_SETD0PID3    (BIT(28))
#define USB_DI_SETD0PID3_M  (USB_DI_SETD0PID3_V << USB_DI_SETD0PID3_S)
#define USB_DI_SETD0PID3_V  0x00000001
#define USB_DI_SETD0PID3_S  28
/** USB_DI_SETD1PID3 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DI_SETD1PID3    (BIT(29))
#define USB_DI_SETD1PID3_M  (USB_DI_SETD1PID3_V << USB_DI_SETD1PID3_S)
#define USB_DI_SETD1PID3_V  0x00000001
#define USB_DI_SETD1PID3_S  29
/** USB_DI_EPDIS3 : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No action
 *  0x1 : Disabled Endpoint
 */
#define USB_DI_EPDIS3    (BIT(30))
#define USB_DI_EPDIS3_M  (USB_DI_EPDIS3_V << USB_DI_EPDIS3_S)
#define USB_DI_EPDIS3_V  0x00000001
#define USB_DI_EPDIS3_S  30
/** USB_DI_EPENA3 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_DI_EPENA3    (BIT(31))
#define USB_DI_EPENA3_M  (USB_DI_EPENA3_V << USB_DI_EPENA3_S)
#define USB_DI_EPENA3_V  0x00000001
#define USB_DI_EPENA3_S  31


/** USB_DIEPTSIZ3_REG register
 *  Device IN Endpoint 3 Transfer Size Register
 */
#define USB_DIEPTSIZ3_REG (SOC_DPORT_USB_BASE + 0x970)
/** USB_D_XFERSIZE3 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size
 *  IN Endpoints: The core decrements this field every time a packet from the external
 *  memory is written to the TxFIFO
 *  OUT Endpoints: The core decrements this field every time a  packet is read from the
 *  RxFIFO and written to the external memory
 */
#define USB_D_XFERSIZE3    0x0000007F
#define USB_D_XFERSIZE3_M  (USB_D_XFERSIZE3_V << USB_D_XFERSIZE3_S)
#define USB_D_XFERSIZE3_V  0x0000007F
#define USB_D_XFERSIZE3_S  0
/** USB_D_PKTCNT3 : R/W; bitpos: [21:19]; default: 0;
 *  Packet Count
 *  IN Endpoints : This field is decremented every time a packet (maximum size or short
 *  packet) is read from the TxFIFO
 *  OUT Endpoints: This field is decremented every time a packet (maximum size or short
 *  packet) is written to the RxFIFO
 */
#define USB_D_PKTCNT3    0x00000003
#define USB_D_PKTCNT3_M  (USB_D_PKTCNT3_V << USB_D_PKTCNT3_S)
#define USB_D_PKTCNT3_V  0x00000003
#define USB_D_PKTCNT3_S  19


/** USB_DIEPDMA3_REG register
 *  Device IN Endpoint 3 DMA Address Register
 */
#define USB_DIEPDMA3_REG (SOC_DPORT_USB_BASE + 0x974)
/** USB_D_DMAADDR3 : R/W; bitpos: [32:0]; default: 0;
 *  This field holds the start address of the external memory for storing or fetching
 *  endpoint data.
 */
#define USB_D_DMAADDR3    0xFFFFFFFF
#define USB_D_DMAADDR3_M  (USB_D_DMAADDR3_V << USB_D_DMAADDR3_S)
#define USB_D_DMAADDR3_V  0xFFFFFFFF
#define USB_D_DMAADDR3_S  0


/** USB_DIEPCTL4_REG register
 *  Device Control IN Endpoint $n Control Register
 */
#define USB_DIEPCTL4_REG (SOC_DPORT_USB_BASE + 0x980)
/** USB_D_MPS4 : R/W; bitpos: [2:0]; default: 0;
 *  Maximum Packet Size
 *  0x0 : 64 bytes
 *  0x1 : 32 bytes
 *  0x2 : 16 bytes
 *  0x3 : 8 bytes
 */
#define USB_D_MPS4    0x00000003
#define USB_D_MPS4_M  (USB_D_MPS4_V << USB_D_MPS4_S)
#define USB_D_MPS4_V  0x00000003
#define USB_D_MPS4_S  0
/** USB_D_USBACTEP4 : RO; bitpos: [15]; default: 1;
 *  USB Active Endpoint
 *  0x1 : Control endpoint is always active
 */
#define USB_D_USBACTEP4    (BIT(15))
#define USB_D_USBACTEP4_M  (USB_D_USBACTEP4_V << USB_D_USBACTEP4_S)
#define USB_D_USBACTEP4_V  0x00000001
#define USB_D_USBACTEP4_S  15
/** USB_D_NAKSTS4 : RO; bitpos: [17]; default: 0;
 *  NAK Status
 *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
 *  0x1 : The core is transmitting NAK handshakes on this endpoint
 */
#define USB_D_NAKSTS4    (BIT(17))
#define USB_D_NAKSTS4_M  (USB_D_NAKSTS4_V << USB_D_NAKSTS4_S)
#define USB_D_NAKSTS4_V  0x00000001
#define USB_D_NAKSTS4_S  17
/** USB_D_EPTYPE4 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 0
 */
#define USB_D_EPTYPE4    0x00000003
#define USB_D_EPTYPE4_M  (USB_D_EPTYPE4_V << USB_D_EPTYPE4_S)
#define USB_D_EPTYPE4_V  0x00000003
#define USB_D_EPTYPE4_S  18
/** USB_D_STALL4 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it
 *  0x0 : No Stall
 *  0x1 : Stall Handshake
 */
#define USB_D_STALL4    (BIT(21))
#define USB_D_STALL4_M  (USB_D_STALL4_V << USB_D_STALL4_S)
#define USB_D_STALL4_V  0x00000001
#define USB_D_STALL4_S  21
/** USB_D_TXFNUM4 : R/W; bitpos: [26:22]; default: 0;
 *  TxFIFO Number.
 */
#define USB_D_TXFNUM4    0x0000000F
#define USB_D_TXFNUM4_M  (USB_D_TXFNUM4_V << USB_D_TXFNUM4_S)
#define USB_D_TXFNUM4_V  0x0000000F
#define USB_D_TXFNUM4_S  22
/** USB_D_CNAK4 : WO; bitpos: [26]; default: 0;
 *  A write to this bit clears the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_D_CNAK4    (BIT(26))
#define USB_D_CNAK4_M  (USB_D_CNAK4_V << USB_D_CNAK4_S)
#define USB_D_CNAK4_V  0x00000001
#define USB_D_CNAK4_S  26
/** USB_DI_SNAK4 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DI_SNAK4    (BIT(27))
#define USB_DI_SNAK4_M  (USB_DI_SNAK4_V << USB_DI_SNAK4_S)
#define USB_DI_SNAK4_V  0x00000001
#define USB_DI_SNAK4_S  27
/** USB_DI_SETD0PID4 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DI_SETD0PID4    (BIT(28))
#define USB_DI_SETD0PID4_M  (USB_DI_SETD0PID4_V << USB_DI_SETD0PID4_S)
#define USB_DI_SETD0PID4_V  0x00000001
#define USB_DI_SETD0PID4_S  28
/** USB_DI_SETD1PID4 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DI_SETD1PID4    (BIT(29))
#define USB_DI_SETD1PID4_M  (USB_DI_SETD1PID4_V << USB_DI_SETD1PID4_S)
#define USB_DI_SETD1PID4_V  0x00000001
#define USB_DI_SETD1PID4_S  29
/** USB_D_EPDIS4 : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No action
 *  0x1 : Disabled Endpoint
 */
#define USB_D_EPDIS4    (BIT(30))
#define USB_D_EPDIS4_M  (USB_D_EPDIS4_V << USB_D_EPDIS4_S)
#define USB_D_EPDIS4_V  0x00000001
#define USB_D_EPDIS4_S  30
/** USB_D_EPENA4 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_D_EPENA4    (BIT(31))
#define USB_D_EPENA4_M  (USB_D_EPENA4_V << USB_D_EPENA4_S)
#define USB_D_EPENA4_V  0x00000001
#define USB_D_EPENA4_S  31


/** USB_DIEPTSIZ4_REG register
 *  Device IN Endpoint 4 Transfer Size Register
 */
#define USB_DIEPTSIZ4_REG (SOC_DPORT_USB_BASE + 0x990)
/** USB_D_XFERSIZE4 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size
 *  IN Endpoints: The core decrements this field every time a packet from the external
 *  memory is written to the TxFIFO
 *  OUT Endpoints: The core decrements this field every time a  packet is read from the
 *  RxFIFO and written to the external memory
 */
#define USB_D_XFERSIZE4    0x0000007F
#define USB_D_XFERSIZE4_M  (USB_D_XFERSIZE4_V << USB_D_XFERSIZE4_S)
#define USB_D_XFERSIZE4_V  0x0000007F
#define USB_D_XFERSIZE4_S  0
/** USB_D_PKTCNT4 : R/W; bitpos: [21:19]; default: 0;
 *  Packet Count
 *  IN Endpoints : This field is decremented every time a packet (maximum size or short
 *  packet) is read from the TxFIFO
 *  OUT Endpoints: This field is decremented every time a packet (maximum size or short
 *  packet) is written to the RxFIFO
 */
#define USB_D_PKTCNT4    0x00000003
#define USB_D_PKTCNT4_M  (USB_D_PKTCNT4_V << USB_D_PKTCNT4_S)
#define USB_D_PKTCNT4_V  0x00000003
#define USB_D_PKTCNT4_S  19


/** USB_DIEPDMA4_REG register
 *  Device IN Endpoint 4 DMA Address Register
 */
#define USB_DIEPDMA4_REG (SOC_DPORT_USB_BASE + 0x994)
/** USB_D_DMAADDR4 : R/W; bitpos: [32:0]; default: 0;
 *  This field holds the start address of the external memory for storing or fetching
 *  endpoint data.
 */
#define USB_D_DMAADDR4    0xFFFFFFFF
#define USB_D_DMAADDR4_M  (USB_D_DMAADDR4_V << USB_D_DMAADDR4_S)
#define USB_D_DMAADDR4_V  0xFFFFFFFF
#define USB_D_DMAADDR4_S  0


/** USB_DIEPCTL5_REG register
 *  Device Control IN Endpoint $n Control Register
 */
#define USB_DIEPCTL5_REG (SOC_DPORT_USB_BASE + 0x9a0)
/** USB_DI_MPS5 : R/W; bitpos: [2:0]; default: 0;
 *  Maximum Packet Size
 *  0x0 : 64 bytes
 *  0x1 : 32 bytes
 *  0x2 : 16 bytes
 *  0x3 : 8 bytes
 */
#define USB_DI_MPS5    0x00000003
#define USB_DI_MPS5_M  (USB_DI_MPS5_V << USB_DI_MPS5_S)
#define USB_DI_MPS5_V  0x00000003
#define USB_DI_MPS5_S  0
/** USB_DI_USBACTEP5 : RO; bitpos: [15]; default: 1;
 *  USB Active Endpoint
 *  0x1 : Control endpoint is always active
 */
#define USB_DI_USBACTEP5    (BIT(15))
#define USB_DI_USBACTEP5_M  (USB_DI_USBACTEP5_V << USB_DI_USBACTEP5_S)
#define USB_DI_USBACTEP5_V  0x00000001
#define USB_DI_USBACTEP5_S  15
/** USB_DI_NAKSTS5 : RO; bitpos: [17]; default: 0;
 *  NAK Status
 *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
 *  0x1 : The core is transmitting NAK handshakes on this endpoint
 */
#define USB_DI_NAKSTS5    (BIT(17))
#define USB_DI_NAKSTS5_M  (USB_DI_NAKSTS5_V << USB_DI_NAKSTS5_S)
#define USB_DI_NAKSTS5_V  0x00000001
#define USB_DI_NAKSTS5_S  17
/** USB_DI_EPTYPE5 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 0
 */
#define USB_DI_EPTYPE5    0x00000003
#define USB_DI_EPTYPE5_M  (USB_DI_EPTYPE5_V << USB_DI_EPTYPE5_S)
#define USB_DI_EPTYPE5_V  0x00000003
#define USB_DI_EPTYPE5_S  18
/** USB_DI_STALL5 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it
 *  0x0 : No Stall
 *  0x1 : Stall Handshake
 */
#define USB_DI_STALL5    (BIT(21))
#define USB_DI_STALL5_M  (USB_DI_STALL5_V << USB_DI_STALL5_S)
#define USB_DI_STALL5_V  0x00000001
#define USB_DI_STALL5_S  21
/** USB_DI_TXFNUM5 : R/W; bitpos: [26:22]; default: 0;
 *  TxFIFO Number.
 */
#define USB_DI_TXFNUM5    0x0000000F
#define USB_DI_TXFNUM5_M  (USB_DI_TXFNUM5_V << USB_DI_TXFNUM5_S)
#define USB_DI_TXFNUM5_V  0x0000000F
#define USB_DI_TXFNUM5_S  22
/** USB_DI_CNAK5 : WO; bitpos: [26]; default: 0;
 *  A write to this bit clears the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_DI_CNAK5    (BIT(26))
#define USB_DI_CNAK5_M  (USB_DI_CNAK5_V << USB_DI_CNAK5_S)
#define USB_DI_CNAK5_V  0x00000001
#define USB_DI_CNAK5_S  26
/** USB_DI_SNAK5 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DI_SNAK5    (BIT(27))
#define USB_DI_SNAK5_M  (USB_DI_SNAK5_V << USB_DI_SNAK5_S)
#define USB_DI_SNAK5_V  0x00000001
#define USB_DI_SNAK5_S  27
/** USB_DI_SETD0PID5 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DI_SETD0PID5    (BIT(28))
#define USB_DI_SETD0PID5_M  (USB_DI_SETD0PID5_V << USB_DI_SETD0PID5_S)
#define USB_DI_SETD0PID5_V  0x00000001
#define USB_DI_SETD0PID5_S  28
/** USB_DI_SETD1PID5 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DI_SETD1PID5    (BIT(29))
#define USB_DI_SETD1PID5_M  (USB_DI_SETD1PID5_V << USB_DI_SETD1PID5_S)
#define USB_DI_SETD1PID5_V  0x00000001
#define USB_DI_SETD1PID5_S  29
/** USB_DI_EPDIS5 : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No action
 *  0x1 : Disabled Endpoint
 */
#define USB_DI_EPDIS5    (BIT(30))
#define USB_DI_EPDIS5_M  (USB_DI_EPDIS5_V << USB_DI_EPDIS5_S)
#define USB_DI_EPDIS5_V  0x00000001
#define USB_DI_EPDIS5_S  30
/** USB_DI_EPENA5 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_DI_EPENA5    (BIT(31))
#define USB_DI_EPENA5_M  (USB_DI_EPENA5_V << USB_DI_EPENA5_S)
#define USB_DI_EPENA5_V  0x00000001
#define USB_DI_EPENA5_S  31


/** USB_DIEPTSIZ5_REG register
 *  Device IN Endpoint 5 Transfer Size Register
 */
#define USB_DIEPTSIZ5_REG (SOC_DPORT_USB_BASE + 0x9b0)
/** USB_D_XFERSIZE5 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size
 *  IN Endpoints: The core decrements this field every time a packet from the external
 *  memory is written to the TxFIFO
 *  OUT Endpoints: The core decrements this field every time a  packet is read from the
 *  RxFIFO and written to the external memory
 */
#define USB_D_XFERSIZE5    0x0000007F
#define USB_D_XFERSIZE5_M  (USB_D_XFERSIZE5_V << USB_D_XFERSIZE5_S)
#define USB_D_XFERSIZE5_V  0x0000007F
#define USB_D_XFERSIZE5_S  0
/** USB_D_PKTCNT5 : R/W; bitpos: [21:19]; default: 0;
 *  Packet Count
 *  IN Endpoints : This field is decremented every time a packet (maximum size or short
 *  packet) is read from the TxFIFO
 *  OUT Endpoints: This field is decremented every time a packet (maximum size or short
 *  packet) is written to the RxFIFO
 */
#define USB_D_PKTCNT5    0x00000003
#define USB_D_PKTCNT5_M  (USB_D_PKTCNT5_V << USB_D_PKTCNT5_S)
#define USB_D_PKTCNT5_V  0x00000003
#define USB_D_PKTCNT5_S  19


/** USB_DIEPDMA5_REG register
 *  Device IN Endpoint 5 DMA Address Register
 */
#define USB_DIEPDMA5_REG (SOC_DPORT_USB_BASE + 0x9b4)
/** USB_D_DMAADDR5 : R/W; bitpos: [32:0]; default: 0;
 *  This field holds the start address of the external memory for storing or fetching
 *  endpoint data.
 */
#define USB_D_DMAADDR5    0xFFFFFFFF
#define USB_D_DMAADDR5_M  (USB_D_DMAADDR5_V << USB_D_DMAADDR5_S)
#define USB_D_DMAADDR5_V  0xFFFFFFFF
#define USB_D_DMAADDR5_S  0


/** USB_DIEPCTL6_REG register
 *  Device Control IN Endpoint $n Control Register
 */
#define USB_DIEPCTL6_REG (SOC_DPORT_USB_BASE + 0x9c0)
/** USB_D_MPS6 : R/W; bitpos: [2:0]; default: 0;
 *  Maximum Packet Size
 *  0x0 : 64 bytes
 *  0x1 : 32 bytes
 *  0x2 : 16 bytes
 *  0x3 : 8 bytes
 */
#define USB_D_MPS6    0x00000003
#define USB_D_MPS6_M  (USB_D_MPS6_V << USB_D_MPS6_S)
#define USB_D_MPS6_V  0x00000003
#define USB_D_MPS6_S  0
/** USB_D_USBACTEP6 : RO; bitpos: [15]; default: 1;
 *  USB Active Endpoint
 *  0x1 : Control endpoint is always active
 */
#define USB_D_USBACTEP6    (BIT(15))
#define USB_D_USBACTEP6_M  (USB_D_USBACTEP6_V << USB_D_USBACTEP6_S)
#define USB_D_USBACTEP6_V  0x00000001
#define USB_D_USBACTEP6_S  15
/** USB_D_NAKSTS6 : RO; bitpos: [17]; default: 0;
 *  NAK Status
 *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
 *  0x1 : The core is transmitting NAK handshakes on this endpoint
 */
#define USB_D_NAKSTS6    (BIT(17))
#define USB_D_NAKSTS6_M  (USB_D_NAKSTS6_V << USB_D_NAKSTS6_S)
#define USB_D_NAKSTS6_V  0x00000001
#define USB_D_NAKSTS6_S  17
/** USB_D_EPTYPE6 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control 0
 */
#define USB_D_EPTYPE6    0x00000003
#define USB_D_EPTYPE6_M  (USB_D_EPTYPE6_V << USB_D_EPTYPE6_S)
#define USB_D_EPTYPE6_V  0x00000003
#define USB_D_EPTYPE6_S  18
/** USB_D_STALL6 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it
 *  0x0 : No Stall
 *  0x1 : Stall Handshake
 */
#define USB_D_STALL6    (BIT(21))
#define USB_D_STALL6_M  (USB_D_STALL6_V << USB_D_STALL6_S)
#define USB_D_STALL6_V  0x00000001
#define USB_D_STALL6_S  21
/** USB_D_TXFNUM6 : R/W; bitpos: [26:22]; default: 0;
 *  TxFIFO Number.
 */
#define USB_D_TXFNUM6    0x0000000F
#define USB_D_TXFNUM6_M  (USB_D_TXFNUM6_V << USB_D_TXFNUM6_S)
#define USB_D_TXFNUM6_V  0x0000000F
#define USB_D_TXFNUM6_S  22
/** USB_D_CNAK6 : WO; bitpos: [26]; default: 0;
 *  A write to this bit clears the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_D_CNAK6    (BIT(26))
#define USB_D_CNAK6_M  (USB_D_CNAK6_V << USB_D_CNAK6_S)
#define USB_D_CNAK6_V  0x00000001
#define USB_D_CNAK6_S  26
/** USB_DI_SNAK6 : WO; bitpos: [27]; default: 0;
 *  A write to this bit sets the NAK bit for the endpoint
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DI_SNAK6    (BIT(27))
#define USB_DI_SNAK6_M  (USB_DI_SNAK6_V << USB_DI_SNAK6_S)
#define USB_DI_SNAK6_V  0x00000001
#define USB_DI_SNAK6_S  27
/** USB_DI_SETD0PID6 : WO; bitpos: [28]; default: 0;
 *  Set DATA0 PID
 */
#define USB_DI_SETD0PID6    (BIT(28))
#define USB_DI_SETD0PID6_M  (USB_DI_SETD0PID6_V << USB_DI_SETD0PID6_S)
#define USB_DI_SETD0PID6_V  0x00000001
#define USB_DI_SETD0PID6_S  28
/** USB_DI_SETD1PID6 : WO; bitpos: [29]; default: 0;
 *  Set DATA1 PID
 */
#define USB_DI_SETD1PID6    (BIT(29))
#define USB_DI_SETD1PID6_M  (USB_DI_SETD1PID6_V << USB_DI_SETD1PID6_S)
#define USB_DI_SETD1PID6_V  0x00000001
#define USB_DI_SETD1PID6_S  29
/** USB_D_EPDIS6 : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No action
 *  0x1 : Disabled Endpoint
 */
#define USB_D_EPDIS6    (BIT(30))
#define USB_D_EPDIS6_M  (USB_D_EPDIS6_V << USB_D_EPDIS6_S)
#define USB_D_EPDIS6_V  0x00000001
#define USB_D_EPDIS6_S  30
/** USB_D_EPENA6 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_D_EPENA6    (BIT(31))
#define USB_D_EPENA6_M  (USB_D_EPENA6_V << USB_D_EPENA6_S)
#define USB_D_EPENA6_V  0x00000001
#define USB_D_EPENA6_S  31


