espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_DIEPTSIZ6_REG register
 *  Device IN Endpoint 6 Transfer Size Register
 */
#define USB_DIEPTSIZ6_REG (SOC_DPORT_USB_BASE + 0x9d0)
/** USB_D_XFERSIZE6 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size
 *  IN Endpoints: The core decrements this field every time a packet from the external
 *  memory is written to the TxFIFO
 *  OUT Endpoints: The core decrements this field every time a  packet is read from the
 *  RxFIFO and written to the external memory
 */
#define USB_D_XFERSIZE6    0x0000007F
#define USB_D_XFERSIZE6_M  (USB_D_XFERSIZE6_V << USB_D_XFERSIZE6_S)
#define USB_D_XFERSIZE6_V  0x0000007F
#define USB_D_XFERSIZE6_S  0
/** USB_D_PKTCNT6 : R/W; bitpos: [21:19]; default: 0;
 *  Packet Count
 *  IN Endpoints : This field is decremented every time a packet (maximum size or short
 *  packet) is read from the TxFIFO
 *  OUT Endpoints: This field is decremented every time a packet (maximum size or short
 *  packet) is written to the RxFIFO
 */
#define USB_D_PKTCNT6    0x00000003
#define USB_D_PKTCNT6_M  (USB_D_PKTCNT6_V << USB_D_PKTCNT6_S)
#define USB_D_PKTCNT6_V  0x00000003
#define USB_D_PKTCNT6_S  19


/** USB_DIEPDMA6_REG register
 *  Device IN Endpoint 6 DMA Address Register
 */
#define USB_DIEPDMA6_REG (SOC_DPORT_USB_BASE + 0x9d4)
/** USB_D_DMAADDR6 : R/W; bitpos: [32:0]; default: 0;
 *  This field holds the start address of the external memory for storing or fetching
 *  endpoint data.
 */
#define USB_D_DMAADDR6    0xFFFFFFFF
#define USB_D_DMAADDR6_M  (USB_D_DMAADDR6_V << USB_D_DMAADDR6_S)
#define USB_D_DMAADDR6_V  0xFFFFFFFF
#define USB_D_DMAADDR6_S  0


/** USB_DOEPCTL0_REG register
 *  Device Control OUT Endpoint $n Control Register
 */
#define USB_DOEPCTL0_REG (SOC_DPORT_USB_BASE + 0xb00)
/** USB_MPS0 : RO; bitpos: [2:0]; default: 0;
 *  Maximum Packet Size
 *  0x0 : 64 bytes
 *  0x1 : 32 bytes
 *  0x2 : 16 bytes
 *  0x3 : 8 bytes
 */
#define USB_MPS0    0x00000003
#define USB_MPS0_M  (USB_MPS0_V << USB_MPS0_S)
#define USB_MPS0_V  0x00000003
#define USB_MPS0_S  0
/** USB_USBACTEP0 : RO; bitpos: [15]; default: 1;
 *  0x1: USB Active Endpoint 0
 */
#define USB_USBACTEP0    (BIT(15))
#define USB_USBACTEP0_M  (USB_USBACTEP0_V << USB_USBACTEP0_S)
#define USB_USBACTEP0_V  0x00000001
#define USB_USBACTEP0_S  15
/** USB_NAKSTS0 : RO; bitpos: [17]; default: 0;
 *  0x0 :  The core is transmitting non-NAK handshakes based on the FIFO status
 *  0x1 :The core is transmitting NAK handshakes on this endpoint
 */
#define USB_NAKSTS0    (BIT(17))
#define USB_NAKSTS0_M  (USB_NAKSTS0_V << USB_NAKSTS0_S)
#define USB_NAKSTS0_V  0x00000001
#define USB_NAKSTS0_S  17
/** USB_EPTYPE0 : RO; bitpos: [20:18]; default: 0;
 *  Endpoint Type
 *  0x0 : Endpoint Control $n
 */
#define USB_EPTYPE0    0x00000003
#define USB_EPTYPE0_M  (USB_EPTYPE0_V << USB_EPTYPE0_S)
#define USB_EPTYPE0_V  0x00000003
#define USB_EPTYPE0_S  18
/** USB_SNP0 : R/W; bitpos: [20]; default: 0;
 *  0x0 : Reserved 0
 *  0x1 : Reserved 1
 */
#define USB_SNP0    (BIT(20))
#define USB_SNP0_M  (USB_SNP0_V << USB_SNP0_S)
#define USB_SNP0_V  0x00000001
#define USB_SNP0_S  20
/** USB_STALL0 : R/W; bitpos: [21]; default: 0;
 *  The application can only set this bit, and the core clears it, when a SETUP token
 *  is received for this endpoint
 *  0x0 (INACTIVE): No Stall
 *  0x1 (ACTIVE): Stall Handshake
 */
#define USB_STALL0    (BIT(21))
#define USB_STALL0_M  (USB_STALL0_V << USB_STALL0_S)
#define USB_STALL0_V  0x00000001
#define USB_STALL0_S  21
/** USB_CNAK0 : WO; bitpos: [26]; default: 0;
 *  0x0 : No action
 *  0x1 : Clear NAK
 */
#define USB_CNAK0    (BIT(26))
#define USB_CNAK0_M  (USB_CNAK0_V << USB_CNAK0_S)
#define USB_CNAK0_V  0x00000001
#define USB_CNAK0_S  26
/** USB_DO_SNAK0 : WO; bitpos: [27]; default: 0;
 *  0x0 : No action
 *  0x1 : Set NAK
 */
#define USB_DO_SNAK0    (BIT(27))
#define USB_DO_SNAK0_M  (USB_DO_SNAK0_V << USB_DO_SNAK0_S)
#define USB_DO_SNAK0_V  0x00000001
#define USB_DO_SNAK0_S  27
/** USB_EPDIS0 : RO; bitpos: [30]; default: 0;
 *  Endpoint Disable
 *  0x0 : No Endpoint disable
 */
#define USB_EPDIS0    (BIT(30))
#define USB_EPDIS0_M  (USB_EPDIS0_V << USB_EPDIS0_S)
#define USB_EPDIS0_V  0x00000001
#define USB_EPDIS0_S  30
/** USB_EPENA0 : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable
 *  0x0 : No action
 *  0x1 : Enable Endpoint
 */
#define USB_EPENA0    (BIT(31))
#define USB_EPENA0_M  (USB_EPENA0_V << USB_EPENA0_S)
#define USB_EPENA0_V  0x00000001
#define USB_EPENA0_S  31


/** USB_DOEPTSIZ0_REG register
 *  Device OUT Endpoint 0 Transfer Size Register
 */
#define USB_DOEPTSIZ0_REG (SOC_DPORT_USB_BASE + 0xb10)
/** USB_XFERSIZE0 : R/W; bitpos: [7:0]; default: 0;
 *  Transfer Size.Indicates the transfer size in bytes for ENDPOINT0
 */
#define USB_XFERSIZE0    0x0000007F
#define USB_XFERSIZE0_M  (USB_XFERSIZE0_V << USB_XFERSIZE0_S)
#define USB_XFERSIZE0_V  0x0000007F
#define USB_XFERSIZE0_S  0
/** USB_PKTCNT0 : R/W; bitpos: [19]; default: 0;
 *  Packet Count (PktCnt).This field is decremented to zero after a packet is written
 *  into the RxFIFO.
 */
#define USB_PKTCNT0    (BIT(19))
#define USB_PKTCNT0_M  (USB_PKTCNT0_V << USB_PKTCNT0_S)
#define USB_PKTCNT0_V  0x00000001
#define USB_PKTCNT0_S  19
/** USB_SUPCNT0 : R/W; bitpos: [31:29]; default: 0;
 *  SETUP Packet Count (SUPCnt).This field specifies the number of back-to-back SETUP
 *  data packets the endpoint can receive
 *  2'b01: 1 packet
 *  2'b10: 2 packets
 *  2'b11: 3 packets
 */
#define USB_SUPCNT0    0x00000003
#define USB_SUPCNT0_M  (USB_SUPCNT0_V << USB_SUPCNT0_S)
#define USB_SUPCNT0_V  0x00000003
#define USB_SUPCNT0_S  29


/** USB_DOEPDMA0_REG register
 *  Device OUT Endpoint 0 DMA Address Register
 */
#define USB_DOEPDMA0_REG (SOC_DPORT_USB_BASE + 0xb14)
/** USB_DMAADDR0 : R/W; bitpos: [32:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 */
#define USB_DMAADDR0    0xFFFFFFFF
#define USB_DMAADDR0_M  (USB_DMAADDR0_V << USB_DMAADDR0_S)
#define USB_DMAADDR0_V  0xFFFFFFFF
#define USB_DMAADDR0_S  0


