espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_HCINTMSK2_REG register
 *  Host Channel 2 Interrupt Mask Register
 */
#define USB_HCINTMSK2_REG (SOC_DPORT_USB_BASE + 0x54c)
/** USB_H_XFERCOMPLMSK2 : R/W; bitpos: [0]; default: 0;
 *  1'b0: Transfer Completed Mask
 *  1'b1: No Transfer Completed Mask
 */
#define USB_H_XFERCOMPLMSK2    (BIT(0))
#define USB_H_XFERCOMPLMSK2_M  (USB_H_XFERCOMPLMSK2_V << USB_H_XFERCOMPLMSK2_S)
#define USB_H_XFERCOMPLMSK2_V  0x00000001
#define USB_H_XFERCOMPLMSK2_S  0
/** USB_H_CHHLTDMSK2 : R/W; bitpos: [1]; default: 0;
 *  1'b0: Channel Halted Mask
 *  1'b1: No Channel Halted Mask
 */
#define USB_H_CHHLTDMSK2    (BIT(1))
#define USB_H_CHHLTDMSK2_M  (USB_H_CHHLTDMSK2_V << USB_H_CHHLTDMSK2_S)
#define USB_H_CHHLTDMSK2_V  0x00000001
#define USB_H_CHHLTDMSK2_S  1
/** USB_H_AHBERRMSK2 : R/W; bitpos: [2]; default: 0;
 *  1'b0: AHB Error Mask
 *  1'b1: No AHB Error Mask
 */
#define USB_H_AHBERRMSK2    (BIT(2))
#define USB_H_AHBERRMSK2_M  (USB_H_AHBERRMSK2_V << USB_H_AHBERRMSK2_S)
#define USB_H_AHBERRMSK2_V  0x00000001
#define USB_H_AHBERRMSK2_S  2
/** USB_H_STALLMSK2 : R/W; bitpos: [3]; default: 0;
 *  1'b0: Mask STALL Response Received Interrupt
 *  1'b1: No STALL Response Received Interrupt Mask
 */
#define USB_H_STALLMSK2    (BIT(3))
#define USB_H_STALLMSK2_M  (USB_H_STALLMSK2_V << USB_H_STALLMSK2_S)
#define USB_H_STALLMSK2_V  0x00000001
#define USB_H_STALLMSK2_S  3
/** USB_H_NAKMSK2 : R/W; bitpos: [4]; default: 0;
 *  1'b0: Mask NAK Response Received Interrupt
 *  1'b1: No NAK Response Received Interrupt Mask
 */
#define USB_H_NAKMSK2    (BIT(4))
#define USB_H_NAKMSK2_M  (USB_H_NAKMSK2_V << USB_H_NAKMSK2_S)
#define USB_H_NAKMSK2_V  0x00000001
#define USB_H_NAKMSK2_S  4
/** USB_H_ACKMSK2 : R/W; bitpos: [5]; default: 0;
 *  1'b0: Mask ACK Response Received/Transmitted Interrupt
 *  1'b1: No ACK Response Received/Transmitted Interrupt Mask
 */
#define USB_H_ACKMSK2    (BIT(5))
#define USB_H_ACKMSK2_M  (USB_H_ACKMSK2_V << USB_H_ACKMSK2_S)
#define USB_H_ACKMSK2_V  0x00000001
#define USB_H_ACKMSK2_S  5
/** USB_H_NYETMSK2 : R/W; bitpos: [6]; default: 0;
 *  1'b0: Mask NYET Response Received Interrupt
 *  1'b1: No NYET Response Received Interrupt Mask
 */
#define USB_H_NYETMSK2    (BIT(6))
#define USB_H_NYETMSK2_M  (USB_H_NYETMSK2_V << USB_H_NYETMSK2_S)
#define USB_H_NYETMSK2_V  0x00000001
#define USB_H_NYETMSK2_S  6
/** USB_H_XACTERRMSK2 : R/W; bitpos: [7]; default: 0;
 *  1'b0: Mask Transaction Error
 *  1'b1: No Transaction Error Mask
 */
#define USB_H_XACTERRMSK2    (BIT(7))
#define USB_H_XACTERRMSK2_M  (USB_H_XACTERRMSK2_V << USB_H_XACTERRMSK2_S)
#define USB_H_XACTERRMSK2_V  0x00000001
#define USB_H_XACTERRMSK2_S  7
/** USB_H_BBLERRMSK2 : R/W; bitpos: [8]; default: 0;
 *  Babble Error Mask
 *  1'b0: Mask Babble Error
 *  1'b1: No Babble Error Mask
 */
#define USB_H_BBLERRMSK2    (BIT(8))
#define USB_H_BBLERRMSK2_M  (USB_H_BBLERRMSK2_V << USB_H_BBLERRMSK2_S)
#define USB_H_BBLERRMSK2_V  0x00000001
#define USB_H_BBLERRMSK2_S  8
/** USB_H_FRMOVRUNMSK2 : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun Mask
 *  0x0 (MASK): Mask Overrun Mask
 *  0x1 (NOMASK): No Frame Overrun Mask
 */
#define USB_H_FRMOVRUNMSK2    (BIT(9))
#define USB_H_FRMOVRUNMSK2_M  (USB_H_FRMOVRUNMSK2_V << USB_H_FRMOVRUNMSK2_S)
#define USB_H_FRMOVRUNMSK2_V  0x00000001
#define USB_H_FRMOVRUNMSK2_S  9
/** USB_H_DATATGLERRMSK2 : R/W; bitpos: [10]; default: 0;
 *  Data Toggle Error Mask n scatter/gather DMA mode for host
 *  1'b0: Mask Data Toggle Error
 *  1'b1: No Data Toggle Error Mask
 */
#define USB_H_DATATGLERRMSK2    (BIT(10))
#define USB_H_DATATGLERRMSK2_M  (USB_H_DATATGLERRMSK2_V << USB_H_DATATGLERRMSK2_S)
#define USB_H_DATATGLERRMSK2_V  0x00000001
#define USB_H_DATATGLERRMSK2_S  10
/** USB_H_BNAINTRMSK2 : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt mask register
 *  1'b0: BNA Interrupt Masked
 *  1'b1: BNA Interrupt not masked
 */
#define USB_H_BNAINTRMSK2    (BIT(11))
#define USB_H_BNAINTRMSK2_M  (USB_H_BNAINTRMSK2_V << USB_H_BNAINTRMSK2_S)
#define USB_H_BNAINTRMSK2_V  0x00000001
#define USB_H_BNAINTRMSK2_S  11
/** USB_H_DESC_LST_ROLLINTRMSK2 : R/W; bitpos: [13]; default: 0;
 *  Descriptor List rollover interrupt Mask
 *  1'b0: Descriptor Rollover Interrupt Mask
 *  1'b1: Descriptor Rollover Interrupt not masked
 */
#define USB_H_DESC_LST_ROLLINTRMSK2    (BIT(13))
#define USB_H_DESC_LST_ROLLINTRMSK2_M  (USB_H_DESC_LST_ROLLINTRMSK2_V << USB_H_DESC_LST_ROLLINTRMSK2_S)
#define USB_H_DESC_LST_ROLLINTRMSK2_V  0x00000001
#define USB_H_DESC_LST_ROLLINTRMSK2_S  13


/** USB_HCINT3_REG register
 *  Host Channel 3 Interrupt Register
 */
#define USB_HCINT3_REG (SOC_DPORT_USB_BASE + 0x568)
/** USB_H_XFERCOMPL3 : R/W1C; bitpos: [0]; default: 0;
 *  1'b0: Transfer in progress or No Active Transfer
 *  1'b1: Transfer completed normally without any errors
 */
#define USB_H_XFERCOMPL3    (BIT(0))
#define USB_H_XFERCOMPL3_M  (USB_H_XFERCOMPL3_V << USB_H_XFERCOMPL3_S)
#define USB_H_XFERCOMPL3_V  0x00000001
#define USB_H_XFERCOMPL3_S  0
/** USB_H_CHHLTD3 : R/W1C; bitpos: [1]; default: 0;
 *  1'b0: Channel not halted
 *  1'b1: Channel Halted
 */
#define USB_H_CHHLTD3    (BIT(1))
#define USB_H_CHHLTD3_M  (USB_H_CHHLTD3_V << USB_H_CHHLTD3_S)
#define USB_H_CHHLTD3_V  0x00000001
#define USB_H_CHHLTD3_S  1
/** USB_H_AHBERR3 : R/W1C; bitpos: [2]; default: 0;
 *  1'b0: No AHB error
 *  1'b1: AHB error during AHB read/write
 */
#define USB_H_AHBERR3    (BIT(2))
#define USB_H_AHBERR3_M  (USB_H_AHBERR3_V << USB_H_AHBERR3_S)
#define USB_H_AHBERR3_V  0x00000001
#define USB_H_AHBERR3_S  2
/** USB_H_STALL3 : R/W1C; bitpos: [3]; default: 0;
 *  1'b0: No Stall Response Received Interrupt
 *  1'b1: Stall Response Received Interrupt
 */
#define USB_H_STALL3    (BIT(3))
#define USB_H_STALL3_M  (USB_H_STALL3_V << USB_H_STALL3_S)
#define USB_H_STALL3_V  0x00000001
#define USB_H_STALL3_S  3
/** USB_H_NACK3 : R/W1C; bitpos: [4]; default: 0;
 *  1'b0: No NAK Response Received Interrupt
 *  1'b1: NAK Response Received Interrupt
 */
#define USB_H_NACK3    (BIT(4))
#define USB_H_NACK3_M  (USB_H_NACK3_V << USB_H_NACK3_S)
#define USB_H_NACK3_V  0x00000001
#define USB_H_NACK3_S  4
/** USB_H_ACK3 : R/W1C; bitpos: [5]; default: 0;
 *  1'b0: No ACK Response Received or Transmitted Interrupt
 *  1'b1: ACK Response Received or Transmitted Interrupt
 */
#define USB_H_ACK3    (BIT(5))
#define USB_H_ACK3_M  (USB_H_ACK3_V << USB_H_ACK3_S)
#define USB_H_ACK3_V  0x00000001
#define USB_H_ACK3_S  5
/** USB_H_NYET3 : R/W1C; bitpos: [6]; default: 0;
 *  1'b0: No NYET Response Received Interrupt
 *  1'b1: NYET Response Received Interrupt
 */
#define USB_H_NYET3    (BIT(6))
#define USB_H_NYET3_M  (USB_H_NYET3_V << USB_H_NYET3_S)
#define USB_H_NYET3_V  0x00000001
#define USB_H_NYET3_S  6
/** USB_H_XACTERR3 : R/W1C; bitpos: [7]; default: 0;
 *  Indicates one of the following errors occurred on the USB:
 *  CRC check failure
 *  Timeout
 *  Bit stuff error
 *  False EOP
 */
#define USB_H_XACTERR3    (BIT(7))
#define USB_H_XACTERR3_M  (USB_H_XACTERR3_V << USB_H_XACTERR3_S)
#define USB_H_XACTERR3_V  0x00000001
#define USB_H_XACTERR3_S  7
/** USB_H_BBLERR3 : R/W1C; bitpos: [8]; default: 0;
 *  1'b0: No Babble Error
 *  1'b1: Babble Error
 */
#define USB_H_BBLERR3    (BIT(8))
#define USB_H_BBLERR3_M  (USB_H_BBLERR3_V << USB_H_BBLERR3_S)
#define USB_H_BBLERR3_V  0x00000001
#define USB_H_BBLERR3_S  8
/** USB_H_FRMOVRUN3 : R/W1C; bitpos: [9]; default: 0;
 *  1'b0: No Frame Overrun
 *  1'b1: Frame Overrun
 */
#define USB_H_FRMOVRUN3    (BIT(9))
#define USB_H_FRMOVRUN3_M  (USB_H_FRMOVRUN3_V << USB_H_FRMOVRUN3_S)
#define USB_H_FRMOVRUN3_V  0x00000001
#define USB_H_FRMOVRUN3_S  9
/** USB_H_DATATGLERR3 : R/W1C; bitpos: [10]; default: 0;
 *  1'b0: No Data Toggle Error
 *  1'b1: Data Toggle Error
 */
#define USB_H_DATATGLERR3    (BIT(10))
#define USB_H_DATATGLERR3_M  (USB_H_DATATGLERR3_V << USB_H_DATATGLERR3_S)
#define USB_H_DATATGLERR3_V  0x00000001
#define USB_H_DATATGLERR3_S  10
/** USB_H_BNAINTR3 : R/W1C; bitpos: [11]; default: 0;
 *  1'b0: No BNA Interrupt
 *  1'b1: BNA Interrupt
 */
#define USB_H_BNAINTR3    (BIT(11))
#define USB_H_BNAINTR3_M  (USB_H_BNAINTR3_V << USB_H_BNAINTR3_S)
#define USB_H_BNAINTR3_V  0x00000001
#define USB_H_BNAINTR3_S  11
/** USB_H_XCS_XACT_ERR3 : R/W1C; bitpos: [12]; default: 0;
 *  1'b0: No Excessive Transaction Error
 *  1'b1: Excessive Transaction Error
 */
#define USB_H_XCS_XACT_ERR3    (BIT(12))
#define USB_H_XCS_XACT_ERR3_M  (USB_H_XCS_XACT_ERR3_V << USB_H_XCS_XACT_ERR3_S)
#define USB_H_XCS_XACT_ERR3_V  0x00000001
#define USB_H_XCS_XACT_ERR3_S  12
/** USB_H_DESC_LST_ROLLINTR3 : R/W1C; bitpos: [13]; default: 0;
 *  1'b0: No Descriptor rollover interrupt
 *  1'b1: Descriptor rollover interrupt
 */
#define USB_H_DESC_LST_ROLLINTR3    (BIT(13))
#define USB_H_DESC_LST_ROLLINTR3_M  (USB_H_DESC_LST_ROLLINTR3_V << USB_H_DESC_LST_ROLLINTR3_S)
#define USB_H_DESC_LST_ROLLINTR3_V  0x00000001
#define USB_H_DESC_LST_ROLLINTR3_S  13


/** USB_HCINTMSK3_REG register
 *  Host Channel 3 Interrupt Mask Register
 */
#define USB_HCINTMSK3_REG (SOC_DPORT_USB_BASE + 0x56c)
/** USB_H_XFERCOMPLMSK3 : R/W; bitpos: [0]; default: 0;
 *  1'b0: Transfer Completed Mask
 *  1'b1: No Transfer Completed Mask
 */
#define USB_H_XFERCOMPLMSK3    (BIT(0))
#define USB_H_XFERCOMPLMSK3_M  (USB_H_XFERCOMPLMSK3_V << USB_H_XFERCOMPLMSK3_S)
#define USB_H_XFERCOMPLMSK3_V  0x00000001
#define USB_H_XFERCOMPLMSK3_S  0
/** USB_H_CHHLTDMSK3 : R/W; bitpos: [1]; default: 0;
 *  1'b0: Channel Halted Mask
 *  1'b1: No Channel Halted Mask
 */
#define USB_H_CHHLTDMSK3    (BIT(1))
#define USB_H_CHHLTDMSK3_M  (USB_H_CHHLTDMSK3_V << USB_H_CHHLTDMSK3_S)
#define USB_H_CHHLTDMSK3_V  0x00000001
#define USB_H_CHHLTDMSK3_S  1
/** USB_H_AHBERRMSK3 : R/W; bitpos: [2]; default: 0;
 *  1'b0: AHB Error Mask
 *  1'b1: No AHB Error Mask
 */
#define USB_H_AHBERRMSK3    (BIT(2))
#define USB_H_AHBERRMSK3_M  (USB_H_AHBERRMSK3_V << USB_H_AHBERRMSK3_S)
#define USB_H_AHBERRMSK3_V  0x00000001
#define USB_H_AHBERRMSK3_S  2
/** USB_H_STALLMSK3 : R/W; bitpos: [3]; default: 0;
 *  1'b0: Mask STALL Response Received Interrupt
 *  1'b1: No STALL Response Received Interrupt Mask
 */
#define USB_H_STALLMSK3    (BIT(3))
#define USB_H_STALLMSK3_M  (USB_H_STALLMSK3_V << USB_H_STALLMSK3_S)
#define USB_H_STALLMSK3_V  0x00000001
#define USB_H_STALLMSK3_S  3
/** USB_H_NAKMSK3 : R/W; bitpos: [4]; default: 0;
 *  1'b0: Mask NAK Response Received Interrupt
 *  1'b1: No NAK Response Received Interrupt Mask
 */
#define USB_H_NAKMSK3    (BIT(4))
#define USB_H_NAKMSK3_M  (USB_H_NAKMSK3_V << USB_H_NAKMSK3_S)
#define USB_H_NAKMSK3_V  0x00000001
#define USB_H_NAKMSK3_S  4
/** USB_H_ACKMSK3 : R/W; bitpos: [5]; default: 0;
 *  1'b0: Mask ACK Response Received/Transmitted Interrupt
 *  1'b1: No ACK Response Received/Transmitted Interrupt Mask
 */
#define USB_H_ACKMSK3    (BIT(5))
#define USB_H_ACKMSK3_M  (USB_H_ACKMSK3_V << USB_H_ACKMSK3_S)
#define USB_H_ACKMSK3_V  0x00000001
#define USB_H_ACKMSK3_S  5
/** USB_H_NYETMSK3 : R/W; bitpos: [6]; default: 0;
 *  1'b0: Mask NYET Response Received Interrupt
 *  1'b1: No NYET Response Received Interrupt Mask
 */
#define USB_H_NYETMSK3    (BIT(6))
#define USB_H_NYETMSK3_M  (USB_H_NYETMSK3_V << USB_H_NYETMSK3_S)
#define USB_H_NYETMSK3_V  0x00000001
#define USB_H_NYETMSK3_S  6
/** USB_H_XACTERRMSK3 : R/W; bitpos: [7]; default: 0;
 *  1'b0: Mask Transaction Error
 *  1'b1: No Transaction Error Mask
 */
#define USB_H_XACTERRMSK3    (BIT(7))
#define USB_H_XACTERRMSK3_M  (USB_H_XACTERRMSK3_V << USB_H_XACTERRMSK3_S)
#define USB_H_XACTERRMSK3_V  0x00000001
#define USB_H_XACTERRMSK3_S  7
/** USB_H_BBLERRMSK3 : R/W; bitpos: [8]; default: 0;
 *  Babble Error Mask
 *  1'b0: Mask Babble Error
 *  1'b1: No Babble Error Mask
 */
#define USB_H_BBLERRMSK3    (BIT(8))
#define USB_H_BBLERRMSK3_M  (USB_H_BBLERRMSK3_V << USB_H_BBLERRMSK3_S)
#define USB_H_BBLERRMSK3_V  0x00000001
#define USB_H_BBLERRMSK3_S  8
/** USB_H_FRMOVRUNMSK3 : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun Mask
 *  0x0 (MASK): Mask Overrun Mask
 *  0x1 (NOMASK): No Frame Overrun Mask
 */
#define USB_H_FRMOVRUNMSK3    (BIT(9))
#define USB_H_FRMOVRUNMSK3_M  (USB_H_FRMOVRUNMSK3_V << USB_H_FRMOVRUNMSK3_S)
#define USB_H_FRMOVRUNMSK3_V  0x00000001
#define USB_H_FRMOVRUNMSK3_S  9
/** USB_H_DATATGLERRMSK3 : R/W; bitpos: [10]; default: 0;
 *  Data Toggle Error Mask n scatter/gather DMA mode for host
 *  1'b0: Mask Data Toggle Error
 *  1'b1: No Data Toggle Error Mask
 */
#define USB_H_DATATGLERRMSK3    (BIT(10))
#define USB_H_DATATGLERRMSK3_M  (USB_H_DATATGLERRMSK3_V << USB_H_DATATGLERRMSK3_S)
#define USB_H_DATATGLERRMSK3_V  0x00000001
#define USB_H_DATATGLERRMSK3_S  10
/** USB_H_BNAINTRMSK3 : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt mask register
 *  1'b0: BNA Interrupt Masked
 *  1'b1: BNA Interrupt not masked
 */
#define USB_H_BNAINTRMSK3    (BIT(11))
#define USB_H_BNAINTRMSK3_M  (USB_H_BNAINTRMSK3_V << USB_H_BNAINTRMSK3_S)
#define USB_H_BNAINTRMSK3_V  0x00000001
#define USB_H_BNAINTRMSK3_S  11
/** USB_H_DESC_LST_ROLLINTRMSK3 : R/W; bitpos: [13]; default: 0;
 *  Descriptor List rollover interrupt Mask
 *  1'b0: Descriptor Rollover Interrupt Mask
 *  1'b1: Descriptor Rollover Interrupt not masked
 */
#define USB_H_DESC_LST_ROLLINTRMSK3    (BIT(13))
#define USB_H_DESC_LST_ROLLINTRMSK3_M  (USB_H_DESC_LST_ROLLINTRMSK3_V << USB_H_DESC_LST_ROLLINTRMSK3_S)
#define USB_H_DESC_LST_ROLLINTRMSK3_V  0x00000001
#define USB_H_DESC_LST_ROLLINTRMSK3_S  13


