espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_HCINT4_REG register
 *  Host Channel 4 Interrupt Register
 */
#define USB_HCINT4_REG (SOC_DPORT_USB_BASE + 0x588)
/** USB_H_XFERCOMPL4 : R/W1C; bitpos: [0]; default: 0;
 *  1'b0: Transfer in progress or No Active Transfer
 *  1'b1: Transfer completed normally without any errors
 */
#define USB_H_XFERCOMPL4    (BIT(0))
#define USB_H_XFERCOMPL4_M  (USB_H_XFERCOMPL4_V << USB_H_XFERCOMPL4_S)
#define USB_H_XFERCOMPL4_V  0x00000001
#define USB_H_XFERCOMPL4_S  0
/** USB_H_CHHLTD4 : R/W1C; bitpos: [1]; default: 0;
 *  1'b0: Channel not halted
 *  1'b1: Channel Halted
 */
#define USB_H_CHHLTD4    (BIT(1))
#define USB_H_CHHLTD4_M  (USB_H_CHHLTD4_V << USB_H_CHHLTD4_S)
#define USB_H_CHHLTD4_V  0x00000001
#define USB_H_CHHLTD4_S  1
/** USB_H_AHBERR4 : R/W1C; bitpos: [2]; default: 0;
 *  1'b0: No AHB error
 *  1'b1: AHB error during AHB read/write
 */
#define USB_H_AHBERR4    (BIT(2))
#define USB_H_AHBERR4_M  (USB_H_AHBERR4_V << USB_H_AHBERR4_S)
#define USB_H_AHBERR4_V  0x00000001
#define USB_H_AHBERR4_S  2
/** USB_H_STALL4 : R/W1C; bitpos: [3]; default: 0;
 *  1'b0: No Stall Response Received Interrupt
 *  1'b1: Stall Response Received Interrupt
 */
#define USB_H_STALL4    (BIT(3))
#define USB_H_STALL4_M  (USB_H_STALL4_V << USB_H_STALL4_S)
#define USB_H_STALL4_V  0x00000001
#define USB_H_STALL4_S  3
/** USB_H_NACK4 : R/W1C; bitpos: [4]; default: 0;
 *  1'b0: No NAK Response Received Interrupt
 *  1'b1: NAK Response Received Interrupt
 */
#define USB_H_NACK4    (BIT(4))
#define USB_H_NACK4_M  (USB_H_NACK4_V << USB_H_NACK4_S)
#define USB_H_NACK4_V  0x00000001
#define USB_H_NACK4_S  4
/** USB_H_ACK4 : R/W1C; bitpos: [5]; default: 0;
 *  1'b0: No ACK Response Received or Transmitted Interrupt
 *  1'b1: ACK Response Received or Transmitted Interrupt
 */
#define USB_H_ACK4    (BIT(5))
#define USB_H_ACK4_M  (USB_H_ACK4_V << USB_H_ACK4_S)
#define USB_H_ACK4_V  0x00000001
#define USB_H_ACK4_S  5
/** USB_H_NYET4 : R/W1C; bitpos: [6]; default: 0;
 *  1'b0: No NYET Response Received Interrupt
 *  1'b1: NYET Response Received Interrupt
 */
#define USB_H_NYET4    (BIT(6))
#define USB_H_NYET4_M  (USB_H_NYET4_V << USB_H_NYET4_S)
#define USB_H_NYET4_V  0x00000001
#define USB_H_NYET4_S  6
/** USB_H_XACTERR4 : R/W1C; bitpos: [7]; default: 0;
 *  Indicates one of the following errors occurred on the USB:
 *  CRC check failure
 *  Timeout
 *  Bit stuff error
 *  False EOP
 */
#define USB_H_XACTERR4    (BIT(7))
#define USB_H_XACTERR4_M  (USB_H_XACTERR4_V << USB_H_XACTERR4_S)
#define USB_H_XACTERR4_V  0x00000001
#define USB_H_XACTERR4_S  7
/** USB_H_BBLERR4 : R/W1C; bitpos: [8]; default: 0;
 *  1'b0: No Babble Error
 *  1'b1: Babble Error
 */
#define USB_H_BBLERR4    (BIT(8))
#define USB_H_BBLERR4_M  (USB_H_BBLERR4_V << USB_H_BBLERR4_S)
#define USB_H_BBLERR4_V  0x00000001
#define USB_H_BBLERR4_S  8
/** USB_H_FRMOVRUN4 : R/W1C; bitpos: [9]; default: 0;
 *  1'b0: No Frame Overrun
 *  1'b1: Frame Overrun
 */
#define USB_H_FRMOVRUN4    (BIT(9))
#define USB_H_FRMOVRUN4_M  (USB_H_FRMOVRUN4_V << USB_H_FRMOVRUN4_S)
#define USB_H_FRMOVRUN4_V  0x00000001
#define USB_H_FRMOVRUN4_S  9
/** USB_H_DATATGLERR4 : R/W1C; bitpos: [10]; default: 0;
 *  1'b0: No Data Toggle Error
 *  1'b1: Data Toggle Error
 */
#define USB_H_DATATGLERR4    (BIT(10))
#define USB_H_DATATGLERR4_M  (USB_H_DATATGLERR4_V << USB_H_DATATGLERR4_S)
#define USB_H_DATATGLERR4_V  0x00000001
#define USB_H_DATATGLERR4_S  10
/** USB_H_BNAINTR4 : R/W1C; bitpos: [11]; default: 0;
 *  1'b0: No BNA Interrupt
 *  1'b1: BNA Interrupt
 */
#define USB_H_BNAINTR4    (BIT(11))
#define USB_H_BNAINTR4_M  (USB_H_BNAINTR4_V << USB_H_BNAINTR4_S)
#define USB_H_BNAINTR4_V  0x00000001
#define USB_H_BNAINTR4_S  11
/** USB_H_XCS_XACT_ERR4 : R/W1C; bitpos: [12]; default: 0;
 *  1'b0: No Excessive Transaction Error
 *  1'b1: Excessive Transaction Error
 */
#define USB_H_XCS_XACT_ERR4    (BIT(12))
#define USB_H_XCS_XACT_ERR4_M  (USB_H_XCS_XACT_ERR4_V << USB_H_XCS_XACT_ERR4_S)
#define USB_H_XCS_XACT_ERR4_V  0x00000001
#define USB_H_XCS_XACT_ERR4_S  12
/** USB_H_DESC_LST_ROLLINTR4 : R/W1C; bitpos: [13]; default: 0;
 *  1'b0: No Descriptor rollover interrupt
 *  1'b1: Descriptor rollover interrupt
 */
#define USB_H_DESC_LST_ROLLINTR4    (BIT(13))
#define USB_H_DESC_LST_ROLLINTR4_M  (USB_H_DESC_LST_ROLLINTR4_V << USB_H_DESC_LST_ROLLINTR4_S)
#define USB_H_DESC_LST_ROLLINTR4_V  0x00000001
#define USB_H_DESC_LST_ROLLINTR4_S  13


/** USB_HCINTMSK4_REG register
 *  Host Channel 4 Interrupt Mask Register
 */
#define USB_HCINTMSK4_REG (SOC_DPORT_USB_BASE + 0x58c)
/** USB_H_XFERCOMPLMSK4 : R/W; bitpos: [0]; default: 0;
 *  1'b0: Transfer Completed Mask
 *  1'b1: No Transfer Completed Mask
 */
#define USB_H_XFERCOMPLMSK4    (BIT(0))
#define USB_H_XFERCOMPLMSK4_M  (USB_H_XFERCOMPLMSK4_V << USB_H_XFERCOMPLMSK4_S)
#define USB_H_XFERCOMPLMSK4_V  0x00000001
#define USB_H_XFERCOMPLMSK4_S  0
/** USB_H_CHHLTDMSK4 : R/W; bitpos: [1]; default: 0;
 *  1'b0: Channel Halted Mask
 *  1'b1: No Channel Halted Mask
 */
#define USB_H_CHHLTDMSK4    (BIT(1))
#define USB_H_CHHLTDMSK4_M  (USB_H_CHHLTDMSK4_V << USB_H_CHHLTDMSK4_S)
#define USB_H_CHHLTDMSK4_V  0x00000001
#define USB_H_CHHLTDMSK4_S  1
/** USB_H_AHBERRMSK4 : R/W; bitpos: [2]; default: 0;
 *  1'b0: AHB Error Mask
 *  1'b1: No AHB Error Mask
 */
#define USB_H_AHBERRMSK4    (BIT(2))
#define USB_H_AHBERRMSK4_M  (USB_H_AHBERRMSK4_V << USB_H_AHBERRMSK4_S)
#define USB_H_AHBERRMSK4_V  0x00000001
#define USB_H_AHBERRMSK4_S  2
/** USB_H_STALLMSK4 : R/W; bitpos: [3]; default: 0;
 *  1'b0: Mask STALL Response Received Interrupt
 *  1'b1: No STALL Response Received Interrupt Mask
 */
#define USB_H_STALLMSK4    (BIT(3))
#define USB_H_STALLMSK4_M  (USB_H_STALLMSK4_V << USB_H_STALLMSK4_S)
#define USB_H_STALLMSK4_V  0x00000001
#define USB_H_STALLMSK4_S  3
/** USB_H_NAKMSK4 : R/W; bitpos: [4]; default: 0;
 *  1'b0: Mask NAK Response Received Interrupt
 *  1'b1: No NAK Response Received Interrupt Mask
 */
#define USB_H_NAKMSK4    (BIT(4))
#define USB_H_NAKMSK4_M  (USB_H_NAKMSK4_V << USB_H_NAKMSK4_S)
#define USB_H_NAKMSK4_V  0x00000001
#define USB_H_NAKMSK4_S  4
/** USB_H_ACKMSK4 : R/W; bitpos: [5]; default: 0;
 *  1'b0: Mask ACK Response Received/Transmitted Interrupt
 *  1'b1: No ACK Response Received/Transmitted Interrupt Mask
 */
#define USB_H_ACKMSK4    (BIT(5))
#define USB_H_ACKMSK4_M  (USB_H_ACKMSK4_V << USB_H_ACKMSK4_S)
#define USB_H_ACKMSK4_V  0x00000001
#define USB_H_ACKMSK4_S  5
/** USB_H_NYETMSK4 : R/W; bitpos: [6]; default: 0;
 *  1'b0: Mask NYET Response Received Interrupt
 *  1'b1: No NYET Response Received Interrupt Mask
 */
#define USB_H_NYETMSK4    (BIT(6))
#define USB_H_NYETMSK4_M  (USB_H_NYETMSK4_V << USB_H_NYETMSK4_S)
#define USB_H_NYETMSK4_V  0x00000001
#define USB_H_NYETMSK4_S  6
/** USB_H_XACTERRMSK4 : R/W; bitpos: [7]; default: 0;
 *  1'b0: Mask Transaction Error
 *  1'b1: No Transaction Error Mask
 */
#define USB_H_XACTERRMSK4    (BIT(7))
#define USB_H_XACTERRMSK4_M  (USB_H_XACTERRMSK4_V << USB_H_XACTERRMSK4_S)
#define USB_H_XACTERRMSK4_V  0x00000001
#define USB_H_XACTERRMSK4_S  7
/** USB_H_BBLERRMSK4 : R/W; bitpos: [8]; default: 0;
 *  Babble Error Mask
 *  1'b0: Mask Babble Error
 *  1'b1: No Babble Error Mask
 */
#define USB_H_BBLERRMSK4    (BIT(8))
#define USB_H_BBLERRMSK4_M  (USB_H_BBLERRMSK4_V << USB_H_BBLERRMSK4_S)
#define USB_H_BBLERRMSK4_V  0x00000001
#define USB_H_BBLERRMSK4_S  8
/** USB_H_FRMOVRUNMSK4 : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun Mask
 *  0x0 (MASK): Mask Overrun Mask
 *  0x1 (NOMASK): No Frame Overrun Mask
 */
#define USB_H_FRMOVRUNMSK4    (BIT(9))
#define USB_H_FRMOVRUNMSK4_M  (USB_H_FRMOVRUNMSK4_V << USB_H_FRMOVRUNMSK4_S)
#define USB_H_FRMOVRUNMSK4_V  0x00000001
#define USB_H_FRMOVRUNMSK4_S  9
/** USB_H_DATATGLERRMSK4 : R/W; bitpos: [10]; default: 0;
 *  Data Toggle Error Mask n scatter/gather DMA mode for host
 *  1'b0: Mask Data Toggle Error
 *  1'b1: No Data Toggle Error Mask
 */
#define USB_H_DATATGLERRMSK4    (BIT(10))
#define USB_H_DATATGLERRMSK4_M  (USB_H_DATATGLERRMSK4_V << USB_H_DATATGLERRMSK4_S)
#define USB_H_DATATGLERRMSK4_V  0x00000001
#define USB_H_DATATGLERRMSK4_S  10
/** USB_H_BNAINTRMSK4 : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt mask register
 *  1'b0: BNA Interrupt Masked
 *  1'b1: BNA Interrupt not masked
 */
#define USB_H_BNAINTRMSK4    (BIT(11))
#define USB_H_BNAINTRMSK4_M  (USB_H_BNAINTRMSK4_V << USB_H_BNAINTRMSK4_S)
#define USB_H_BNAINTRMSK4_V  0x00000001
#define USB_H_BNAINTRMSK4_S  11
/** USB_H_DESC_LST_ROLLINTRMSK4 : R/W; bitpos: [13]; default: 0;
 *  Descriptor List rollover interrupt Mask
 *  1'b0: Descriptor Rollover Interrupt Mask
 *  1'b1: Descriptor Rollover Interrupt not masked
 */
#define USB_H_DESC_LST_ROLLINTRMSK4    (BIT(13))
#define USB_H_DESC_LST_ROLLINTRMSK4_M  (USB_H_DESC_LST_ROLLINTRMSK4_V << USB_H_DESC_LST_ROLLINTRMSK4_S)
#define USB_H_DESC_LST_ROLLINTRMSK4_V  0x00000001
#define USB_H_DESC_LST_ROLLINTRMSK4_S  13


/** USB_HCINT5_REG register
 *  Host Channel 5 Interrupt Register
 */
#define USB_HCINT5_REG (SOC_DPORT_USB_BASE + 0x5a8)
/** USB_H_XFERCOMPL5 : R/W1C; bitpos: [0]; default: 0;
 *  1'b0: Transfer in progress or No Active Transfer
 *  1'b1: Transfer completed normally without any errors
 */
#define USB_H_XFERCOMPL5    (BIT(0))
#define USB_H_XFERCOMPL5_M  (USB_H_XFERCOMPL5_V << USB_H_XFERCOMPL5_S)
#define USB_H_XFERCOMPL5_V  0x00000001
#define USB_H_XFERCOMPL5_S  0
/** USB_H_CHHLTD5 : R/W1C; bitpos: [1]; default: 0;
 *  1'b0: Channel not halted
 *  1'b1: Channel Halted
 */
#define USB_H_CHHLTD5    (BIT(1))
#define USB_H_CHHLTD5_M  (USB_H_CHHLTD5_V << USB_H_CHHLTD5_S)
#define USB_H_CHHLTD5_V  0x00000001
#define USB_H_CHHLTD5_S  1
/** USB_H_AHBERR5 : R/W1C; bitpos: [2]; default: 0;
 *  1'b0: No AHB error
 *  1'b1: AHB error during AHB read/write
 */
#define USB_H_AHBERR5    (BIT(2))
#define USB_H_AHBERR5_M  (USB_H_AHBERR5_V << USB_H_AHBERR5_S)
#define USB_H_AHBERR5_V  0x00000001
#define USB_H_AHBERR5_S  2
/** USB_H_STALL5 : R/W1C; bitpos: [3]; default: 0;
 *  1'b0: No Stall Response Received Interrupt
 *  1'b1: Stall Response Received Interrupt
 */
#define USB_H_STALL5    (BIT(3))
#define USB_H_STALL5_M  (USB_H_STALL5_V << USB_H_STALL5_S)
#define USB_H_STALL5_V  0x00000001
#define USB_H_STALL5_S  3
/** USB_H_NACK5 : R/W1C; bitpos: [4]; default: 0;
 *  1'b0: No NAK Response Received Interrupt
 *  1'b1: NAK Response Received Interrupt
 */
#define USB_H_NACK5    (BIT(4))
#define USB_H_NACK5_M  (USB_H_NACK5_V << USB_H_NACK5_S)
#define USB_H_NACK5_V  0x00000001
#define USB_H_NACK5_S  4
/** USB_H_ACK5 : R/W1C; bitpos: [5]; default: 0;
 *  1'b0: No ACK Response Received or Transmitted Interrupt
 *  1'b1: ACK Response Received or Transmitted Interrupt
 */
#define USB_H_ACK5    (BIT(5))
#define USB_H_ACK5_M  (USB_H_ACK5_V << USB_H_ACK5_S)
#define USB_H_ACK5_V  0x00000001
#define USB_H_ACK5_S  5
/** USB_H_NYET5 : R/W1C; bitpos: [6]; default: 0;
 *  1'b0: No NYET Response Received Interrupt
 *  1'b1: NYET Response Received Interrupt
 */
#define USB_H_NYET5    (BIT(6))
#define USB_H_NYET5_M  (USB_H_NYET5_V << USB_H_NYET5_S)
#define USB_H_NYET5_V  0x00000001
#define USB_H_NYET5_S  6
/** USB_H_XACTERR5 : R/W1C; bitpos: [7]; default: 0;
 *  Indicates one of the following errors occurred on the USB:
 *  CRC check failure
 *  Timeout
 *  Bit stuff error
 *  False EOP
 */
#define USB_H_XACTERR5    (BIT(7))
#define USB_H_XACTERR5_M  (USB_H_XACTERR5_V << USB_H_XACTERR5_S)
#define USB_H_XACTERR5_V  0x00000001
#define USB_H_XACTERR5_S  7
/** USB_H_BBLERR5 : R/W1C; bitpos: [8]; default: 0;
 *  1'b0: No Babble Error
 *  1'b1: Babble Error
 */
#define USB_H_BBLERR5    (BIT(8))
#define USB_H_BBLERR5_M  (USB_H_BBLERR5_V << USB_H_BBLERR5_S)
#define USB_H_BBLERR5_V  0x00000001
#define USB_H_BBLERR5_S  8
/** USB_H_FRMOVRUN5 : R/W1C; bitpos: [9]; default: 0;
 *  1'b0: No Frame Overrun
 *  1'b1: Frame Overrun
 */
#define USB_H_FRMOVRUN5    (BIT(9))
#define USB_H_FRMOVRUN5_M  (USB_H_FRMOVRUN5_V << USB_H_FRMOVRUN5_S)
#define USB_H_FRMOVRUN5_V  0x00000001
#define USB_H_FRMOVRUN5_S  9
/** USB_H_DATATGLERR5 : R/W1C; bitpos: [10]; default: 0;
 *  1'b0: No Data Toggle Error
 *  1'b1: Data Toggle Error
 */
#define USB_H_DATATGLERR5    (BIT(10))
#define USB_H_DATATGLERR5_M  (USB_H_DATATGLERR5_V << USB_H_DATATGLERR5_S)
#define USB_H_DATATGLERR5_V  0x00000001
#define USB_H_DATATGLERR5_S  10
/** USB_H_BNAINTR5 : R/W1C; bitpos: [11]; default: 0;
 *  1'b0: No BNA Interrupt
 *  1'b1: BNA Interrupt
 */
#define USB_H_BNAINTR5    (BIT(11))
#define USB_H_BNAINTR5_M  (USB_H_BNAINTR5_V << USB_H_BNAINTR5_S)
#define USB_H_BNAINTR5_V  0x00000001
#define USB_H_BNAINTR5_S  11
/** USB_H_XCS_XACT_ERR5 : R/W1C; bitpos: [12]; default: 0;
 *  1'b0: No Excessive Transaction Error
 *  1'b1: Excessive Transaction Error
 */
#define USB_H_XCS_XACT_ERR5    (BIT(12))
#define USB_H_XCS_XACT_ERR5_M  (USB_H_XCS_XACT_ERR5_V << USB_H_XCS_XACT_ERR5_S)
#define USB_H_XCS_XACT_ERR5_V  0x00000001
#define USB_H_XCS_XACT_ERR5_S  12
/** USB_H_DESC_LST_ROLLINTR5 : R/W1C; bitpos: [13]; default: 0;
 *  1'b0: No Descriptor rollover interrupt
 *  1'b1: Descriptor rollover interrupt
 */
#define USB_H_DESC_LST_ROLLINTR5    (BIT(13))
#define USB_H_DESC_LST_ROLLINTR5_M  (USB_H_DESC_LST_ROLLINTR5_V << USB_H_DESC_LST_ROLLINTR5_S)
#define USB_H_DESC_LST_ROLLINTR5_V  0x00000001
#define USB_H_DESC_LST_ROLLINTR5_S  13


/** USB_HCINTMSK5_REG register
 *  Host Channel 5 Interrupt Mask Register
 */
#define USB_HCINTMSK5_REG (SOC_DPORT_USB_BASE + 0x5ac)
/** USB_H_XFERCOMPLMSK5 : R/W; bitpos: [0]; default: 0;
 *  1'b0: Transfer Completed Mask
 *  1'b1: No Transfer Completed Mask
 */
#define USB_H_XFERCOMPLMSK5    (BIT(0))
#define USB_H_XFERCOMPLMSK5_M  (USB_H_XFERCOMPLMSK5_V << USB_H_XFERCOMPLMSK5_S)
#define USB_H_XFERCOMPLMSK5_V  0x00000001
#define USB_H_XFERCOMPLMSK5_S  0
/** USB_H_CHHLTDMSK5 : R/W; bitpos: [1]; default: 0;
 *  1'b0: Channel Halted Mask
 *  1'b1: No Channel Halted Mask
 */
#define USB_H_CHHLTDMSK5    (BIT(1))
#define USB_H_CHHLTDMSK5_M  (USB_H_CHHLTDMSK5_V << USB_H_CHHLTDMSK5_S)
#define USB_H_CHHLTDMSK5_V  0x00000001
#define USB_H_CHHLTDMSK5_S  1
/** USB_H_AHBERRMSK5 : R/W; bitpos: [2]; default: 0;
 *  1'b0: AHB Error Mask
 *  1'b1: No AHB Error Mask
 */
#define USB_H_AHBERRMSK5    (BIT(2))
#define USB_H_AHBERRMSK5_M  (USB_H_AHBERRMSK5_V << USB_H_AHBERRMSK5_S)
#define USB_H_AHBERRMSK5_V  0x00000001
#define USB_H_AHBERRMSK5_S  2
/** USB_H_STALLMSK5 : R/W; bitpos: [3]; default: 0;
 *  1'b0: Mask STALL Response Received Interrupt
 *  1'b1: No STALL Response Received Interrupt Mask
 */
#define USB_H_STALLMSK5    (BIT(3))
#define USB_H_STALLMSK5_M  (USB_H_STALLMSK5_V << USB_H_STALLMSK5_S)
#define USB_H_STALLMSK5_V  0x00000001
#define USB_H_STALLMSK5_S  3
/** USB_H_NAKMSK5 : R/W; bitpos: [4]; default: 0;
 *  1'b0: Mask NAK Response Received Interrupt
 *  1'b1: No NAK Response Received Interrupt Mask
 */
#define USB_H_NAKMSK5    (BIT(4))
#define USB_H_NAKMSK5_M  (USB_H_NAKMSK5_V << USB_H_NAKMSK5_S)
#define USB_H_NAKMSK5_V  0x00000001
#define USB_H_NAKMSK5_S  4
/** USB_H_ACKMSK5 : R/W; bitpos: [5]; default: 0;
 *  1'b0: Mask ACK Response Received/Transmitted Interrupt
 *  1'b1: No ACK Response Received/Transmitted Interrupt Mask
 */
#define USB_H_ACKMSK5    (BIT(5))
#define USB_H_ACKMSK5_M  (USB_H_ACKMSK5_V << USB_H_ACKMSK5_S)
#define USB_H_ACKMSK5_V  0x00000001
#define USB_H_ACKMSK5_S  5
/** USB_H_NYETMSK5 : R/W; bitpos: [6]; default: 0;
 *  1'b0: Mask NYET Response Received Interrupt
 *  1'b1: No NYET Response Received Interrupt Mask
 */
#define USB_H_NYETMSK5    (BIT(6))
#define USB_H_NYETMSK5_M  (USB_H_NYETMSK5_V << USB_H_NYETMSK5_S)
#define USB_H_NYETMSK5_V  0x00000001
#define USB_H_NYETMSK5_S  6
/** USB_H_XACTERRMSK5 : R/W; bitpos: [7]; default: 0;
 *  1'b0: Mask Transaction Error
 *  1'b1: No Transaction Error Mask
 */
#define USB_H_XACTERRMSK5    (BIT(7))
#define USB_H_XACTERRMSK5_M  (USB_H_XACTERRMSK5_V << USB_H_XACTERRMSK5_S)
#define USB_H_XACTERRMSK5_V  0x00000001
#define USB_H_XACTERRMSK5_S  7
/** USB_H_BBLERRMSK5 : R/W; bitpos: [8]; default: 0;
 *  Babble Error Mask
 *  1'b0: Mask Babble Error
 *  1'b1: No Babble Error Mask
 */
#define USB_H_BBLERRMSK5    (BIT(8))
#define USB_H_BBLERRMSK5_M  (USB_H_BBLERRMSK5_V << USB_H_BBLERRMSK5_S)
#define USB_H_BBLERRMSK5_V  0x00000001
#define USB_H_BBLERRMSK5_S  8
/** USB_H_FRMOVRUNMSK5 : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun Mask
 *  0x0 (MASK): Mask Overrun Mask
 *  0x1 (NOMASK): No Frame Overrun Mask
 */
#define USB_H_FRMOVRUNMSK5    (BIT(9))
#define USB_H_FRMOVRUNMSK5_M  (USB_H_FRMOVRUNMSK5_V << USB_H_FRMOVRUNMSK5_S)
#define USB_H_FRMOVRUNMSK5_V  0x00000001
#define USB_H_FRMOVRUNMSK5_S  9
/** USB_H_DATATGLERRMSK5 : R/W; bitpos: [10]; default: 0;
 *  Data Toggle Error Mask n scatter/gather DMA mode for host
 *  1'b0: Mask Data Toggle Error
 *  1'b1: No Data Toggle Error Mask
 */
#define USB_H_DATATGLERRMSK5    (BIT(10))
#define USB_H_DATATGLERRMSK5_M  (USB_H_DATATGLERRMSK5_V << USB_H_DATATGLERRMSK5_S)
#define USB_H_DATATGLERRMSK5_V  0x00000001
#define USB_H_DATATGLERRMSK5_S  10
/** USB_H_BNAINTRMSK5 : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt mask register
 *  1'b0: BNA Interrupt Masked
 *  1'b1: BNA Interrupt not masked
 */
#define USB_H_BNAINTRMSK5    (BIT(11))
#define USB_H_BNAINTRMSK5_M  (USB_H_BNAINTRMSK5_V << USB_H_BNAINTRMSK5_S)
#define USB_H_BNAINTRMSK5_V  0x00000001
#define USB_H_BNAINTRMSK5_S  11
/** USB_H_DESC_LST_ROLLINTRMSK5 : R/W; bitpos: [13]; default: 0;
 *  Descriptor List rollover interrupt Mask
 *  1'b0: Descriptor Rollover Interrupt Mask
 *  1'b1: Descriptor Rollover Interrupt not masked
 */
#define USB_H_DESC_LST_ROLLINTRMSK5    (BIT(13))
#define USB_H_DESC_LST_ROLLINTRMSK5_M  (USB_H_DESC_LST_ROLLINTRMSK5_V << USB_H_DESC_LST_ROLLINTRMSK5_S)
#define USB_H_DESC_LST_ROLLINTRMSK5_V  0x00000001
#define USB_H_DESC_LST_ROLLINTRMSK5_S  13


/** USB_HCINT6_REG register
 *  Host Channel 6 Interrupt Register
 */
#define USB_HCINT6_REG (SOC_DPORT_USB_BASE + 0x5c8)
/** USB_H_XFERCOMPL6 : R/W1C; bitpos: [0]; default: 0;
 *  1'b0: Transfer in progress or No Active Transfer
 *  1'b1: Transfer completed normally without any errors
 */
#define USB_H_XFERCOMPL6    (BIT(0))
#define USB_H_XFERCOMPL6_M  (USB_H_XFERCOMPL6_V << USB_H_XFERCOMPL6_S)
#define USB_H_XFERCOMPL6_V  0x00000001
#define USB_H_XFERCOMPL6_S  0
/** USB_H_CHHLTD6 : R/W1C; bitpos: [1]; default: 0;
 *  1'b0: Channel not halted
 *  1'b1: Channel Halted
 */
#define USB_H_CHHLTD6    (BIT(1))
#define USB_H_CHHLTD6_M  (USB_H_CHHLTD6_V << USB_H_CHHLTD6_S)
#define USB_H_CHHLTD6_V  0x00000001
#define USB_H_CHHLTD6_S  1
/** USB_H_AHBERR6 : R/W1C; bitpos: [2]; default: 0;
 *  1'b0: No AHB error
 *  1'b1: AHB error during AHB read/write
 */
#define USB_H_AHBERR6    (BIT(2))
#define USB_H_AHBERR6_M  (USB_H_AHBERR6_V << USB_H_AHBERR6_S)
#define USB_H_AHBERR6_V  0x00000001
#define USB_H_AHBERR6_S  2
/** USB_H_STALL6 : R/W1C; bitpos: [3]; default: 0;
 *  1'b0: No Stall Response Received Interrupt
 *  1'b1: Stall Response Received Interrupt
 */
#define USB_H_STALL6    (BIT(3))
#define USB_H_STALL6_M  (USB_H_STALL6_V << USB_H_STALL6_S)
#define USB_H_STALL6_V  0x00000001
#define USB_H_STALL6_S  3
/** USB_H_NACK6 : R/W1C; bitpos: [4]; default: 0;
 *  1'b0: No NAK Response Received Interrupt
 *  1'b1: NAK Response Received Interrupt
 */
#define USB_H_NACK6    (BIT(4))
#define USB_H_NACK6_M  (USB_H_NACK6_V << USB_H_NACK6_S)
#define USB_H_NACK6_V  0x00000001
#define USB_H_NACK6_S  4
/** USB_H_ACK6 : R/W1C; bitpos: [5]; default: 0;
 *  1'b0: No ACK Response Received or Transmitted Interrupt
 *  1'b1: ACK Response Received or Transmitted Interrupt
 */
#define USB_H_ACK6    (BIT(5))
#define USB_H_ACK6_M  (USB_H_ACK6_V << USB_H_ACK6_S)
#define USB_H_ACK6_V  0x00000001
#define USB_H_ACK6_S  5
/** USB_H_NYET6 : R/W1C; bitpos: [6]; default: 0;
 *  1'b0: No NYET Response Received Interrupt
 *  1'b1: NYET Response Received Interrupt
 */
#define USB_H_NYET6    (BIT(6))
#define USB_H_NYET6_M  (USB_H_NYET6_V << USB_H_NYET6_S)
#define USB_H_NYET6_V  0x00000001
#define USB_H_NYET6_S  6
/** USB_H_XACTERR6 : R/W1C; bitpos: [7]; default: 0;
 *  Indicates one of the following errors occurred on the USB:
 *  CRC check failure
 *  Timeout
 *  Bit stuff error
 *  False EOP
 */
#define USB_H_XACTERR6    (BIT(7))
#define USB_H_XACTERR6_M  (USB_H_XACTERR6_V << USB_H_XACTERR6_S)
#define USB_H_XACTERR6_V  0x00000001
#define USB_H_XACTERR6_S  7
/** USB_H_BBLERR6 : R/W1C; bitpos: [8]; default: 0;
 *  1'b0: No Babble Error
 *  1'b1: Babble Error
 */
#define USB_H_BBLERR6    (BIT(8))
#define USB_H_BBLERR6_M  (USB_H_BBLERR6_V << USB_H_BBLERR6_S)
#define USB_H_BBLERR6_V  0x00000001
#define USB_H_BBLERR6_S  8
/** USB_H_FRMOVRUN6 : R/W1C; bitpos: [9]; default: 0;
 *  1'b0: No Frame Overrun
 *  1'b1: Frame Overrun
 */
#define USB_H_FRMOVRUN6    (BIT(9))
#define USB_H_FRMOVRUN6_M  (USB_H_FRMOVRUN6_V << USB_H_FRMOVRUN6_S)
#define USB_H_FRMOVRUN6_V  0x00000001
#define USB_H_FRMOVRUN6_S  9
/** USB_H_DATATGLERR6 : R/W1C; bitpos: [10]; default: 0;
 *  1'b0: No Data Toggle Error
 *  1'b1: Data Toggle Error
 */
#define USB_H_DATATGLERR6    (BIT(10))
#define USB_H_DATATGLERR6_M  (USB_H_DATATGLERR6_V << USB_H_DATATGLERR6_S)
#define USB_H_DATATGLERR6_V  0x00000001
#define USB_H_DATATGLERR6_S  10
/** USB_H_BNAINTR6 : R/W1C; bitpos: [11]; default: 0;
 *  1'b0: No BNA Interrupt
 *  1'b1: BNA Interrupt
 */
#define USB_H_BNAINTR6    (BIT(11))
#define USB_H_BNAINTR6_M  (USB_H_BNAINTR6_V << USB_H_BNAINTR6_S)
#define USB_H_BNAINTR6_V  0x00000001
#define USB_H_BNAINTR6_S  11
/** USB_H_XCS_XACT_ERR6 : R/W1C; bitpos: [12]; default: 0;
 *  1'b0: No Excessive Transaction Error
 *  1'b1: Excessive Transaction Error
 */
#define USB_H_XCS_XACT_ERR6    (BIT(12))
#define USB_H_XCS_XACT_ERR6_M  (USB_H_XCS_XACT_ERR6_V << USB_H_XCS_XACT_ERR6_S)
#define USB_H_XCS_XACT_ERR6_V  0x00000001
#define USB_H_XCS_XACT_ERR6_S  12
/** USB_H_DESC_LST_ROLLINTR6 : R/W1C; bitpos: [13]; default: 0;
 *  1'b0: No Descriptor rollover interrupt
 *  1'b1: Descriptor rollover interrupt
 */
#define USB_H_DESC_LST_ROLLINTR6    (BIT(13))
#define USB_H_DESC_LST_ROLLINTR6_M  (USB_H_DESC_LST_ROLLINTR6_V << USB_H_DESC_LST_ROLLINTR6_S)
#define USB_H_DESC_LST_ROLLINTR6_V  0x00000001
#define USB_H_DESC_LST_ROLLINTR6_S  13


