espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_HCINTMSK7_REG register
 *  Host Channel 7 Interrupt Mask Register
 */
#define USB_HCINTMSK7_REG (SOC_DPORT_USB_BASE + 0x5ec)
/** USB_H_XFERCOMPLMSK7 : R/W; bitpos: [0]; default: 0;
 *  1'b0: Transfer Completed Mask
 *  1'b1: No Transfer Completed Mask
 */
#define USB_H_XFERCOMPLMSK7    (BIT(0))
#define USB_H_XFERCOMPLMSK7_M  (USB_H_XFERCOMPLMSK7_V << USB_H_XFERCOMPLMSK7_S)
#define USB_H_XFERCOMPLMSK7_V  0x00000001
#define USB_H_XFERCOMPLMSK7_S  0
/** USB_H_CHHLTDMSK7 : R/W; bitpos: [1]; default: 0;
 *  1'b0: Channel Halted Mask
 *  1'b1: No Channel Halted Mask
 */
#define USB_H_CHHLTDMSK7    (BIT(1))
#define USB_H_CHHLTDMSK7_M  (USB_H_CHHLTDMSK7_V << USB_H_CHHLTDMSK7_S)
#define USB_H_CHHLTDMSK7_V  0x00000001
#define USB_H_CHHLTDMSK7_S  1
/** USB_H_AHBERRMSK7 : R/W; bitpos: [2]; default: 0;
 *  1'b0: AHB Error Mask
 *  1'b1: No AHB Error Mask
 */
#define USB_H_AHBERRMSK7    (BIT(2))
#define USB_H_AHBERRMSK7_M  (USB_H_AHBERRMSK7_V << USB_H_AHBERRMSK7_S)
#define USB_H_AHBERRMSK7_V  0x00000001
#define USB_H_AHBERRMSK7_S  2
/** USB_H_STALLMSK7 : R/W; bitpos: [3]; default: 0;
 *  1'b0: Mask STALL Response Received Interrupt
 *  1'b1: No STALL Response Received Interrupt Mask
 */
#define USB_H_STALLMSK7    (BIT(3))
#define USB_H_STALLMSK7_M  (USB_H_STALLMSK7_V << USB_H_STALLMSK7_S)
#define USB_H_STALLMSK7_V  0x00000001
#define USB_H_STALLMSK7_S  3
/** USB_H_NAKMSK7 : R/W; bitpos: [4]; default: 0;
 *  1'b0: Mask NAK Response Received Interrupt
 *  1'b1: No NAK Response Received Interrupt Mask
 */
#define USB_H_NAKMSK7    (BIT(4))
#define USB_H_NAKMSK7_M  (USB_H_NAKMSK7_V << USB_H_NAKMSK7_S)
#define USB_H_NAKMSK7_V  0x00000001
#define USB_H_NAKMSK7_S  4
/** USB_H_ACKMSK7 : R/W; bitpos: [5]; default: 0;
 *  1'b0: Mask ACK Response Received/Transmitted Interrupt
 *  1'b1: No ACK Response Received/Transmitted Interrupt Mask
 */
#define USB_H_ACKMSK7    (BIT(5))
#define USB_H_ACKMSK7_M  (USB_H_ACKMSK7_V << USB_H_ACKMSK7_S)
#define USB_H_ACKMSK7_V  0x00000001
#define USB_H_ACKMSK7_S  5
/** USB_H_NYETMSK7 : R/W; bitpos: [6]; default: 0;
 *  1'b0: Mask NYET Response Received Interrupt
 *  1'b1: No NYET Response Received Interrupt Mask
 */
#define USB_H_NYETMSK7    (BIT(6))
#define USB_H_NYETMSK7_M  (USB_H_NYETMSK7_V << USB_H_NYETMSK7_S)
#define USB_H_NYETMSK7_V  0x00000001
#define USB_H_NYETMSK7_S  6
/** USB_H_XACTERRMSK7 : R/W; bitpos: [7]; default: 0;
 *  1'b0: Mask Transaction Error
 *  1'b1: No Transaction Error Mask
 */
#define USB_H_XACTERRMSK7    (BIT(7))
#define USB_H_XACTERRMSK7_M  (USB_H_XACTERRMSK7_V << USB_H_XACTERRMSK7_S)
#define USB_H_XACTERRMSK7_V  0x00000001
#define USB_H_XACTERRMSK7_S  7
/** USB_H_BBLERRMSK7 : R/W; bitpos: [8]; default: 0;
 *  Babble Error Mask
 *  1'b0: Mask Babble Error
 *  1'b1: No Babble Error Mask
 */
#define USB_H_BBLERRMSK7    (BIT(8))
#define USB_H_BBLERRMSK7_M  (USB_H_BBLERRMSK7_V << USB_H_BBLERRMSK7_S)
#define USB_H_BBLERRMSK7_V  0x00000001
#define USB_H_BBLERRMSK7_S  8
/** USB_H_FRMOVRUNMSK7 : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun Mask
 *  0x0 (MASK): Mask Overrun Mask
 *  0x1 (NOMASK): No Frame Overrun Mask
 */
#define USB_H_FRMOVRUNMSK7    (BIT(9))
#define USB_H_FRMOVRUNMSK7_M  (USB_H_FRMOVRUNMSK7_V << USB_H_FRMOVRUNMSK7_S)
#define USB_H_FRMOVRUNMSK7_V  0x00000001
#define USB_H_FRMOVRUNMSK7_S  9
/** USB_H_DATATGLERRMSK7 : R/W; bitpos: [10]; default: 0;
 *  Data Toggle Error Mask n scatter/gather DMA mode for host
 *  1'b0: Mask Data Toggle Error
 *  1'b1: No Data Toggle Error Mask
 */
#define USB_H_DATATGLERRMSK7    (BIT(10))
#define USB_H_DATATGLERRMSK7_M  (USB_H_DATATGLERRMSK7_V << USB_H_DATATGLERRMSK7_S)
#define USB_H_DATATGLERRMSK7_V  0x00000001
#define USB_H_DATATGLERRMSK7_S  10
/** USB_H_BNAINTRMSK7 : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt mask register
 *  1'b0: BNA Interrupt Masked
 *  1'b1: BNA Interrupt not masked
 */
#define USB_H_BNAINTRMSK7    (BIT(11))
#define USB_H_BNAINTRMSK7_M  (USB_H_BNAINTRMSK7_V << USB_H_BNAINTRMSK7_S)
#define USB_H_BNAINTRMSK7_V  0x00000001
#define USB_H_BNAINTRMSK7_S  11
/** USB_H_DESC_LST_ROLLINTRMSK7 : R/W; bitpos: [13]; default: 0;
 *  Descriptor List rollover interrupt Mask
 *  1'b0: Descriptor Rollover Interrupt Mask
 *  1'b1: Descriptor Rollover Interrupt not masked
 */
#define USB_H_DESC_LST_ROLLINTRMSK7    (BIT(13))
#define USB_H_DESC_LST_ROLLINTRMSK7_M  (USB_H_DESC_LST_ROLLINTRMSK7_V << USB_H_DESC_LST_ROLLINTRMSK7_S)
#define USB_H_DESC_LST_ROLLINTRMSK7_V  0x00000001
#define USB_H_DESC_LST_ROLLINTRMSK7_S  13


/** USB_DIEPMSK_REG register
 *  Device IN Endpoint Common Interrupt Mask Register
 */
#define USB_DIEPMSK_REG (SOC_DPORT_USB_BASE + 0x810)
/** USB_DI_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  0x0 : Mask Transfer Completed Interrupt
 *  0x1 : No Transfer Completed Interrupt Mask
 */
#define USB_DI_XFERCOMPLMSK    (BIT(0))
#define USB_DI_XFERCOMPLMSK_M  (USB_DI_XFERCOMPLMSK_V << USB_DI_XFERCOMPLMSK_S)
#define USB_DI_XFERCOMPLMSK_V  0x00000001
#define USB_DI_XFERCOMPLMSK_S  0
/** USB_DI_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  0x0 : Mask Endpoint Disabled Interrupt
 *  0x1 : No Endpoint Disabled Interrupt Mask
 */
#define USB_DI_EPDISBLDMSK    (BIT(1))
#define USB_DI_EPDISBLDMSK_M  (USB_DI_EPDISBLDMSK_V << USB_DI_EPDISBLDMSK_S)
#define USB_DI_EPDISBLDMSK_V  0x00000001
#define USB_DI_EPDISBLDMSK_S  1
/** USB_DI_AHBERMSK : R/W; bitpos: [2]; default: 0;
 *  0x0 : Mask AHB Error Interrupt
 *  0x1 : No AHB Error Interrupt Mask
 */
#define USB_DI_AHBERMSK    (BIT(2))
#define USB_DI_AHBERMSK_M  (USB_DI_AHBERMSK_V << USB_DI_AHBERMSK_S)
#define USB_DI_AHBERMSK_V  0x00000001
#define USB_DI_AHBERMSK_S  2
/** USB_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  0x0 : Mask Timeout Condition Interrupt
 *  0x1 : No Timeout Condition Interrupt Mask
 */
#define USB_TIMEOUTMSK    (BIT(3))
#define USB_TIMEOUTMSK_M  (USB_TIMEOUTMSK_V << USB_TIMEOUTMSK_S)
#define USB_TIMEOUTMSK_V  0x00000001
#define USB_TIMEOUTMSK_S  3
/** USB_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  0x0 : Mask IN Token Received When TxFIFO Empty Interrupt
 *  0x1 : No IN Token Received When TxFIFO Empty Interrupt
 */
#define USB_INTKNTXFEMPMSK    (BIT(4))
#define USB_INTKNTXFEMPMSK_M  (USB_INTKNTXFEMPMSK_V << USB_INTKNTXFEMPMSK_S)
#define USB_INTKNTXFEMPMSK_V  0x00000001
#define USB_INTKNTXFEMPMSK_S  4
/** USB_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  0x0 : Mask IN Token received with EP Mismatch Interrupt
 *  0x1 : No Mask IN Token received with EP Mismatch Interrupt
 */
#define USB_INTKNEPMISMSK    (BIT(5))
#define USB_INTKNEPMISMSK_M  (USB_INTKNEPMISMSK_V << USB_INTKNEPMISMSK_S)
#define USB_INTKNEPMISMSK_V  0x00000001
#define USB_INTKNEPMISMSK_S  5
/** USB_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  0x0 : Mask IN Endpoint NAK Effective Interrupt
 *  0x1 : No IN Endpoint NAK Effective Interrupt Mask
 */
#define USB_INEPNAKEFFMSK    (BIT(6))
#define USB_INEPNAKEFFMSK_M  (USB_INEPNAKEFFMSK_V << USB_INEPNAKEFFMSK_S)
#define USB_INEPNAKEFFMSK_V  0x00000001
#define USB_INEPNAKEFFMSK_S  6
/** USB_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  0x0 : Mask Fifo Underrun Interrupt
 *  0x1 : No Fifo Underrun Interrupt Mask
 */
#define USB_TXFIFOUNDRNMSK    (BIT(8))
#define USB_TXFIFOUNDRNMSK_M  (USB_TXFIFOUNDRNMSK_V << USB_TXFIFOUNDRNMSK_S)
#define USB_TXFIFOUNDRNMSK_V  0x00000001
#define USB_TXFIFOUNDRNMSK_S  8
/** USB_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  0x0 : Mask BNA Interrupt
 *  0x1 : No BNA Interrupt Mask
 */
#define USB_BNAININTRMSK    (BIT(9))
#define USB_BNAININTRMSK_M  (USB_BNAININTRMSK_V << USB_BNAININTRMSK_S)
#define USB_BNAININTRMSK_V  0x00000001
#define USB_BNAININTRMSK_S  9
/** USB_DI_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  0x0 : Mask NAK Interrupt
 *  0x1 : No Mask NAK Interrupt
 */
#define USB_DI_NAKMSK    (BIT(13))
#define USB_DI_NAKMSK_M  (USB_DI_NAKMSK_V << USB_DI_NAKMSK_S)
#define USB_DI_NAKMSK_V  0x00000001
#define USB_DI_NAKMSK_S  13


/** USB_DOEPMSK_REG register
 *  Device OUT Endpoint Common Interrupt Mask Register
 */
#define USB_DOEPMSK_REG (SOC_DPORT_USB_BASE + 0x814)
/** USB_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  0x0 : Mask Transfer Completed Interrupt
 *  0x1 : No Transfer Completed Interrupt Mask
 */
#define USB_XFERCOMPLMSK    (BIT(0))
#define USB_XFERCOMPLMSK_M  (USB_XFERCOMPLMSK_V << USB_XFERCOMPLMSK_S)
#define USB_XFERCOMPLMSK_V  0x00000001
#define USB_XFERCOMPLMSK_S  0
/** USB_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  0x0 : Mask Endpoint Disabled Interrupt
 *  0x1 : No Endpoint Disabled Interrupt Mask
 */
#define USB_EPDISBLDMSK    (BIT(1))
#define USB_EPDISBLDMSK_M  (USB_EPDISBLDMSK_V << USB_EPDISBLDMSK_S)
#define USB_EPDISBLDMSK_V  0x00000001
#define USB_EPDISBLDMSK_S  1
/** USB_AHBERMSK : R/W; bitpos: [2]; default: 0;
 *  0x0 : Mask AHB Error Interrupt
 *  0x1 : No AHB Error Interrupt Mask
 */
#define USB_AHBERMSK    (BIT(2))
#define USB_AHBERMSK_M  (USB_AHBERMSK_V << USB_AHBERMSK_S)
#define USB_AHBERMSK_V  0x00000001
#define USB_AHBERMSK_S  2
/** USB_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  0x0 : Mask SETUP Phase Done Interrupt
 *  0x1 : No SETUP Phase Done Interrupt Mask
 */
#define USB_SETUPMSK    (BIT(3))
#define USB_SETUPMSK_M  (USB_SETUPMSK_V << USB_SETUPMSK_S)
#define USB_SETUPMSK_V  0x00000001
#define USB_SETUPMSK_S  3
/** USB_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  0x0 : Mask OUT Token Received when Endpoint Disabled Interrupt
 *  0x1 : No OUT Token Received when Endpoint Disabled Interrupt Mask
 */
#define USB_OUTTKNEPDISMSK    (BIT(4))
#define USB_OUTTKNEPDISMSK_M  (USB_OUTTKNEPDISMSK_V << USB_OUTTKNEPDISMSK_S)
#define USB_OUTTKNEPDISMSK_V  0x00000001
#define USB_OUTTKNEPDISMSK_S  4
/** USB_STSPHSERCVDMSK : R/W; bitpos: [5]; default: 0;
 *  0x0 : Status Phase Received Mask
 *  0x1 : No Status Phase Received Mask
 */
#define USB_STSPHSERCVDMSK    (BIT(5))
#define USB_STSPHSERCVDMSK_M  (USB_STSPHSERCVDMSK_V << USB_STSPHSERCVDMSK_S)
#define USB_STSPHSERCVDMSK_V  0x00000001
#define USB_STSPHSERCVDMSK_S  5
/** USB_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  0x0 : Mask Back-to-Back SETUP Packets Received Interrupt
 *  0x1 : No Back-to-Back SETUP Packets Received Interrupt Mask
 */
#define USB_BACK2BACKSETUP    (BIT(6))
#define USB_BACK2BACKSETUP_M  (USB_BACK2BACKSETUP_V << USB_BACK2BACKSETUP_S)
#define USB_BACK2BACKSETUP_V  0x00000001
#define USB_BACK2BACKSETUP_S  6
/** USB_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  0x0 : Mask OUT Packet Error Interrupt
 *  0x1 : No OUT Packet Error Interrupt Mask
 */
#define USB_OUTPKTERRMSK    (BIT(8))
#define USB_OUTPKTERRMSK_M  (USB_OUTPKTERRMSK_V << USB_OUTPKTERRMSK_S)
#define USB_OUTPKTERRMSK_V  0x00000001
#define USB_OUTPKTERRMSK_S  8
/** USB_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  0x0 : Mask BNA Interrupt
 *  0x1 : No BNA Interrupt Mask
 */
#define USB_BNAOUTINTRMSK    (BIT(9))
#define USB_BNAOUTINTRMSK_M  (USB_BNAOUTINTRMSK_V << USB_BNAOUTINTRMSK_S)
#define USB_BNAOUTINTRMSK_V  0x00000001
#define USB_BNAOUTINTRMSK_S  9
/** USB_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  0x0 : Mask Babble Error Interrupt
 *  0x1 : No Babble Error Interrupt Mask
 */
#define USB_BBLEERRMSK    (BIT(12))
#define USB_BBLEERRMSK_M  (USB_BBLEERRMSK_V << USB_BBLEERRMSK_S)
#define USB_BBLEERRMSK_V  0x00000001
#define USB_BBLEERRMSK_S  12
/** USB_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  0x0 : Mask NAK Interrupt
 *  0x1 : No NAK Interrupt Mask
 */
#define USB_NAKMSK    (BIT(13))
#define USB_NAKMSK_M  (USB_NAKMSK_V << USB_NAKMSK_S)
#define USB_NAKMSK_V  0x00000001
#define USB_NAKMSK_S  13
/** USB_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask
 *  0x0 : Mask NYET Interrupt
 *  0x1 : No NYET Interrupt Mask
 */
#define USB_NYETMSK    (BIT(14))
#define USB_NYETMSK_M  (USB_NYETMSK_V << USB_NYETMSK_S)
#define USB_NYETMSK_V  0x00000001
#define USB_NYETMSK_S  14


