espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_DAINT_REG register
 *  Device All Endpoints Interrupt Register
 */
#define USB_DAINT_REG (SOC_DPORT_USB_BASE + 0x818)
/** USB_INEPINT0 : RO; bitpos: [0]; default: 0;
 *  IN Endpoint 0 Interrupt Bit.
 */
#define USB_INEPINT0    (BIT(0))
#define USB_INEPINT0_M  (USB_INEPINT0_V << USB_INEPINT0_S)
#define USB_INEPINT0_V  0x00000001
#define USB_INEPINT0_S  0
/** USB_INEPINT1 : RO; bitpos: [1]; default: 0;
 *  IN Endpoint 1 Interrupt Bit.
 */
#define USB_INEPINT1    (BIT(1))
#define USB_INEPINT1_M  (USB_INEPINT1_V << USB_INEPINT1_S)
#define USB_INEPINT1_V  0x00000001
#define USB_INEPINT1_S  1
/** USB_INEPINT2 : RO; bitpos: [2]; default: 0;
 *  IN Endpoint 2 Interrupt Bit.
 */
#define USB_INEPINT2    (BIT(2))
#define USB_INEPINT2_M  (USB_INEPINT2_V << USB_INEPINT2_S)
#define USB_INEPINT2_V  0x00000001
#define USB_INEPINT2_S  2
/** USB_INEPINT3 : RO; bitpos: [3]; default: 0;
 *  IN Endpoint 3 Interrupt Bit.
 */
#define USB_INEPINT3    (BIT(3))
#define USB_INEPINT3_M  (USB_INEPINT3_V << USB_INEPINT3_S)
#define USB_INEPINT3_V  0x00000001
#define USB_INEPINT3_S  3
/** USB_INEPINT4 : RO; bitpos: [4]; default: 0;
 *  IN Endpoint 4 Interrupt Bit.
 */
#define USB_INEPINT4    (BIT(4))
#define USB_INEPINT4_M  (USB_INEPINT4_V << USB_INEPINT4_S)
#define USB_INEPINT4_V  0x00000001
#define USB_INEPINT4_S  4
/** USB_INEPINT5 : RO; bitpos: [5]; default: 0;
 *  IN Endpoint 5 Interrupt Bit.
 */
#define USB_INEPINT5    (BIT(5))
#define USB_INEPINT5_M  (USB_INEPINT5_V << USB_INEPINT5_S)
#define USB_INEPINT5_V  0x00000001
#define USB_INEPINT5_S  5
/** USB_INEPINT6 : RO; bitpos: [6]; default: 0;
 *  IN Endpoint 6 Interrupt Bit.
 */
#define USB_INEPINT6    (BIT(6))
#define USB_INEPINT6_M  (USB_INEPINT6_V << USB_INEPINT6_S)
#define USB_INEPINT6_V  0x00000001
#define USB_INEPINT6_S  6
/** USB_OUTEPINT0 : RO; bitpos: [16]; default: 0;
 *  OUT Endpoint 0 Interrupt Bit.
 */
#define USB_OUTEPINT0    (BIT(16))
#define USB_OUTEPINT0_M  (USB_OUTEPINT0_V << USB_OUTEPINT0_S)
#define USB_OUTEPINT0_V  0x00000001
#define USB_OUTEPINT0_S  16
/** USB_OUTEPINT1 : RO; bitpos: [17]; default: 0;
 *  OUT Endpoint 1 Interrupt Bit.
 */
#define USB_OUTEPINT1    (BIT(17))
#define USB_OUTEPINT1_M  (USB_OUTEPINT1_V << USB_OUTEPINT1_S)
#define USB_OUTEPINT1_V  0x00000001
#define USB_OUTEPINT1_S  17
/** USB_OUTEPINT2 : RO; bitpos: [18]; default: 0;
 *  OUT Endpoint 2 Interrupt Bit.
 */
#define USB_OUTEPINT2    (BIT(18))
#define USB_OUTEPINT2_M  (USB_OUTEPINT2_V << USB_OUTEPINT2_S)
#define USB_OUTEPINT2_V  0x00000001
#define USB_OUTEPINT2_S  18
/** USB_OUTEPINT3 : RO; bitpos: [19]; default: 0;
 *  OUT Endpoint 3 Interrupt Bit.
 */
#define USB_OUTEPINT3    (BIT(19))
#define USB_OUTEPINT3_M  (USB_OUTEPINT3_V << USB_OUTEPINT3_S)
#define USB_OUTEPINT3_V  0x00000001
#define USB_OUTEPINT3_S  19
/** USB_OUTEPINT4 : RO; bitpos: [20]; default: 0;
 *  OUT Endpoint 4 Interrupt Bit.
 */
#define USB_OUTEPINT4    (BIT(20))
#define USB_OUTEPINT4_M  (USB_OUTEPINT4_V << USB_OUTEPINT4_S)
#define USB_OUTEPINT4_V  0x00000001
#define USB_OUTEPINT4_S  20
/** USB_OUTEPINT5 : RO; bitpos: [21]; default: 0;
 *  OUT Endpoint 5 Interrupt Bit.
 */
#define USB_OUTEPINT5    (BIT(21))
#define USB_OUTEPINT5_M  (USB_OUTEPINT5_V << USB_OUTEPINT5_S)
#define USB_OUTEPINT5_V  0x00000001
#define USB_OUTEPINT5_S  21
/** USB_OUTEPINT6 : RO; bitpos: [22]; default: 0;
 *  OUT Endpoint 6 Interrupt Bit.
 */
#define USB_OUTEPINT6    (BIT(22))
#define USB_OUTEPINT6_M  (USB_OUTEPINT6_V << USB_OUTEPINT6_S)
#define USB_OUTEPINT6_V  0x00000001
#define USB_OUTEPINT6_S  22


/** USB_DAINTMSK_REG register
 *  Device All Endpoints Interrupt Mask Register
 */
#define USB_DAINTMSK_REG (SOC_DPORT_USB_BASE + 0x81c)
/** USB_INEPMSK0 : R/W; bitpos: [0]; default: 0;
 *  IN Endpoint 0 Interrupt mask Bit.
 */
#define USB_INEPMSK0    (BIT(0))
#define USB_INEPMSK0_M  (USB_INEPMSK0_V << USB_INEPMSK0_S)
#define USB_INEPMSK0_V  0x00000001
#define USB_INEPMSK0_S  0
/** USB_INEPMSK1 : R/W; bitpos: [1]; default: 0;
 *  IN Endpoint 1 Interrupt mask Bit.
 */
#define USB_INEPMSK1    (BIT(1))
#define USB_INEPMSK1_M  (USB_INEPMSK1_V << USB_INEPMSK1_S)
#define USB_INEPMSK1_V  0x00000001
#define USB_INEPMSK1_S  1
/** USB_INEPMSK2 : R/W; bitpos: [2]; default: 0;
 *  IN Endpoint 2 Interrupt mask Bit.
 */
#define USB_INEPMSK2    (BIT(2))
#define USB_INEPMSK2_M  (USB_INEPMSK2_V << USB_INEPMSK2_S)
#define USB_INEPMSK2_V  0x00000001
#define USB_INEPMSK2_S  2
/** USB_INEPMSK3 : R/W; bitpos: [3]; default: 0;
 *  IN Endpoint 3 Interrupt mask Bit.
 */
#define USB_INEPMSK3    (BIT(3))
#define USB_INEPMSK3_M  (USB_INEPMSK3_V << USB_INEPMSK3_S)
#define USB_INEPMSK3_V  0x00000001
#define USB_INEPMSK3_S  3
/** USB_INEPMSK4 : R/W; bitpos: [4]; default: 0;
 *  IN Endpoint 4 Interrupt mask Bit.
 */
#define USB_INEPMSK4    (BIT(4))
#define USB_INEPMSK4_M  (USB_INEPMSK4_V << USB_INEPMSK4_S)
#define USB_INEPMSK4_V  0x00000001
#define USB_INEPMSK4_S  4
/** USB_INEPMSK5 : R/W; bitpos: [5]; default: 0;
 *  IN Endpoint 5 Interrupt mask Bit.
 */
#define USB_INEPMSK5    (BIT(5))
#define USB_INEPMSK5_M  (USB_INEPMSK5_V << USB_INEPMSK5_S)
#define USB_INEPMSK5_V  0x00000001
#define USB_INEPMSK5_S  5
/** USB_INEPMSK6 : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint 6 Interrupt mask Bit.
 */
#define USB_INEPMSK6    (BIT(6))
#define USB_INEPMSK6_M  (USB_INEPMSK6_V << USB_INEPMSK6_S)
#define USB_INEPMSK6_V  0x00000001
#define USB_INEPMSK6_S  6
/** USB_OUTEPMSK0 : R/W; bitpos: [16]; default: 0;
 *  OUT Endpoint 0 Interrupt mask Bit.
 */
#define USB_OUTEPMSK0    (BIT(16))
#define USB_OUTEPMSK0_M  (USB_OUTEPMSK0_V << USB_OUTEPMSK0_S)
#define USB_OUTEPMSK0_V  0x00000001
#define USB_OUTEPMSK0_S  16
/** USB_OUTEPMSK1 : R/W; bitpos: [17]; default: 0;
 *  OUT Endpoint 1 Interrupt mask Bit.
 */
#define USB_OUTEPMSK1    (BIT(17))
#define USB_OUTEPMSK1_M  (USB_OUTEPMSK1_V << USB_OUTEPMSK1_S)
#define USB_OUTEPMSK1_V  0x00000001
#define USB_OUTEPMSK1_S  17
/** USB_OUTEPMSK2 : R/W; bitpos: [18]; default: 0;
 *  OUT Endpoint 2 Interrupt mask Bit.
 */
#define USB_OUTEPMSK2    (BIT(18))
#define USB_OUTEPMSK2_M  (USB_OUTEPMSK2_V << USB_OUTEPMSK2_S)
#define USB_OUTEPMSK2_V  0x00000001
#define USB_OUTEPMSK2_S  18
/** USB_OUTEPMSK3 : R/W; bitpos: [19]; default: 0;
 *  OUT Endpoint 3 Interrupt mask Bit.
 */
#define USB_OUTEPMSK3    (BIT(19))
#define USB_OUTEPMSK3_M  (USB_OUTEPMSK3_V << USB_OUTEPMSK3_S)
#define USB_OUTEPMSK3_V  0x00000001
#define USB_OUTEPMSK3_S  19
/** USB_OUTEPMSK4 : R/W; bitpos: [20]; default: 0;
 *  OUT Endpoint 4 Interrupt mask Bit.
 */
#define USB_OUTEPMSK4    (BIT(20))
#define USB_OUTEPMSK4_M  (USB_OUTEPMSK4_V << USB_OUTEPMSK4_S)
#define USB_OUTEPMSK4_V  0x00000001
#define USB_OUTEPMSK4_S  20
/** USB_OUTEPMSK5 : R/W; bitpos: [21]; default: 0;
 *  OUT Endpoint 5 Interrupt mask Bit.
 */
#define USB_OUTEPMSK5    (BIT(21))
#define USB_OUTEPMSK5_M  (USB_OUTEPMSK5_V << USB_OUTEPMSK5_S)
#define USB_OUTEPMSK5_V  0x00000001
#define USB_OUTEPMSK5_S  21
/** USB_OUTEPMSK6 : R/W; bitpos: [22]; default: 0;
 *  OUT Endpoint 6 Interrupt mask Bit.
 */
#define USB_OUTEPMSK6    (BIT(22))
#define USB_OUTEPMSK6_M  (USB_OUTEPMSK6_V << USB_OUTEPMSK6_S)
#define USB_OUTEPMSK6_V  0x00000001
#define USB_OUTEPMSK6_S  22


/** USB_DIEPEMPMSK_REG register
 *  Device IN Endpoint FIFO Empty Interrupt Mask Register
 */
#define USB_DIEPEMPMSK_REG (SOC_DPORT_USB_BASE + 0x834)
/** USB_D_INEPTXFEMPMSK : R/W; bitpos: [16:0]; default: 0;
 *  IN EP Tx FIFO Empty Interrupt Mask Bits
 *  0x1 (EP0_MASK): Mask IN EP0 Tx FIFO Empty Interrupt
 *  0x2 (EP1_MASK): Mask IN EP1 Tx FIFO Empty Interrupt
 *  0x4 (EP2_MASK): Mask IN EP2 Tx FIFO Empty Interrupt
 *  0x8 (EP3_MASK): Mask IN EP3 Tx FIFO Empty Interrupt
 *  0x10 (EP4_MASK): Mask IN EP4 Tx FIFO Empty Interrupt
 *  0x20 (EP5_MASK): Mask IN EP5 Tx FIFO Empty Interrupt
 *  0x40 (EP6_MASK): Mask IN EP6 Tx FIFO Empty Interrupt
 *  0x80 (EP7_MASK): Mask IN EP7 Tx FIFO Empty Interrupt
 *  0x100 (EP8_MASK): Mask IN EP8 Tx FIFO Empty Interrupt
 *  0x200 (EP9_MASK): Mask IN EP9 Tx FIFO Empty Interrupt
 *  0x400 (EP10_MASK): Mask IN EP10 Tx FIFO Empty Interrupt
 *  0x800 (EP11_MASK): Mask IN EP11 Tx FIFO Empty Interrupt
 *  0x1000 (EP12_MASK): Mask IN EP12 Tx FIFO Empty Interrupt
 *  0x2000 (EP13_MASK): Mask IN EP13 Tx FIFO Empty Interrupt
 *  0x4000 (EP14_MASK): Mask IN EP14 Tx FIFO Empty Interrupt
 *  0x8000 (EP15_MASK): Mask IN EP15 Tx FIFO Empty Interrupt
 */
#define USB_D_INEPTXFEMPMSK    0x0000FFFF
#define USB_D_INEPTXFEMPMSK_M  (USB_D_INEPTXFEMPMSK_V << USB_D_INEPTXFEMPMSK_S)
#define USB_D_INEPTXFEMPMSK_V  0x0000FFFF
#define USB_D_INEPTXFEMPMSK_S  0


