espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_DIEPINT4_REG register
 *  Device IN Endpoint 4 Interrupt Register
 */
#define USB_DIEPINT4_REG (SOC_DPORT_USB_BASE + 0x988)
/** USB_D_XFERCOMPL4 : R/W1C; bitpos: [0]; default: 0;
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Completed Interrupt
 */
#define USB_D_XFERCOMPL4    (BIT(0))
#define USB_D_XFERCOMPL4_M  (USB_D_XFERCOMPL4_V << USB_D_XFERCOMPL4_S)
#define USB_D_XFERCOMPL4_V  0x00000001
#define USB_D_XFERCOMPL4_S  0
/** USB_D_EPDISBLD4 : R/W1C; bitpos: [1]; default: 0;
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_D_EPDISBLD4    (BIT(1))
#define USB_D_EPDISBLD4_M  (USB_D_EPDISBLD4_V << USB_D_EPDISBLD4_S)
#define USB_D_EPDISBLD4_V  0x00000001
#define USB_D_EPDISBLD4_S  1
/** USB_D_AHBERR4 : R/W1C; bitpos: [2]; default: 0;
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_D_AHBERR4    (BIT(2))
#define USB_D_AHBERR4_M  (USB_D_AHBERR4_V << USB_D_AHBERR4_S)
#define USB_D_AHBERR4_V  0x00000001
#define USB_D_AHBERR4_S  2
/** USB_D_TIMEOUT4 : R/W1C; bitpos: [3]; default: 0;
 *  0x0 : No Timeout interrupt
 *  0x1 : Timeout interrupt
 */
#define USB_D_TIMEOUT4    (BIT(3))
#define USB_D_TIMEOUT4_M  (USB_D_TIMEOUT4_V << USB_D_TIMEOUT4_S)
#define USB_D_TIMEOUT4_V  0x00000001
#define USB_D_TIMEOUT4_S  3
/** USB_D_INTKNTXFEMP4 : R/W1C; bitpos: [4]; default: 0;
 *  0x0 : No IN Token Received when TxFIFO Empty Interrupt
 *  0x1 : IN Token Received when TxFIFO Empty Interrupt
 */
#define USB_D_INTKNTXFEMP4    (BIT(4))
#define USB_D_INTKNTXFEMP4_M  (USB_D_INTKNTXFEMP4_V << USB_D_INTKNTXFEMP4_S)
#define USB_D_INTKNTXFEMP4_V  0x00000001
#define USB_D_INTKNTXFEMP4_S  4
/** USB_D_INTKNEPMIS4 : R/W1C; bitpos: [5]; default: 0;
 *  0x0 : No IN Token Received with EP Mismatch Interrupt
 *  0x1 : IN Token Received with EP Mismatch interrupt
 */
#define USB_D_INTKNEPMIS4    (BIT(5))
#define USB_D_INTKNEPMIS4_M  (USB_D_INTKNEPMIS4_V << USB_D_INTKNEPMIS4_S)
#define USB_D_INTKNEPMIS4_V  0x00000001
#define USB_D_INTKNEPMIS4_S  5
/** USB_D_INEPNAKEFF4 : R/W1C; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective
 *  0x0 : No IN Endpoint NAK Effective interrupt
 *  0x1 : IN Endpoint NAK Effective interrupt
 */
#define USB_D_INEPNAKEFF4    (BIT(6))
#define USB_D_INEPNAKEFF4_M  (USB_D_INEPNAKEFF4_V << USB_D_INEPNAKEFF4_S)
#define USB_D_INEPNAKEFF4_V  0x00000001
#define USB_D_INEPNAKEFF4_S  6
/** USB_D_TXFEMP4 : RO; bitpos: [7]; default: 0;
 *  This interrupt is asserted when the TxFIFO for this endpoint is either half or
 *  completely empty
 *  0x0 : No Transmit FIFO Empty interrupt
 *  0x1 : Transmit FIFO Empty interrupt
 */
#define USB_D_TXFEMP4    (BIT(7))
#define USB_D_TXFEMP4_M  (USB_D_TXFEMP4_V << USB_D_TXFEMP4_S)
#define USB_D_TXFEMP4_V  0x00000001
#define USB_D_TXFEMP4_S  7
/** USB_D_TXFIFOUNDRN4 : R/W1C; bitpos: [8]; default: 0;
 *  The core generates this interrupt when it detects a transmit FIFO underrun
 *  condition in threshold mode for this endpoint
 *  0x0 : No Fifo Underrun interrupt
 *  0x1 : Fifo Underrun interrupt
 */
#define USB_D_TXFIFOUNDRN4    (BIT(8))
#define USB_D_TXFIFOUNDRN4_M  (USB_D_TXFIFOUNDRN4_V << USB_D_TXFIFOUNDRN4_S)
#define USB_D_TXFIFOUNDRN4_V  0x00000001
#define USB_D_TXFIFOUNDRN4_S  8
/** USB_D_BNAINTR4 : R/W1C; bitpos: [9]; default: 0;
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core generates
 *  this interrupt when the descriptor accessed is not ready for the Core to process,
 *  such as Host busy or DMA done
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_D_BNAINTR4    (BIT(9))
#define USB_D_BNAINTR4_M  (USB_D_BNAINTR4_V << USB_D_BNAINTR4_S)
#define USB_D_BNAINTR4_V  0x00000001
#define USB_D_BNAINTR4_S  9
/** USB_D_PKTDRPSTS4 : R/W1C; bitpos: [11]; default: 0;
 *  Packet Drop Status. This bit indicates to the application that an ISOC OUT packet
 *  has been dropped. This bit does not have an associated mask bit and does not
 *  generate an interrupt
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status
 */
#define USB_D_PKTDRPSTS4    (BIT(11))
#define USB_D_PKTDRPSTS4_M  (USB_D_PKTDRPSTS4_V << USB_D_PKTDRPSTS4_S)
#define USB_D_PKTDRPSTS4_V  0x00000001
#define USB_D_PKTDRPSTS4_S  11
/** USB_D_BBLEERR4 : R/W1C; bitpos: [12]; default: 0;
 *  The core generates this interrupt when babble is received for the endpoint
 *  0x0 : No interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_D_BBLEERR4    (BIT(12))
#define USB_D_BBLEERR4_M  (USB_D_BBLEERR4_V << USB_D_BBLEERR4_S)
#define USB_D_BBLEERR4_V  0x00000001
#define USB_D_BBLEERR4_S  12
/** USB_D_NAKINTRPT4 : R/W1C; bitpos: [13]; default: 0;
 *  NAK Interrupt. The core generates this interrupt when a NAK is transmitted or
 *  received by the device
 *  0x0 : No interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_D_NAKINTRPT4    (BIT(13))
#define USB_D_NAKINTRPT4_M  (USB_D_NAKINTRPT4_V << USB_D_NAKINTRPT4_S)
#define USB_D_NAKINTRPT4_V  0x00000001
#define USB_D_NAKINTRPT4_S  13
/** USB_D_NYETINTRPT4 : R/W1C; bitpos: [14]; default: 0;
 *  NYET Interrupt. The core generates this interrupt when a NYET response is
 *  transmitted for a non isochronous OUT endpoint
 *  0x0 : No interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_D_NYETINTRPT4    (BIT(14))
#define USB_D_NYETINTRPT4_M  (USB_D_NYETINTRPT4_V << USB_D_NYETINTRPT4_S)
#define USB_D_NYETINTRPT4_V  0x00000001
#define USB_D_NYETINTRPT4_S  14


/** USB_DIEPINT5_REG register
 *  Device IN Endpoint 5 Interrupt Register
 */
#define USB_DIEPINT5_REG (SOC_DPORT_USB_BASE + 0x9a8)
/** USB_D_XFERCOMPL5 : R/W1C; bitpos: [0]; default: 0;
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Completed Interrupt
 */
#define USB_D_XFERCOMPL5    (BIT(0))
#define USB_D_XFERCOMPL5_M  (USB_D_XFERCOMPL5_V << USB_D_XFERCOMPL5_S)
#define USB_D_XFERCOMPL5_V  0x00000001
#define USB_D_XFERCOMPL5_S  0
/** USB_D_EPDISBLD5 : R/W1C; bitpos: [1]; default: 0;
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_D_EPDISBLD5    (BIT(1))
#define USB_D_EPDISBLD5_M  (USB_D_EPDISBLD5_V << USB_D_EPDISBLD5_S)
#define USB_D_EPDISBLD5_V  0x00000001
#define USB_D_EPDISBLD5_S  1
/** USB_D_AHBERR5 : R/W1C; bitpos: [2]; default: 0;
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_D_AHBERR5    (BIT(2))
#define USB_D_AHBERR5_M  (USB_D_AHBERR5_V << USB_D_AHBERR5_S)
#define USB_D_AHBERR5_V  0x00000001
#define USB_D_AHBERR5_S  2
/** USB_D_TIMEOUT5 : R/W1C; bitpos: [3]; default: 0;
 *  0x0 : No Timeout interrupt
 *  0x1 : Timeout interrupt
 */
#define USB_D_TIMEOUT5    (BIT(3))
#define USB_D_TIMEOUT5_M  (USB_D_TIMEOUT5_V << USB_D_TIMEOUT5_S)
#define USB_D_TIMEOUT5_V  0x00000001
#define USB_D_TIMEOUT5_S  3
/** USB_D_INTKNTXFEMP5 : R/W1C; bitpos: [4]; default: 0;
 *  0x0 : No IN Token Received when TxFIFO Empty Interrupt
 *  0x1 : IN Token Received when TxFIFO Empty Interrupt
 */
#define USB_D_INTKNTXFEMP5    (BIT(4))
#define USB_D_INTKNTXFEMP5_M  (USB_D_INTKNTXFEMP5_V << USB_D_INTKNTXFEMP5_S)
#define USB_D_INTKNTXFEMP5_V  0x00000001
#define USB_D_INTKNTXFEMP5_S  4
/** USB_D_INTKNEPMIS5 : R/W1C; bitpos: [5]; default: 0;
 *  0x0 : No IN Token Received with EP Mismatch Interrupt
 *  0x1 : IN Token Received with EP Mismatch interrupt
 */
#define USB_D_INTKNEPMIS5    (BIT(5))
#define USB_D_INTKNEPMIS5_M  (USB_D_INTKNEPMIS5_V << USB_D_INTKNEPMIS5_S)
#define USB_D_INTKNEPMIS5_V  0x00000001
#define USB_D_INTKNEPMIS5_S  5
/** USB_D_INEPNAKEFF5 : R/W1C; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective
 *  0x0 : No IN Endpoint NAK Effective interrupt
 *  0x1 : IN Endpoint NAK Effective interrupt
 */
#define USB_D_INEPNAKEFF5    (BIT(6))
#define USB_D_INEPNAKEFF5_M  (USB_D_INEPNAKEFF5_V << USB_D_INEPNAKEFF5_S)
#define USB_D_INEPNAKEFF5_V  0x00000001
#define USB_D_INEPNAKEFF5_S  6
/** USB_D_TXFEMP5 : RO; bitpos: [7]; default: 0;
 *  This interrupt is asserted when the TxFIFO for this endpoint is either half or
 *  completely empty
 *  0x0 : No Transmit FIFO Empty interrupt
 *  0x1 : Transmit FIFO Empty interrupt
 */
#define USB_D_TXFEMP5    (BIT(7))
#define USB_D_TXFEMP5_M  (USB_D_TXFEMP5_V << USB_D_TXFEMP5_S)
#define USB_D_TXFEMP5_V  0x00000001
#define USB_D_TXFEMP5_S  7
/** USB_D_TXFIFOUNDRN5 : R/W1C; bitpos: [8]; default: 0;
 *  The core generates this interrupt when it detects a transmit FIFO underrun
 *  condition in threshold mode for this endpoint
 *  0x0 : No Fifo Underrun interrupt
 *  0x1 : Fifo Underrun interrupt
 */
#define USB_D_TXFIFOUNDRN5    (BIT(8))
#define USB_D_TXFIFOUNDRN5_M  (USB_D_TXFIFOUNDRN5_V << USB_D_TXFIFOUNDRN5_S)
#define USB_D_TXFIFOUNDRN5_V  0x00000001
#define USB_D_TXFIFOUNDRN5_S  8
/** USB_D_BNAINTR5 : R/W1C; bitpos: [9]; default: 0;
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core generates
 *  this interrupt when the descriptor accessed is not ready for the Core to process,
 *  such as Host busy or DMA done
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_D_BNAINTR5    (BIT(9))
#define USB_D_BNAINTR5_M  (USB_D_BNAINTR5_V << USB_D_BNAINTR5_S)
#define USB_D_BNAINTR5_V  0x00000001
#define USB_D_BNAINTR5_S  9
/** USB_D_PKTDRPSTS5 : R/W1C; bitpos: [11]; default: 0;
 *  Packet Drop Status. This bit indicates to the application that an ISOC OUT packet
 *  has been dropped. This bit does not have an associated mask bit and does not
 *  generate an interrupt
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status
 */
#define USB_D_PKTDRPSTS5    (BIT(11))
#define USB_D_PKTDRPSTS5_M  (USB_D_PKTDRPSTS5_V << USB_D_PKTDRPSTS5_S)
#define USB_D_PKTDRPSTS5_V  0x00000001
#define USB_D_PKTDRPSTS5_S  11
/** USB_D_BBLEERR5 : R/W1C; bitpos: [12]; default: 0;
 *  The core generates this interrupt when babble is received for the endpoint
 *  0x0 : No interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_D_BBLEERR5    (BIT(12))
#define USB_D_BBLEERR5_M  (USB_D_BBLEERR5_V << USB_D_BBLEERR5_S)
#define USB_D_BBLEERR5_V  0x00000001
#define USB_D_BBLEERR5_S  12
/** USB_D_NAKINTRPT5 : R/W1C; bitpos: [13]; default: 0;
 *  NAK Interrupt. The core generates this interrupt when a NAK is transmitted or
 *  received by the device
 *  0x0 : No interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_D_NAKINTRPT5    (BIT(13))
#define USB_D_NAKINTRPT5_M  (USB_D_NAKINTRPT5_V << USB_D_NAKINTRPT5_S)
#define USB_D_NAKINTRPT5_V  0x00000001
#define USB_D_NAKINTRPT5_S  13
/** USB_D_NYETINTRPT5 : R/W1C; bitpos: [14]; default: 0;
 *  NYET Interrupt. The core generates this interrupt when a NYET response is
 *  transmitted for a non isochronous OUT endpoint
 *  0x0 : No interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_D_NYETINTRPT5    (BIT(14))
#define USB_D_NYETINTRPT5_M  (USB_D_NYETINTRPT5_V << USB_D_NYETINTRPT5_S)
#define USB_D_NYETINTRPT5_V  0x00000001
#define USB_D_NYETINTRPT5_S  14


/** USB_DIEPINT6_REG register
 *  Device IN Endpoint 6 Interrupt Register
 */
#define USB_DIEPINT6_REG (SOC_DPORT_USB_BASE + 0x9c8)
/** USB_D_XFERCOMPL6 : R/W1C; bitpos: [0]; default: 0;
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Completed Interrupt
 */
#define USB_D_XFERCOMPL6    (BIT(0))
#define USB_D_XFERCOMPL6_M  (USB_D_XFERCOMPL6_V << USB_D_XFERCOMPL6_S)
#define USB_D_XFERCOMPL6_V  0x00000001
#define USB_D_XFERCOMPL6_S  0
/** USB_D_EPDISBLD6 : R/W1C; bitpos: [1]; default: 0;
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_D_EPDISBLD6    (BIT(1))
#define USB_D_EPDISBLD6_M  (USB_D_EPDISBLD6_V << USB_D_EPDISBLD6_S)
#define USB_D_EPDISBLD6_V  0x00000001
#define USB_D_EPDISBLD6_S  1
/** USB_D_AHBERR6 : R/W1C; bitpos: [2]; default: 0;
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_D_AHBERR6    (BIT(2))
#define USB_D_AHBERR6_M  (USB_D_AHBERR6_V << USB_D_AHBERR6_S)
#define USB_D_AHBERR6_V  0x00000001
#define USB_D_AHBERR6_S  2
/** USB_D_TIMEOUT6 : R/W1C; bitpos: [3]; default: 0;
 *  0x0 : No Timeout interrupt
 *  0x1 : Timeout interrupt
 */
#define USB_D_TIMEOUT6    (BIT(3))
#define USB_D_TIMEOUT6_M  (USB_D_TIMEOUT6_V << USB_D_TIMEOUT6_S)
#define USB_D_TIMEOUT6_V  0x00000001
#define USB_D_TIMEOUT6_S  3
/** USB_D_INTKNTXFEMP6 : R/W1C; bitpos: [4]; default: 0;
 *  0x0 : No IN Token Received when TxFIFO Empty Interrupt
 *  0x1 : IN Token Received when TxFIFO Empty Interrupt
 */
#define USB_D_INTKNTXFEMP6    (BIT(4))
#define USB_D_INTKNTXFEMP6_M  (USB_D_INTKNTXFEMP6_V << USB_D_INTKNTXFEMP6_S)
#define USB_D_INTKNTXFEMP6_V  0x00000001
#define USB_D_INTKNTXFEMP6_S  4
/** USB_D_INTKNEPMIS6 : R/W1C; bitpos: [5]; default: 0;
 *  0x0 : No IN Token Received with EP Mismatch Interrupt
 *  0x1 : IN Token Received with EP Mismatch interrupt
 */
#define USB_D_INTKNEPMIS6    (BIT(5))
#define USB_D_INTKNEPMIS6_M  (USB_D_INTKNEPMIS6_V << USB_D_INTKNEPMIS6_S)
#define USB_D_INTKNEPMIS6_V  0x00000001
#define USB_D_INTKNEPMIS6_S  5
/** USB_D_INEPNAKEFF6 : R/W1C; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective
 *  0x0 : No IN Endpoint NAK Effective interrupt
 *  0x1 : IN Endpoint NAK Effective interrupt
 */
#define USB_D_INEPNAKEFF6    (BIT(6))
#define USB_D_INEPNAKEFF6_M  (USB_D_INEPNAKEFF6_V << USB_D_INEPNAKEFF6_S)
#define USB_D_INEPNAKEFF6_V  0x00000001
#define USB_D_INEPNAKEFF6_S  6
/** USB_D_TXFEMP6 : RO; bitpos: [7]; default: 0;
 *  This interrupt is asserted when the TxFIFO for this endpoint is either half or
 *  completely empty
 *  0x0 : No Transmit FIFO Empty interrupt
 *  0x1 : Transmit FIFO Empty interrupt
 */
#define USB_D_TXFEMP6    (BIT(7))
#define USB_D_TXFEMP6_M  (USB_D_TXFEMP6_V << USB_D_TXFEMP6_S)
#define USB_D_TXFEMP6_V  0x00000001
#define USB_D_TXFEMP6_S  7
/** USB_D_TXFIFOUNDRN6 : R/W1C; bitpos: [8]; default: 0;
 *  The core generates this interrupt when it detects a transmit FIFO underrun
 *  condition in threshold mode for this endpoint
 *  0x0 : No Fifo Underrun interrupt
 *  0x1 : Fifo Underrun interrupt
 */
#define USB_D_TXFIFOUNDRN6    (BIT(8))
#define USB_D_TXFIFOUNDRN6_M  (USB_D_TXFIFOUNDRN6_V << USB_D_TXFIFOUNDRN6_S)
#define USB_D_TXFIFOUNDRN6_V  0x00000001
#define USB_D_TXFIFOUNDRN6_S  8
/** USB_D_BNAINTR6 : R/W1C; bitpos: [9]; default: 0;
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core generates
 *  this interrupt when the descriptor accessed is not ready for the Core to process,
 *  such as Host busy or DMA done
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_D_BNAINTR6    (BIT(9))
#define USB_D_BNAINTR6_M  (USB_D_BNAINTR6_V << USB_D_BNAINTR6_S)
#define USB_D_BNAINTR6_V  0x00000001
#define USB_D_BNAINTR6_S  9
/** USB_D_PKTDRPSTS6 : R/W1C; bitpos: [11]; default: 0;
 *  Packet Drop Status. This bit indicates to the application that an ISOC OUT packet
 *  has been dropped. This bit does not have an associated mask bit and does not
 *  generate an interrupt
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status
 */
#define USB_D_PKTDRPSTS6    (BIT(11))
#define USB_D_PKTDRPSTS6_M  (USB_D_PKTDRPSTS6_V << USB_D_PKTDRPSTS6_S)
#define USB_D_PKTDRPSTS6_V  0x00000001
#define USB_D_PKTDRPSTS6_S  11
/** USB_D_BBLEERR6 : R/W1C; bitpos: [12]; default: 0;
 *  The core generates this interrupt when babble is received for the endpoint
 *  0x0 : No interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_D_BBLEERR6    (BIT(12))
#define USB_D_BBLEERR6_M  (USB_D_BBLEERR6_V << USB_D_BBLEERR6_S)
#define USB_D_BBLEERR6_V  0x00000001
#define USB_D_BBLEERR6_S  12
/** USB_D_NAKINTRPT6 : R/W1C; bitpos: [13]; default: 0;
 *  NAK Interrupt. The core generates this interrupt when a NAK is transmitted or
 *  received by the device
 *  0x0 : No interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_D_NAKINTRPT6    (BIT(13))
#define USB_D_NAKINTRPT6_M  (USB_D_NAKINTRPT6_V << USB_D_NAKINTRPT6_S)
#define USB_D_NAKINTRPT6_V  0x00000001
#define USB_D_NAKINTRPT6_S  13
/** USB_D_NYETINTRPT6 : R/W1C; bitpos: [14]; default: 0;
 *  NYET Interrupt. The core generates this interrupt when a NYET response is
 *  transmitted for a non isochronous OUT endpoint
 *  0x0 : No interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_D_NYETINTRPT6    (BIT(14))
#define USB_D_NYETINTRPT6_M  (USB_D_NYETINTRPT6_V << USB_D_NYETINTRPT6_S)
#define USB_D_NYETINTRPT6_V  0x00000001
#define USB_D_NYETINTRPT6_S  14


/** USB_DOEPINT0_REG register
 *  Device OUT Endpoint 0 Interrupt Register
 */
#define USB_DOEPINT0_REG (SOC_DPORT_USB_BASE + 0xb08)
/** USB_XFERCOMPL0 : R/W1C; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Complete Interrupt
 */
#define USB_XFERCOMPL0    (BIT(0))
#define USB_XFERCOMPL0_M  (USB_XFERCOMPL0_V << USB_XFERCOMPL0_S)
#define USB_XFERCOMPL0_V  0x00000001
#define USB_XFERCOMPL0_S  0
/** USB_EPDISBLD0 : R/W1C; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_EPDISBLD0    (BIT(1))
#define USB_EPDISBLD0_M  (USB_EPDISBLD0_V << USB_EPDISBLD0_S)
#define USB_EPDISBLD0_V  0x00000001
#define USB_EPDISBLD0_S  1
/** USB_AHBERR0 : R/W1C; bitpos: [2]; default: 0;
 *  AHB Error
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_AHBERR0    (BIT(2))
#define USB_AHBERR0_M  (USB_AHBERR0_V << USB_AHBERR0_S)
#define USB_AHBERR0_V  0x00000001
#define USB_AHBERR0_S  2
/** USB_SETUP0 : R/W1C; bitpos: [3]; default: 0;
 *  SETUP Phase Done
 *  0x0 : No SETUP Phase Done
 *  0x1 : SETUP Phase Done
 */
#define USB_SETUP0    (BIT(3))
#define USB_SETUP0_M  (USB_SETUP0_V << USB_SETUP0_S)
#define USB_SETUP0_V  0x00000001
#define USB_SETUP0_S  3
/** USB_OUTTKNEPDIS0 : R/W1C; bitpos: [4]; default: 0;
 *  OUT Token Received When Endpoint Disabled
 *  0x0 : No OUT Token Received When Endpoint Disabled
 *  0x1 : OUT Token Received When Endpoint Disabled
 */
#define USB_OUTTKNEPDIS0    (BIT(4))
#define USB_OUTTKNEPDIS0_M  (USB_OUTTKNEPDIS0_V << USB_OUTTKNEPDIS0_S)
#define USB_OUTTKNEPDIS0_V  0x00000001
#define USB_OUTTKNEPDIS0_S  4
/** USB_STSPHSERCVD0 : R/W1C; bitpos: [5]; default: 0;
 *  Status Phase Received for Control Write
 *  0x0 : No Status Phase Received for Control Write
 *  0x1 : Status Phase Received for Control Write
 */
#define USB_STSPHSERCVD0    (BIT(5))
#define USB_STSPHSERCVD0_M  (USB_STSPHSERCVD0_V << USB_STSPHSERCVD0_S)
#define USB_STSPHSERCVD0_V  0x00000001
#define USB_STSPHSERCVD0_S  5
/** USB_BACK2BACKSETUP0 : R/W1C; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received
 *  0x0 : No Back-to-Back SETUP Packets Received
 *  0x1 : Back-to-Back SETUP Packets Received
 */
#define USB_BACK2BACKSETUP0    (BIT(6))
#define USB_BACK2BACKSETUP0_M  (USB_BACK2BACKSETUP0_V << USB_BACK2BACKSETUP0_S)
#define USB_BACK2BACKSETUP0_V  0x00000001
#define USB_BACK2BACKSETUP0_S  6
/** USB_OUTPKTERR0 : R/W1C; bitpos: [8]; default: 0;
 *  OUT Packet Error
 *  0x0 : No OUT Packet Error
 *  0x1 : OUT Packet Error
 */
#define USB_OUTPKTERR0    (BIT(8))
#define USB_OUTPKTERR0_M  (USB_OUTPKTERR0_V << USB_OUTPKTERR0_S)
#define USB_OUTPKTERR0_V  0x00000001
#define USB_OUTPKTERR0_S  8
/** USB_BNAINTR0 : R/W1C; bitpos: [9]; default: 0;
 *  Buffer Not Available Interrupt
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_BNAINTR0    (BIT(9))
#define USB_BNAINTR0_M  (USB_BNAINTR0_V << USB_BNAINTR0_S)
#define USB_BNAINTR0_V  0x00000001
#define USB_BNAINTR0_S  9
/** USB_PKTDRPSTS0 : R/W1C; bitpos: [11]; default: 0;
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status interrupt
 */
#define USB_PKTDRPSTS0    (BIT(11))
#define USB_PKTDRPSTS0_M  (USB_PKTDRPSTS0_V << USB_PKTDRPSTS0_S)
#define USB_PKTDRPSTS0_V  0x00000001
#define USB_PKTDRPSTS0_S  11
/** USB_BBLEERR0 : R/W1C; bitpos: [12]; default: 0;
 *  0x0 : No BbleErr interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_BBLEERR0    (BIT(12))
#define USB_BBLEERR0_M  (USB_BBLEERR0_V << USB_BBLEERR0_S)
#define USB_BBLEERR0_V  0x00000001
#define USB_BBLEERR0_S  12
/** USB_NAKINTRPT0 : R/W1C; bitpos: [13]; default: 0;
 *  0x0 : No NAK interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_NAKINTRPT0    (BIT(13))
#define USB_NAKINTRPT0_M  (USB_NAKINTRPT0_V << USB_NAKINTRPT0_S)
#define USB_NAKINTRPT0_V  0x00000001
#define USB_NAKINTRPT0_S  13
/** USB_NYEPINTRPT0 : R/W1C; bitpos: [14]; default: 0;
 *  0x0 : No NYET interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_NYEPINTRPT0    (BIT(14))
#define USB_NYEPINTRPT0_M  (USB_NYEPINTRPT0_V << USB_NYEPINTRPT0_S)
#define USB_NYEPINTRPT0_V  0x00000001
#define USB_NYEPINTRPT0_S  14
/** USB_STUPPKTRCVD0 : R/W1C; bitpos: [15]; default: 0;
 *  0x0 : No Setup packet received
 *  0x1 : Setup packet received
 */
#define USB_STUPPKTRCVD0    (BIT(15))
#define USB_STUPPKTRCVD0_M  (USB_STUPPKTRCVD0_V << USB_STUPPKTRCVD0_S)
#define USB_STUPPKTRCVD0_V  0x00000001
#define USB_STUPPKTRCVD0_S  15


