espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_DOEPINT5_REG register
 *  Device OUT Endpoint 5 Interrupt Register
 */
#define USB_DOEPINT5_REG (SOC_DPORT_USB_BASE + 0xba8)
/** USB_XFERCOMPL5 : R/W1C; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Complete Interrupt
 */
#define USB_XFERCOMPL5    (BIT(0))
#define USB_XFERCOMPL5_M  (USB_XFERCOMPL5_V << USB_XFERCOMPL5_S)
#define USB_XFERCOMPL5_V  0x00000001
#define USB_XFERCOMPL5_S  0
/** USB_EPDISBLD5 : R/W1C; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_EPDISBLD5    (BIT(1))
#define USB_EPDISBLD5_M  (USB_EPDISBLD5_V << USB_EPDISBLD5_S)
#define USB_EPDISBLD5_V  0x00000001
#define USB_EPDISBLD5_S  1
/** USB_AHBERR5 : R/W1C; bitpos: [2]; default: 0;
 *  AHB Error
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_AHBERR5    (BIT(2))
#define USB_AHBERR5_M  (USB_AHBERR5_V << USB_AHBERR5_S)
#define USB_AHBERR5_V  0x00000001
#define USB_AHBERR5_S  2
/** USB_SETUP5 : R/W1C; bitpos: [3]; default: 0;
 *  SETUP Phase Done
 *  0x0 : No SETUP Phase Done
 *  0x1 : SETUP Phase Done
 */
#define USB_SETUP5    (BIT(3))
#define USB_SETUP5_M  (USB_SETUP5_V << USB_SETUP5_S)
#define USB_SETUP5_V  0x00000001
#define USB_SETUP5_S  3
/** USB_OUTTKNEPDIS5 : R/W1C; bitpos: [4]; default: 0;
 *  OUT Token Received When Endpoint Disabled
 *  0x0 : No OUT Token Received When Endpoint Disabled
 *  0x1 : OUT Token Received When Endpoint Disabled
 */
#define USB_OUTTKNEPDIS5    (BIT(4))
#define USB_OUTTKNEPDIS5_M  (USB_OUTTKNEPDIS5_V << USB_OUTTKNEPDIS5_S)
#define USB_OUTTKNEPDIS5_V  0x00000001
#define USB_OUTTKNEPDIS5_S  4
/** USB_STSPHSERCVD5 : R/W1C; bitpos: [5]; default: 0;
 *  Status Phase Received for Control Write
 *  0x0 : No Status Phase Received for Control Write
 *  0x1 : Status Phase Received for Control Write
 */
#define USB_STSPHSERCVD5    (BIT(5))
#define USB_STSPHSERCVD5_M  (USB_STSPHSERCVD5_V << USB_STSPHSERCVD5_S)
#define USB_STSPHSERCVD5_V  0x00000001
#define USB_STSPHSERCVD5_S  5
/** USB_BACK2BACKSETUP5 : R/W1C; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received
 *  0x0 : No Back-to-Back SETUP Packets Received
 *  0x1 : Back-to-Back SETUP Packets Received
 */
#define USB_BACK2BACKSETUP5    (BIT(6))
#define USB_BACK2BACKSETUP5_M  (USB_BACK2BACKSETUP5_V << USB_BACK2BACKSETUP5_S)
#define USB_BACK2BACKSETUP5_V  0x00000001
#define USB_BACK2BACKSETUP5_S  6
/** USB_OUTPKTERR5 : R/W1C; bitpos: [8]; default: 0;
 *  OUT Packet Error
 *  0x0 : No OUT Packet Error
 *  0x1 : OUT Packet Error
 */
#define USB_OUTPKTERR5    (BIT(8))
#define USB_OUTPKTERR5_M  (USB_OUTPKTERR5_V << USB_OUTPKTERR5_S)
#define USB_OUTPKTERR5_V  0x00000001
#define USB_OUTPKTERR5_S  8
/** USB_BNAINTR5 : R/W1C; bitpos: [9]; default: 0;
 *  Buffer Not Available Interrupt
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_BNAINTR5    (BIT(9))
#define USB_BNAINTR5_M  (USB_BNAINTR5_V << USB_BNAINTR5_S)
#define USB_BNAINTR5_V  0x00000001
#define USB_BNAINTR5_S  9
/** USB_PKTDRPSTS5 : R/W1C; bitpos: [11]; default: 0;
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status interrupt
 */
#define USB_PKTDRPSTS5    (BIT(11))
#define USB_PKTDRPSTS5_M  (USB_PKTDRPSTS5_V << USB_PKTDRPSTS5_S)
#define USB_PKTDRPSTS5_V  0x00000001
#define USB_PKTDRPSTS5_S  11
/** USB_BBLEERR5 : R/W1C; bitpos: [12]; default: 0;
 *  0x0 : No BbleErr interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_BBLEERR5    (BIT(12))
#define USB_BBLEERR5_M  (USB_BBLEERR5_V << USB_BBLEERR5_S)
#define USB_BBLEERR5_V  0x00000001
#define USB_BBLEERR5_S  12
/** USB_NAKINTRPT5 : R/W1C; bitpos: [13]; default: 0;
 *  0x0 : No NAK interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_NAKINTRPT5    (BIT(13))
#define USB_NAKINTRPT5_M  (USB_NAKINTRPT5_V << USB_NAKINTRPT5_S)
#define USB_NAKINTRPT5_V  0x00000001
#define USB_NAKINTRPT5_S  13
/** USB_NYEPINTRPT5 : R/W1C; bitpos: [14]; default: 0;
 *  0x0 : No NYET interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_NYEPINTRPT5    (BIT(14))
#define USB_NYEPINTRPT5_M  (USB_NYEPINTRPT5_V << USB_NYEPINTRPT5_S)
#define USB_NYEPINTRPT5_V  0x00000001
#define USB_NYEPINTRPT5_S  14
/** USB_STUPPKTRCVD5 : R/W1C; bitpos: [15]; default: 0;
 *  0x0 : No Setup packet received
 *  0x1 : Setup packet received
 */
#define USB_STUPPKTRCVD5    (BIT(15))
#define USB_STUPPKTRCVD5_M  (USB_STUPPKTRCVD5_V << USB_STUPPKTRCVD5_S)
#define USB_STUPPKTRCVD5_V  0x00000001
#define USB_STUPPKTRCVD5_S  15


/** USB_DOEPINT6_REG register
 *  Device OUT Endpoint 6 Interrupt Register
 */
#define USB_DOEPINT6_REG (SOC_DPORT_USB_BASE + 0xbc8)
/** USB_XFERCOMPL6 : R/W1C; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt
 *  0x0 : No Transfer Complete Interrupt
 *  0x1 : Transfer Complete Interrupt
 */
#define USB_XFERCOMPL6    (BIT(0))
#define USB_XFERCOMPL6_M  (USB_XFERCOMPL6_V << USB_XFERCOMPL6_S)
#define USB_XFERCOMPL6_V  0x00000001
#define USB_XFERCOMPL6_S  0
/** USB_EPDISBLD6 : R/W1C; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt
 *  0x0 : No Endpoint Disabled Interrupt
 *  0x1 : Endpoint Disabled Interrupt
 */
#define USB_EPDISBLD6    (BIT(1))
#define USB_EPDISBLD6_M  (USB_EPDISBLD6_V << USB_EPDISBLD6_S)
#define USB_EPDISBLD6_V  0x00000001
#define USB_EPDISBLD6_S  1
/** USB_AHBERR6 : R/W1C; bitpos: [2]; default: 0;
 *  AHB Error
 *  0x0 : No AHB Error Interrupt
 *  0x1 : AHB Error interrupt
 */
#define USB_AHBERR6    (BIT(2))
#define USB_AHBERR6_M  (USB_AHBERR6_V << USB_AHBERR6_S)
#define USB_AHBERR6_V  0x00000001
#define USB_AHBERR6_S  2
/** USB_SETUP6 : R/W1C; bitpos: [3]; default: 0;
 *  SETUP Phase Done
 *  0x0 : No SETUP Phase Done
 *  0x1 : SETUP Phase Done
 */
#define USB_SETUP6    (BIT(3))
#define USB_SETUP6_M  (USB_SETUP6_V << USB_SETUP6_S)
#define USB_SETUP6_V  0x00000001
#define USB_SETUP6_S  3
/** USB_OUTTKNEPDIS6 : R/W1C; bitpos: [4]; default: 0;
 *  OUT Token Received When Endpoint Disabled
 *  0x0 : No OUT Token Received When Endpoint Disabled
 *  0x1 : OUT Token Received When Endpoint Disabled
 */
#define USB_OUTTKNEPDIS6    (BIT(4))
#define USB_OUTTKNEPDIS6_M  (USB_OUTTKNEPDIS6_V << USB_OUTTKNEPDIS6_S)
#define USB_OUTTKNEPDIS6_V  0x00000001
#define USB_OUTTKNEPDIS6_S  4
/** USB_STSPHSERCVD6 : R/W1C; bitpos: [5]; default: 0;
 *  Status Phase Received for Control Write
 *  0x0 : No Status Phase Received for Control Write
 *  0x1 : Status Phase Received for Control Write
 */
#define USB_STSPHSERCVD6    (BIT(5))
#define USB_STSPHSERCVD6_M  (USB_STSPHSERCVD6_V << USB_STSPHSERCVD6_S)
#define USB_STSPHSERCVD6_V  0x00000001
#define USB_STSPHSERCVD6_S  5
/** USB_BACK2BACKSETUP6 : R/W1C; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received
 *  0x0 : No Back-to-Back SETUP Packets Received
 *  0x1 : Back-to-Back SETUP Packets Received
 */
#define USB_BACK2BACKSETUP6    (BIT(6))
#define USB_BACK2BACKSETUP6_M  (USB_BACK2BACKSETUP6_V << USB_BACK2BACKSETUP6_S)
#define USB_BACK2BACKSETUP6_V  0x00000001
#define USB_BACK2BACKSETUP6_S  6
/** USB_OUTPKTERR6 : R/W1C; bitpos: [8]; default: 0;
 *  OUT Packet Error
 *  0x0 : No OUT Packet Error
 *  0x1 : OUT Packet Error
 */
#define USB_OUTPKTERR6    (BIT(8))
#define USB_OUTPKTERR6_M  (USB_OUTPKTERR6_V << USB_OUTPKTERR6_S)
#define USB_OUTPKTERR6_V  0x00000001
#define USB_OUTPKTERR6_S  8
/** USB_BNAINTR6 : R/W1C; bitpos: [9]; default: 0;
 *  Buffer Not Available Interrupt
 *  0x0 : No BNA interrupt
 *  0x1 : BNA interrupt
 */
#define USB_BNAINTR6    (BIT(9))
#define USB_BNAINTR6_M  (USB_BNAINTR6_V << USB_BNAINTR6_S)
#define USB_BNAINTR6_V  0x00000001
#define USB_BNAINTR6_S  9
/** USB_PKTDRPSTS6 : R/W1C; bitpos: [11]; default: 0;
 *  0x0 : No interrupt
 *  0x1 : Packet Drop Status interrupt
 */
#define USB_PKTDRPSTS6    (BIT(11))
#define USB_PKTDRPSTS6_M  (USB_PKTDRPSTS6_V << USB_PKTDRPSTS6_S)
#define USB_PKTDRPSTS6_V  0x00000001
#define USB_PKTDRPSTS6_S  11
/** USB_BBLEERR6 : R/W1C; bitpos: [12]; default: 0;
 *  0x0 : No BbleErr interrupt
 *  0x1 : BbleErr interrupt
 */
#define USB_BBLEERR6    (BIT(12))
#define USB_BBLEERR6_M  (USB_BBLEERR6_V << USB_BBLEERR6_S)
#define USB_BBLEERR6_V  0x00000001
#define USB_BBLEERR6_S  12
/** USB_NAKINTRPT6 : R/W1C; bitpos: [13]; default: 0;
 *  0x0 : No NAK interrupt
 *  0x1 : NAK Interrupt
 */
#define USB_NAKINTRPT6    (BIT(13))
#define USB_NAKINTRPT6_M  (USB_NAKINTRPT6_V << USB_NAKINTRPT6_S)
#define USB_NAKINTRPT6_V  0x00000001
#define USB_NAKINTRPT6_S  13
/** USB_NYEPINTRPT6 : R/W1C; bitpos: [14]; default: 0;
 *  0x0 : No NYET interrupt
 *  0x1 : NYET Interrupt
 */
#define USB_NYEPINTRPT6    (BIT(14))
#define USB_NYEPINTRPT6_M  (USB_NYEPINTRPT6_V << USB_NYEPINTRPT6_S)
#define USB_NYEPINTRPT6_V  0x00000001
#define USB_NYEPINTRPT6_S  14
/** USB_STUPPKTRCVD6 : R/W1C; bitpos: [15]; default: 0;
 *  0x0 : No Setup packet received
 *  0x1 : Setup packet received
 */
#define USB_STUPPKTRCVD6    (BIT(15))
#define USB_STUPPKTRCVD6_M  (USB_STUPPKTRCVD6_V << USB_STUPPKTRCVD6_S)
#define USB_STUPPKTRCVD6_V  0x00000001
#define USB_STUPPKTRCVD6_S  15




