espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** configuration registers */
/** USB_GAHBCFG_REG register
 *  AHB Configuration Register
 */
#define USB_GAHBCFG_REG (SOC_DPORT_USB_BASE + 0x8)
/** USB_GLBLLNTRMSK : R/W; bitpos: [0]; default: 0;
 *  1'b0: Mask the interrupt assertion to the application.
 *  1'b1: Unmask the interrupt assertion to the application
 */
#define USB_GLBLLNTRMSK    (BIT(0))
#define USB_GLBLLNTRMSK_M  (USB_GLBLLNTRMSK_V << USB_GLBLLNTRMSK_S)
#define USB_GLBLLNTRMSK_V  0x00000001
#define USB_GLBLLNTRMSK_S  0
/** USB_HBSTLEN : R/W; bitpos: [5:1]; default: 0;
 *  this field is used in Internal DMA modes
 *  4'b0000 Single
 *  4'b0001: INCR
 *  4'b0011 INCR4
 *  4'b0101 INCR8
 *  4'b0111 INCR16
 *  Others: Reserved
 */
#define USB_HBSTLEN    0x0000000F
#define USB_HBSTLEN_M  (USB_HBSTLEN_V << USB_HBSTLEN_S)
#define USB_HBSTLEN_V  0x0000000F
#define USB_HBSTLEN_S  1
/** USB_DMAEN : R/W; bitpos: [5]; default: 0;
 *  This bit is always 0 when Slave-Only mode has been selected
 *  1'b0:Core operates in Slave mode
 *  1'b1:Core operates in a DMA mode
 */
#define USB_DMAEN    (BIT(5))
#define USB_DMAEN_M  (USB_DMAEN_V << USB_DMAEN_S)
#define USB_DMAEN_V  0x00000001
#define USB_DMAEN_S  5
/** USB_NPTXFEMPLVL : R/W; bitpos: [7]; default: 0;
 *  Non-Periodic TxFIFO Empty Level
 *  1'b0: DIEPINTn_REG.REG_TXFEMP interrupt indicates that the Non-Periodic TxFIFO is
 *  half empty or that the IN Endpoint TxFIFO is half empty
 *  1'b1: GINTSTS_REG.USB_NPTXFEMP interrupt indicates that the Non-Periodic TxFIFO is
 *  completely empty or that the IN Endpoint TxFIFO is completely empty
 */
#define USB_NPTXFEMPLVL    (BIT(7))
#define USB_NPTXFEMPLVL_M  (USB_NPTXFEMPLVL_V << USB_NPTXFEMPLVL_S)
#define USB_NPTXFEMPLVL_V  0x00000001
#define USB_NPTXFEMPLVL_S  7
/** USB_PTXFEMPLVL : R/W; bitpos: [8]; default: 0;
 *  Indicates when the Periodic TxFIFO Empty Interrupt bit in the Core Interrupt
 *  register (GINTSTS_REG.USB_PTXFEMP) is triggered. This bit is used only in Slave
 *  mode
 *  1'b0: GINTSTS_REG.USB_PTXFEMP interrupt indicates that the Periodic TxFIFO is half
 *  empty
 *  1'b1: GINTSTS_REG.USB_PTXFEMP interrupt indicates that the Periodic TxFIFO is
 *  completely empty
 */
#define USB_PTXFEMPLVL    (BIT(8))
#define USB_PTXFEMPLVL_M  (USB_PTXFEMPLVL_V << USB_PTXFEMPLVL_S)
#define USB_PTXFEMPLVL_V  0x00000001
#define USB_PTXFEMPLVL_S  8
/** USB_REMMEMSUPP : R/W; bitpos: [21]; default: 0;
 *  Remote Memory Support (RemMemSupp) This bit is programmed to enable the
 *  functionality to wait for thesystem DMA Done Signal for the DMA Write Transfers
 *  1'b0:Remote Memory Support Feature disabled
 *  1'b1:Remote Memory Support Feature enabled
 */
#define USB_REMMEMSUPP    (BIT(21))
#define USB_REMMEMSUPP_M  (USB_REMMEMSUPP_V << USB_REMMEMSUPP_S)
#define USB_REMMEMSUPP_V  0x00000001
#define USB_REMMEMSUPP_S  21
/** USB_NOTIALLDMAWRIT : R/W; bitpos: [22]; default: 0;
 *  Notify All DMA Write Transactions (NotiAllDmaWrit) This bit is programmed to enable
 *  the System DMA Done functionality for all the DMA write Transactions corresponding
 *  to the Channel/Endpoint. This bit is valid only when GAHBCFG.RemMemSupp is set to 1
 */
#define USB_NOTIALLDMAWRIT    (BIT(22))
#define USB_NOTIALLDMAWRIT_M  (USB_NOTIALLDMAWRIT_V << USB_NOTIALLDMAWRIT_S)
#define USB_NOTIALLDMAWRIT_V  0x00000001
#define USB_NOTIALLDMAWRIT_S  22
/** USB_AHBSINGLE : R/W; bitpos: [23]; default: 0;
 *  AHB Single Support (AHBSingle) This bit when programmed supports Single transfers
 *  for the remaining data in a transfer when the core is operating in DMA mode
 *  1'b0: The remaining data in the transfer is sent using INCR burst size
 *  1'b1: The remaining data in the transfer is sent using Single burst size
 */
#define USB_AHBSINGLE    (BIT(23))
#define USB_AHBSINGLE_M  (USB_AHBSINGLE_V << USB_AHBSINGLE_S)
#define USB_AHBSINGLE_V  0x00000001
#define USB_AHBSINGLE_S  23
/** USB_INVDESCENDIANESS : R/W; bitpos: [24]; default: 0;
 *  Invert Descriptor Endianness
 *  1'b0: Descriptor Endianness is same as AHB Master Endianness
 *  1'b1:Invert Descriptor Endianness according to AHB Master endianness
 */
#define USB_INVDESCENDIANESS    (BIT(24))
#define USB_INVDESCENDIANESS_M  (USB_INVDESCENDIANESS_V << USB_INVDESCENDIANESS_S)
#define USB_INVDESCENDIANESS_V  0x00000001
#define USB_INVDESCENDIANESS_S  24


/** USB_GUSBCFG_REG register
 *  USB Configuration Register
 */
#define USB_GUSBCFG_REG (SOC_DPORT_USB_BASE + 0xc)
/** USB_TOUTCAL : R/W; bitpos: [3:0]; default: 0;
 *  FS Timeout Calibration
 */
#define USB_TOUTCAL    0x00000007
#define USB_TOUTCAL_M  (USB_TOUTCAL_V << USB_TOUTCAL_S)
#define USB_TOUTCAL_V  0x00000007
#define USB_TOUTCAL_S  0
/** USB_PHYIF : R/W; bitpos: [3]; default: 0;
 *  The application uses this bit to configure the core to support a
 *  UTMI+ PHY with an 8- or 16-bit interface. When a ULPI PHY is
 *  chosen, this must be Set to 8-bit mode
 *  1'b0: 8 bits
 *  1'b1: 16 bits
 */
#define USB_PHYIF    (BIT(3))
#define USB_PHYIF_M  (USB_PHYIF_V << USB_PHYIF_S)
#define USB_PHYIF_V  0x00000001
#define USB_PHYIF_S  3
/** USB_ULPI_UTMI_SEL : RO; bitpos: [4]; default: 0;
 *  1'b0: UTMI+ Interface
 *  1'b1: ULPI Interface
 */
#define USB_ULPI_UTMI_SEL    (BIT(4))
#define USB_ULPI_UTMI_SEL_M  (USB_ULPI_UTMI_SEL_V << USB_ULPI_UTMI_SEL_S)
#define USB_ULPI_UTMI_SEL_V  0x00000001
#define USB_ULPI_UTMI_SEL_S  4
/** USB_FSINTF : R/W; bitpos: [5]; default: 0;
 *  1'b0: 6-pin unidirectional full-speed serial interface
 *  1'b1: 3-pin bidirectional full-speed serial interface
 */
#define USB_FSINTF    (BIT(5))
#define USB_FSINTF_M  (USB_FSINTF_V << USB_FSINTF_S)
#define USB_FSINTF_V  0x00000001
#define USB_FSINTF_S  5
/** USB_PHYSEL : RO; bitpos: [6]; default: 1;
 *  1'b0: USB 2.0 high-speed UTMI+ or ULPI PHY
 *  1'b1: USB 1.1 full-speed serial transceiver
 */
#define USB_PHYSEL    (BIT(6))
#define USB_PHYSEL_M  (USB_PHYSEL_V << USB_PHYSEL_S)
#define USB_PHYSEL_V  0x00000001
#define USB_PHYSEL_S  6
/** USB_SRPCAP : R/W; bitpos: [8]; default: 0;
 *  1'b0: SRP capability is not enabled
 *  1'b1: SRP capability is enabled
 */
#define USB_SRPCAP    (BIT(8))
#define USB_SRPCAP_M  (USB_SRPCAP_V << USB_SRPCAP_S)
#define USB_SRPCAP_V  0x00000001
#define USB_SRPCAP_S  8
/** USB_HNPCAP : R/W; bitpos: [9]; default: 0;
 *  1'b0: HNP capability is not enabled
 *  1'b1: HNP capability is enabled
 */
#define USB_HNPCAP    (BIT(9))
#define USB_HNPCAP_M  (USB_HNPCAP_V << USB_HNPCAP_S)
#define USB_HNPCAP_V  0x00000001
#define USB_HNPCAP_S  9
/** USB_USBTRDTIM : R/W; bitpos: [14:10]; default: 5;
 *  4'h5: When the MAC interface is 16-bit UTMI+
 *  4'h9: When the MAC interface is 8-bit UTMI+
 */
#define USB_USBTRDTIM    0x0000000F
#define USB_USBTRDTIM_M  (USB_USBTRDTIM_V << USB_USBTRDTIM_S)
#define USB_USBTRDTIM_V  0x0000000F
#define USB_USBTRDTIM_S  10
/** USB_TERMSELDLPULSE : R/W; bitpos: [22]; default: 0;
 *  TermSel DLine Pulsing Selection
 *  1'b0: Data line pulsing using utmi_txvalid (Default)
 *  1'b1: Data line pulsing using utmi_termsel
 */
#define USB_TERMSELDLPULSE    (BIT(22))
#define USB_TERMSELDLPULSE_M  (USB_TERMSELDLPULSE_V << USB_TERMSELDLPULSE_S)
#define USB_TERMSELDLPULSE_V  0x00000001
#define USB_TERMSELDLPULSE_S  22
/** USB_TXENDDELAY : R/W; bitpos: [28]; default: 0;
 *  1'b0 : Normal Mode
 *  1'b1 : Tx End delay
 */
#define USB_TXENDDELAY    (BIT(28))
#define USB_TXENDDELAY_M  (USB_TXENDDELAY_V << USB_TXENDDELAY_S)
#define USB_TXENDDELAY_V  0x00000001
#define USB_TXENDDELAY_S  28
/** USB_FORCEHSTMODE : R/W; bitpos: [29]; default: 0;
 *  1'b0 : Normal Mode
 *  1'b1 : Force Host Mode
 */
#define USB_FORCEHSTMODE    (BIT(29))
#define USB_FORCEHSTMODE_M  (USB_FORCEHSTMODE_V << USB_FORCEHSTMODE_S)
#define USB_FORCEHSTMODE_V  0x00000001
#define USB_FORCEHSTMODE_S  29
/** USB_FORCEDEVMODE : R/W; bitpos: [30]; default: 0;
 *  1'b0 : Normal Mode
 *  1'b1 : Force Device Mode
 */
#define USB_FORCEDEVMODE    (BIT(30))
#define USB_FORCEDEVMODE_M  (USB_FORCEDEVMODE_V << USB_FORCEDEVMODE_S)
#define USB_FORCEDEVMODE_V  0x00000001
#define USB_FORCEDEVMODE_S  30
/** USB_CORRUPTTXPKT : R/W; bitpos: [31]; default: 0;
 *  This bit is for debug purposes only. Never Set this bit to 1. The application
 *  should always write 1'b0 to this bit
 *  1'b0:Normal Mode
 *  1'b1:Debug Mode
 */
#define USB_CORRUPTTXPKT    (BIT(31))
#define USB_CORRUPTTXPKT_M  (USB_CORRUPTTXPKT_V << USB_CORRUPTTXPKT_S)
#define USB_CORRUPTTXPKT_V  0x00000001
#define USB_CORRUPTTXPKT_S  31


/** USB_GRSTCTL_REG register
 *  Reset Register
 */
#define USB_GRSTCTL_REG (SOC_DPORT_USB_BASE + 0x10)
/** USB_CSFTRST : R_WS_SC; bitpos: [0]; default: 0;
 *  Core Soft Reset
 */
#define USB_CSFTRST    (BIT(0))
#define USB_CSFTRST_M  (USB_CSFTRST_V << USB_CSFTRST_S)
#define USB_CSFTRST_V  0x00000001
#define USB_CSFTRST_S  0
/** USB_PIUFSSFTRST : R_WS_SC; bitpos: [1]; default: 0;
 *  1'b0: No Reset
 *  1'b1:PIU FS Dedicated Controller Soft Reset
 */
#define USB_PIUFSSFTRST    (BIT(1))
#define USB_PIUFSSFTRST_M  (USB_PIUFSSFTRST_V << USB_PIUFSSFTRST_S)
#define USB_PIUFSSFTRST_V  0x00000001
#define USB_PIUFSSFTRST_S  1
/** USB_FRMCNTRRST : R/W1S; bitpos: [2]; default: 0;
 *  Host only. Host Frame Counter Reset.The application writes this bit to reset the
 *  (micro)Frame number counter inside the core. When the (micro)Frame counter is
 *  reset, the subsequent SOF sent out by the core has a (micro)Frame number of 0
 */
#define USB_FRMCNTRRST    (BIT(2))
#define USB_FRMCNTRRST_M  (USB_FRMCNTRRST_V << USB_FRMCNTRRST_S)
#define USB_FRMCNTRRST_V  0x00000001
#define USB_FRMCNTRRST_S  2
/** USB_RXFFLSH : R/W1S; bitpos: [4]; default: 0;
 *  RxFIFO Flush. The application can flush the entire RxFIFO using this bit, but must
 *  first ensure that the core is not in the middle of a transaction.The application
 *  must only write to this bit after checking that the controller is neither reading
 *  from the RxFIFO nor writing to the RxFIFO
 *  1'b0:Does not flush the entire RxFIFO
 *  1'b1:flushes the entire RxFIFO
 */
#define USB_RXFFLSH    (BIT(4))
#define USB_RXFFLSH_M  (USB_RXFFLSH_V << USB_RXFFLSH_S)
#define USB_RXFFLSH_V  0x00000001
#define USB_RXFFLSH_S  4
/** USB_TXFFLSH : R/W1S; bitpos: [5]; default: 0;
 *  TxFIFO Flush.This bit selectively flushes a single or all transmit FIFOs, but
 *  cannot do so If the core is in the midst of a transaction.The application must
 *  write this bit only after checking that the core is neither writing to the TxFIFO
 *  nor reading from the TxFIFO.
 */
#define USB_TXFFLSH    (BIT(5))
#define USB_TXFFLSH_M  (USB_TXFFLSH_V << USB_TXFFLSH_S)
#define USB_TXFFLSH_V  0x00000001
#define USB_TXFFLSH_S  5
/** USB_TXFNUM : R/W; bitpos: [11:6]; default: 0;
 *  TxFIFO Number.This is the FIFO number that must be flushed using the TxFIFO Flush
 *  bit. This field must not be changed until the core clears the TxFIFO Flush bit
 */
#define USB_TXFNUM    0x0000001F
#define USB_TXFNUM_M  (USB_TXFNUM_V << USB_TXFNUM_S)
#define USB_TXFNUM_V  0x0000001F
#define USB_TXFNUM_S  6
/** USB_DMAREQ : RO; bitpos: [30]; default: 0;
 *  DMA Request Signal
 *  1'b0:No DMA request
 *  1'b1:DMA request is in progress
 */
#define USB_DMAREQ    (BIT(30))
#define USB_DMAREQ_M  (USB_DMAREQ_V << USB_DMAREQ_S)
#define USB_DMAREQ_V  0x00000001
#define USB_DMAREQ_S  30
/** USB_AHBIDLE : RO; bitpos: [31]; default: 0;
 *  AHB Master Idle
 *  1'b0:Not Idle
 *  1'b1:AHB Master Idle
 */
#define USB_AHBIDLE    (BIT(31))
#define USB_AHBIDLE_M  (USB_AHBIDLE_V << USB_AHBIDLE_S)
#define USB_AHBIDLE_V  0x00000001
#define USB_AHBIDLE_S  31


/** USB_GRXFSIZ_REG register
 *  Receive FIFO Size Register
 */
#define USB_GRXFSIZ_REG (SOC_DPORT_USB_BASE + 0x24)
/** USB_RXFDEP : R/W; bitpos: [16:0]; default: 256;
 *  RxFIFO Depth.This value is in terms of 32-bit words.Minimum value is 16,Maximum
 *  value is 32,768
 */
#define USB_RXFDEP    0x0000FFFF
#define USB_RXFDEP_M  (USB_RXFDEP_V << USB_RXFDEP_S)
#define USB_RXFDEP_V  0x0000FFFF
#define USB_RXFDEP_S  0


/** USB_GNPTXFSIZ_REG register
 *  Non-periodic Transmit FIFO Size Register
 */
#define USB_GNPTXFSIZ_REG (SOC_DPORT_USB_BASE + 0x28)
/** USB_NPTXFSTADDR : R/W; bitpos: [16:0]; default: 256;
 *  The NPTxFStAddr field description is valid only for host mode.This field contains
 *  the memory start address for Non-periodic Transmit FIFO RAM.
 */
#define USB_NPTXFSTADDR    0x0000FFFF
#define USB_NPTXFSTADDR_M  (USB_NPTXFSTADDR_V << USB_NPTXFSTADDR_S)
#define USB_NPTXFSTADDR_V  0x0000FFFF
#define USB_NPTXFSTADDR_S  0
/** USB_NPTXFDEP : R/W; bitpos: [32:16]; default: 256;
 *  The NPTxFDep field description is valid only for host mode or device mode when
 *  OTG_EN_DED_TX_FIFO=0.Minimum value is 16,Maximum value is 32,768.
 */
#define USB_NPTXFDEP    0x0000FFFF
#define USB_NPTXFDEP_M  (USB_NPTXFDEP_V << USB_NPTXFDEP_S)
#define USB_NPTXFDEP_V  0x0000FFFF
#define USB_NPTXFDEP_S  16


/** USB_GNPTXSTS_REG register
 *  Non-periodic Transmit FIFO/Queue Status Register
 */
#define USB_GNPTXSTS_REG (SOC_DPORT_USB_BASE + 0x2c)
/** USB_NPTXFSPCAVAIL : RO; bitpos: [16:0]; default: 256;
 *  Non-periodic TxFIFO Space Avail.Indicates the amount of free space available in the
 *  Non-periodic TxFIFO.Values are in terms of 32-bit words.
 */
#define USB_NPTXFSPCAVAIL    0x0000FFFF
#define USB_NPTXFSPCAVAIL_M  (USB_NPTXFSPCAVAIL_V << USB_NPTXFSPCAVAIL_S)
#define USB_NPTXFSPCAVAIL_V  0x0000FFFF
#define USB_NPTXFSPCAVAIL_S  0
/** USB_NPTXQSPCAVAIL : RO; bitpos: [20:16]; default: 4;
 *  Non-periodic Transmit Request Queue Space Available.Indicates the amount of free
 *  space available in the Non-periodic Transmit Request Queue. This queue holds both
 *  IN and OUT requests in Host mode. Device mode has only IN requests.
 */
#define USB_NPTXQSPCAVAIL    0x0000000F
#define USB_NPTXQSPCAVAIL_M  (USB_NPTXQSPCAVAIL_V << USB_NPTXQSPCAVAIL_S)
#define USB_NPTXQSPCAVAIL_V  0x0000000F
#define USB_NPTXQSPCAVAIL_S  16
/** USB_NPTXQTOP : RO; bitpos: [31:24]; default: 0;
 *  Top of the Non-periodic Transmit Request Queue.
 *  Bits [30:27]: Channel/endpoint number.
 *  Bits [26:25]:  2'b00: IN/OUT token   2'b01: Zero-length transmit packet (device
 *  IN/host OUT)   2'b10: PING/CSPLIT token  2'b11: Channel halt command.
 *  Bit [24]: Terminate (last Entry for selected channel/endpoint).
 */
#define USB_NPTXQTOP    0x0000007F
#define USB_NPTXQTOP_M  (USB_NPTXQTOP_V << USB_NPTXQTOP_S)
#define USB_NPTXQTOP_V  0x0000007F
#define USB_NPTXQTOP_S  24


