espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_HCTSIZ0_REG register
 *  Host Channel 0Transfer Size Register
 */
#define USB_HCTSIZ0_REG (SOC_DPORT_USB_BASE + 0x510)
/** USB_H_XFERSIZE0 : R/W; bitpos: [19:0]; default: 0;
 *  Non-Scatter/Gather DMA Mode: Transfer Size.
 *  Scatter/Gather DMA Mode:
 *  [18:16]: Reserved
 *  [15:8]: NTD (Number of Transfer Descriptors)
 */
#define USB_H_XFERSIZE0    0x0007FFFF
#define USB_H_XFERSIZE0_M  (USB_H_XFERSIZE0_V << USB_H_XFERSIZE0_S)
#define USB_H_XFERSIZE0_V  0x0007FFFF
#define USB_H_XFERSIZE0_S  0
/** USB_H_PKTCNT0 : R/W; bitpos: [29:19]; default: 0;
 *  when in Non-Scatter/Gather DMA mode: Packet Count . This field is programmed by the
 *  application with the expected number of packets to be transmitted (OUT) or received
 *  (IN).
 *  Scatter/Gather DMA Mode: Reserved.
 */
#define USB_H_PKTCNT0    0x000003FF
#define USB_H_PKTCNT0_M  (USB_H_PKTCNT0_V << USB_H_PKTCNT0_S)
#define USB_H_PKTCNT0_V  0x000003FF
#define USB_H_PKTCNT0_S  19
/** USB_H_PID0 : R/W; bitpos: [31:29]; default: 0;
 *  2'b00: DATA0
 *  2'b01: DATA2
 *  2'b10: DATA1
 *  2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_H_PID0    0x00000003
#define USB_H_PID0_M  (USB_H_PID0_V << USB_H_PID0_S)
#define USB_H_PID0_V  0x00000003
#define USB_H_PID0_S  29
/** USB_H_DOPNG0 : R/W; bitpos: [31]; default: 0;
 *  This bit is used only for OUT transfers. Setting this field to 1 directs the host
 *  to do PING protocol
 *  1'b0: No ping protocol
 *  1'b1: Ping protocol
 */
#define USB_H_DOPNG0    (BIT(31))
#define USB_H_DOPNG0_M  (USB_H_DOPNG0_V << USB_H_DOPNG0_S)
#define USB_H_DOPNG0_V  0x00000001
#define USB_H_DOPNG0_S  31


/** USB_HCTSIZ1_REG register
 *  Host Channel 1Transfer Size Register
 */
#define USB_HCTSIZ1_REG (SOC_DPORT_USB_BASE + 0x530)
/** USB_H_XFERSIZE1 : R/W; bitpos: [19:0]; default: 0;
 *  Non-Scatter/Gather DMA Mode: Transfer Size.
 *  Scatter/Gather DMA Mode:
 *  [18:16]: Reserved
 *  [15:8]: NTD (Number of Transfer Descriptors)
 */
#define USB_H_XFERSIZE1    0x0007FFFF
#define USB_H_XFERSIZE1_M  (USB_H_XFERSIZE1_V << USB_H_XFERSIZE1_S)
#define USB_H_XFERSIZE1_V  0x0007FFFF
#define USB_H_XFERSIZE1_S  0
/** USB_H_PKTCNT1 : R/W; bitpos: [29:19]; default: 0;
 *  when in Non-Scatter/Gather DMA mode: Packet Count . This field is programmed by the
 *  application with the expected number of packets to be transmitted (OUT) or received
 *  (IN).
 *  Scatter/Gather DMA Mode: Reserved.
 */
#define USB_H_PKTCNT1    0x000003FF
#define USB_H_PKTCNT1_M  (USB_H_PKTCNT1_V << USB_H_PKTCNT1_S)
#define USB_H_PKTCNT1_V  0x000003FF
#define USB_H_PKTCNT1_S  19
/** USB_H_PID1 : R/W; bitpos: [31:29]; default: 0;
 *  2'b00: DATA0
 *  2'b01: DATA2
 *  2'b10: DATA1
 *  2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_H_PID1    0x00000003
#define USB_H_PID1_M  (USB_H_PID1_V << USB_H_PID1_S)
#define USB_H_PID1_V  0x00000003
#define USB_H_PID1_S  29
/** USB_H_DOPNG1 : R/W; bitpos: [31]; default: 0;
 *  This bit is used only for OUT transfers. Setting this field to 1 directs the host
 *  to do PING protocol
 *  1'b0: No ping protocol
 *  1'b1: Ping protocol
 */
#define USB_H_DOPNG1    (BIT(31))
#define USB_H_DOPNG1_M  (USB_H_DOPNG1_V << USB_H_DOPNG1_S)
#define USB_H_DOPNG1_V  0x00000001
#define USB_H_DOPNG1_S  31


/** USB_HCTSIZ2_REG register
 *  Host Channel 2Transfer Size Register
 */
#define USB_HCTSIZ2_REG (SOC_DPORT_USB_BASE + 0x550)
/** USB_H_XFERSIZE2 : R/W; bitpos: [19:0]; default: 0;
 *  Non-Scatter/Gather DMA Mode: Transfer Size.
 *  Scatter/Gather DMA Mode:
 *  [18:16]: Reserved
 *  [15:8]: NTD (Number of Transfer Descriptors)
 */
#define USB_H_XFERSIZE2    0x0007FFFF
#define USB_H_XFERSIZE2_M  (USB_H_XFERSIZE2_V << USB_H_XFERSIZE2_S)
#define USB_H_XFERSIZE2_V  0x0007FFFF
#define USB_H_XFERSIZE2_S  0
/** USB_H_PKTCNT2 : R/W; bitpos: [29:19]; default: 0;
 *  when in Non-Scatter/Gather DMA mode: Packet Count . This field is programmed by the
 *  application with the expected number of packets to be transmitted (OUT) or received
 *  (IN).
 *  Scatter/Gather DMA Mode: Reserved.
 */
#define USB_H_PKTCNT2    0x000003FF
#define USB_H_PKTCNT2_M  (USB_H_PKTCNT2_V << USB_H_PKTCNT2_S)
#define USB_H_PKTCNT2_V  0x000003FF
#define USB_H_PKTCNT2_S  19
/** USB_H_PID2 : R/W; bitpos: [31:29]; default: 0;
 *  2'b00: DATA0
 *  2'b01: DATA2
 *  2'b10: DATA1
 *  2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_H_PID2    0x00000003
#define USB_H_PID2_M  (USB_H_PID2_V << USB_H_PID2_S)
#define USB_H_PID2_V  0x00000003
#define USB_H_PID2_S  29
/** USB_H_DOPNG2 : R/W; bitpos: [31]; default: 0;
 *  This bit is used only for OUT transfers. Setting this field to 1 directs the host
 *  to do PING protocol
 *  1'b0: No ping protocol
 *  1'b1: Ping protocol
 */
#define USB_H_DOPNG2    (BIT(31))
#define USB_H_DOPNG2_M  (USB_H_DOPNG2_V << USB_H_DOPNG2_S)
#define USB_H_DOPNG2_V  0x00000001
#define USB_H_DOPNG2_S  31


/** USB_HCTSIZ3_REG register
 *  Host Channel 3Transfer Size Register
 */
#define USB_HCTSIZ3_REG (SOC_DPORT_USB_BASE + 0x570)
/** USB_H_XFERSIZE3 : R/W; bitpos: [19:0]; default: 0;
 *  Non-Scatter/Gather DMA Mode: Transfer Size.
 *  Scatter/Gather DMA Mode:
 *  [18:16]: Reserved
 *  [15:8]: NTD (Number of Transfer Descriptors)
 */
#define USB_H_XFERSIZE3    0x0007FFFF
#define USB_H_XFERSIZE3_M  (USB_H_XFERSIZE3_V << USB_H_XFERSIZE3_S)
#define USB_H_XFERSIZE3_V  0x0007FFFF
#define USB_H_XFERSIZE3_S  0
/** USB_H_PKTCNT3 : R/W; bitpos: [29:19]; default: 0;
 *  when in Non-Scatter/Gather DMA mode: Packet Count . This field is programmed by the
 *  application with the expected number of packets to be transmitted (OUT) or received
 *  (IN).
 *  Scatter/Gather DMA Mode: Reserved.
 */
#define USB_H_PKTCNT3    0x000003FF
#define USB_H_PKTCNT3_M  (USB_H_PKTCNT3_V << USB_H_PKTCNT3_S)
#define USB_H_PKTCNT3_V  0x000003FF
#define USB_H_PKTCNT3_S  19
/** USB_H_PID3 : R/W; bitpos: [31:29]; default: 0;
 *  2'b00: DATA0
 *  2'b01: DATA2
 *  2'b10: DATA1
 *  2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_H_PID3    0x00000003
#define USB_H_PID3_M  (USB_H_PID3_V << USB_H_PID3_S)
#define USB_H_PID3_V  0x00000003
#define USB_H_PID3_S  29
/** USB_H_DOPNG3 : R/W; bitpos: [31]; default: 0;
 *  This bit is used only for OUT transfers. Setting this field to 1 directs the host
 *  to do PING protocol
 *  1'b0: No ping protocol
 *  1'b1: Ping protocol
 */
#define USB_H_DOPNG3    (BIT(31))
#define USB_H_DOPNG3_M  (USB_H_DOPNG3_V << USB_H_DOPNG3_S)
#define USB_H_DOPNG3_V  0x00000001
#define USB_H_DOPNG3_S  31


/** USB_HCTSIZ4_REG register
 *  Host Channel 4Transfer Size Register
 */
#define USB_HCTSIZ4_REG (SOC_DPORT_USB_BASE + 0x590)
/** USB_H_XFERSIZE4 : R/W; bitpos: [19:0]; default: 0;
 *  Non-Scatter/Gather DMA Mode: Transfer Size.
 *  Scatter/Gather DMA Mode:
 *  [18:16]: Reserved
 *  [15:8]: NTD (Number of Transfer Descriptors)
 */
#define USB_H_XFERSIZE4    0x0007FFFF
#define USB_H_XFERSIZE4_M  (USB_H_XFERSIZE4_V << USB_H_XFERSIZE4_S)
#define USB_H_XFERSIZE4_V  0x0007FFFF
#define USB_H_XFERSIZE4_S  0
/** USB_H_PKTCNT4 : R/W; bitpos: [29:19]; default: 0;
 *  when in Non-Scatter/Gather DMA mode: Packet Count . This field is programmed by the
 *  application with the expected number of packets to be transmitted (OUT) or received
 *  (IN).
 *  Scatter/Gather DMA Mode: Reserved.
 */
#define USB_H_PKTCNT4    0x000003FF
#define USB_H_PKTCNT4_M  (USB_H_PKTCNT4_V << USB_H_PKTCNT4_S)
#define USB_H_PKTCNT4_V  0x000003FF
#define USB_H_PKTCNT4_S  19
/** USB_H_PID4 : R/W; bitpos: [31:29]; default: 0;
 *  2'b00: DATA0
 *  2'b01: DATA2
 *  2'b10: DATA1
 *  2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_H_PID4    0x00000003
#define USB_H_PID4_M  (USB_H_PID4_V << USB_H_PID4_S)
#define USB_H_PID4_V  0x00000003
#define USB_H_PID4_S  29
/** USB_H_DOPNG4 : R/W; bitpos: [31]; default: 0;
 *  This bit is used only for OUT transfers. Setting this field to 1 directs the host
 *  to do PING protocol
 *  1'b0: No ping protocol
 *  1'b1: Ping protocol
 */
#define USB_H_DOPNG4    (BIT(31))
#define USB_H_DOPNG4_M  (USB_H_DOPNG4_V << USB_H_DOPNG4_S)
#define USB_H_DOPNG4_V  0x00000001
#define USB_H_DOPNG4_S  31


/** USB_HCTSIZ5_REG register
 *  Host Channel 5Transfer Size Register
 */
#define USB_HCTSIZ5_REG (SOC_DPORT_USB_BASE + 0x5b0)
/** USB_H_XFERSIZE5 : R/W; bitpos: [19:0]; default: 0;
 *  Non-Scatter/Gather DMA Mode: Transfer Size.
 *  Scatter/Gather DMA Mode:
 *  [18:16]: Reserved
 *  [15:8]: NTD (Number of Transfer Descriptors)
 */
#define USB_H_XFERSIZE5    0x0007FFFF
#define USB_H_XFERSIZE5_M  (USB_H_XFERSIZE5_V << USB_H_XFERSIZE5_S)
#define USB_H_XFERSIZE5_V  0x0007FFFF
#define USB_H_XFERSIZE5_S  0
/** USB_H_PKTCNT5 : R/W; bitpos: [29:19]; default: 0;
 *  when in Non-Scatter/Gather DMA mode: Packet Count . This field is programmed by the
 *  application with the expected number of packets to be transmitted (OUT) or received
 *  (IN).
 *  Scatter/Gather DMA Mode: Reserved.
 */
#define USB_H_PKTCNT5    0x000003FF
#define USB_H_PKTCNT5_M  (USB_H_PKTCNT5_V << USB_H_PKTCNT5_S)
#define USB_H_PKTCNT5_V  0x000003FF
#define USB_H_PKTCNT5_S  19
/** USB_H_PID5 : R/W; bitpos: [31:29]; default: 0;
 *  2'b00: DATA0
 *  2'b01: DATA2
 *  2'b10: DATA1
 *  2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_H_PID5    0x00000003
#define USB_H_PID5_M  (USB_H_PID5_V << USB_H_PID5_S)
#define USB_H_PID5_V  0x00000003
#define USB_H_PID5_S  29
/** USB_H_DOPNG5 : R/W; bitpos: [31]; default: 0;
 *  This bit is used only for OUT transfers. Setting this field to 1 directs the host
 *  to do PING protocol
 *  1'b0: No ping protocol
 *  1'b1: Ping protocol
 */
#define USB_H_DOPNG5    (BIT(31))
#define USB_H_DOPNG5_M  (USB_H_DOPNG5_V << USB_H_DOPNG5_S)
#define USB_H_DOPNG5_V  0x00000001
#define USB_H_DOPNG5_S  31


/** USB_HCTSIZ6_REG register
 *  Host Channel 6Transfer Size Register
 */
#define USB_HCTSIZ6_REG (SOC_DPORT_USB_BASE + 0x5d0)
/** USB_H_XFERSIZE6 : R/W; bitpos: [19:0]; default: 0;
 *  Non-Scatter/Gather DMA Mode: Transfer Size.
 *  Scatter/Gather DMA Mode:
 *  [18:16]: Reserved
 *  [15:8]: NTD (Number of Transfer Descriptors)
 */
#define USB_H_XFERSIZE6    0x0007FFFF
#define USB_H_XFERSIZE6_M  (USB_H_XFERSIZE6_V << USB_H_XFERSIZE6_S)
#define USB_H_XFERSIZE6_V  0x0007FFFF
#define USB_H_XFERSIZE6_S  0
/** USB_H_PKTCNT6 : R/W; bitpos: [29:19]; default: 0;
 *  when in Non-Scatter/Gather DMA mode: Packet Count . This field is programmed by the
 *  application with the expected number of packets to be transmitted (OUT) or received
 *  (IN).
 *  Scatter/Gather DMA Mode: Reserved.
 */
#define USB_H_PKTCNT6    0x000003FF
#define USB_H_PKTCNT6_M  (USB_H_PKTCNT6_V << USB_H_PKTCNT6_S)
#define USB_H_PKTCNT6_V  0x000003FF
#define USB_H_PKTCNT6_S  19
/** USB_H_PID6 : R/W; bitpos: [31:29]; default: 0;
 *  2'b00: DATA0
 *  2'b01: DATA2
 *  2'b10: DATA1
 *  2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_H_PID6    0x00000003
#define USB_H_PID6_M  (USB_H_PID6_V << USB_H_PID6_S)
#define USB_H_PID6_V  0x00000003
#define USB_H_PID6_S  29
/** USB_H_DOPNG6 : R/W; bitpos: [31]; default: 0;
 *  This bit is used only for OUT transfers. Setting this field to 1 directs the host
 *  to do PING protocol
 *  1'b0: No ping protocol
 *  1'b1: Ping protocol
 */
#define USB_H_DOPNG6    (BIT(31))
#define USB_H_DOPNG6_M  (USB_H_DOPNG6_V << USB_H_DOPNG6_S)
#define USB_H_DOPNG6_V  0x00000001
#define USB_H_DOPNG6_S  31


