espressif/esp-idf/components/soc/esp32s2/register/soc/usb_reg.h
/** USB_DTXFSTS0_REG register
 *  Device IN Endpoint Transmit FIFO Status Register 0
 */
#define USB_DTXFSTS0_REG (SOC_DPORT_USB_BASE + 0x918)
/** USB_D_INEPTXFSPCAVAIL0 : RO; bitpos: [16:0]; default: 0;
 *  Indicates the amount of free space available in the Endpoint  TxFIFO.
 */
#define USB_D_INEPTXFSPCAVAIL0    0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL0_M  (USB_D_INEPTXFSPCAVAIL0_V << USB_D_INEPTXFSPCAVAIL0_S)
#define USB_D_INEPTXFSPCAVAIL0_V  0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL0_S  0


/** USB_DIEPDMAB0_REG register
 *  Device IN Endpoint 16 Buffer Address Register
 */
#define USB_DIEPDMAB0_REG (SOC_DPORT_USB_BASE + 0x91c)
/** USB_D_DMABUFFERADDR0 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_D_DMABUFFERADDR0    0xFFFFFFFF
#define USB_D_DMABUFFERADDR0_M  (USB_D_DMABUFFERADDR0_V << USB_D_DMABUFFERADDR0_S)
#define USB_D_DMABUFFERADDR0_V  0xFFFFFFFF
#define USB_D_DMABUFFERADDR0_S  0


/** USB_DTXFSTS1_REG register
 *  Device IN Endpoint Transmit FIFO Status Register 1
 */
#define USB_DTXFSTS1_REG (SOC_DPORT_USB_BASE + 0x938)
/** USB_D_INEPTXFSPCAVAIL1 : RO; bitpos: [16:0]; default: 0;
 *  Indicates the amount of free space available in the Endpoint  TxFIFO.
 */
#define USB_D_INEPTXFSPCAVAIL1    0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL1_M  (USB_D_INEPTXFSPCAVAIL1_V << USB_D_INEPTXFSPCAVAIL1_S)
#define USB_D_INEPTXFSPCAVAIL1_V  0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL1_S  0


/** USB_DIEPDMAB1_REG register
 *  Device IN Endpoint 16 Buffer Address Register
 */
#define USB_DIEPDMAB1_REG (SOC_DPORT_USB_BASE + 0x93c)
/** USB_D_DMABUFFERADDR1 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_D_DMABUFFERADDR1    0xFFFFFFFF
#define USB_D_DMABUFFERADDR1_M  (USB_D_DMABUFFERADDR1_V << USB_D_DMABUFFERADDR1_S)
#define USB_D_DMABUFFERADDR1_V  0xFFFFFFFF
#define USB_D_DMABUFFERADDR1_S  0


/** USB_DTXFSTS2_REG register
 *  Device IN Endpoint Transmit FIFO Status Register 2
 */
#define USB_DTXFSTS2_REG (SOC_DPORT_USB_BASE + 0x958)
/** USB_D_INEPTXFSPCAVAIL2 : RO; bitpos: [16:0]; default: 0;
 *  Indicates the amount of free space available in the Endpoint  TxFIFO.
 */
#define USB_D_INEPTXFSPCAVAIL2    0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL2_M  (USB_D_INEPTXFSPCAVAIL2_V << USB_D_INEPTXFSPCAVAIL2_S)
#define USB_D_INEPTXFSPCAVAIL2_V  0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL2_S  0


/** USB_DIEPDMAB2_REG register
 *  Device IN Endpoint 16 Buffer Address Register
 */
#define USB_DIEPDMAB2_REG (SOC_DPORT_USB_BASE + 0x95c)
/** USB_D_DMABUFFERADDR2 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_D_DMABUFFERADDR2    0xFFFFFFFF
#define USB_D_DMABUFFERADDR2_M  (USB_D_DMABUFFERADDR2_V << USB_D_DMABUFFERADDR2_S)
#define USB_D_DMABUFFERADDR2_V  0xFFFFFFFF
#define USB_D_DMABUFFERADDR2_S  0


/** USB_DTXFSTS3_REG register
 *  Device IN Endpoint Transmit FIFO Status Register 3
 */
#define USB_DTXFSTS3_REG (SOC_DPORT_USB_BASE + 0x978)
/** USB_D_INEPTXFSPCAVAIL3 : RO; bitpos: [16:0]; default: 0;
 *  Indicates the amount of free space available in the Endpoint  TxFIFO.
 */
#define USB_D_INEPTXFSPCAVAIL3    0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL3_M  (USB_D_INEPTXFSPCAVAIL3_V << USB_D_INEPTXFSPCAVAIL3_S)
#define USB_D_INEPTXFSPCAVAIL3_V  0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL3_S  0


/** USB_DIEPDMAB3_REG register
 *  Device IN Endpoint 16 Buffer Address Register
 */
#define USB_DIEPDMAB3_REG (SOC_DPORT_USB_BASE + 0x97c)
/** USB_D_DMABUFFERADDR3 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_D_DMABUFFERADDR3    0xFFFFFFFF
#define USB_D_DMABUFFERADDR3_M  (USB_D_DMABUFFERADDR3_V << USB_D_DMABUFFERADDR3_S)
#define USB_D_DMABUFFERADDR3_V  0xFFFFFFFF
#define USB_D_DMABUFFERADDR3_S  0


/** USB_DTXFSTS4_REG register
 *  Device IN Endpoint Transmit FIFO Status Register 4
 */
#define USB_DTXFSTS4_REG (SOC_DPORT_USB_BASE + 0x998)
/** USB_D_INEPTXFSPCAVAIL4 : RO; bitpos: [16:0]; default: 0;
 *  Indicates the amount of free space available in the Endpoint  TxFIFO.
 */
#define USB_D_INEPTXFSPCAVAIL4    0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL4_M  (USB_D_INEPTXFSPCAVAIL4_V << USB_D_INEPTXFSPCAVAIL4_S)
#define USB_D_INEPTXFSPCAVAIL4_V  0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL4_S  0


/** USB_DIEPDMAB4_REG register
 *  Device IN Endpoint 16 Buffer Address Register
 */
#define USB_DIEPDMAB4_REG (SOC_DPORT_USB_BASE + 0x99c)
/** USB_D_DMABUFFERADDR4 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_D_DMABUFFERADDR4    0xFFFFFFFF
#define USB_D_DMABUFFERADDR4_M  (USB_D_DMABUFFERADDR4_V << USB_D_DMABUFFERADDR4_S)
#define USB_D_DMABUFFERADDR4_V  0xFFFFFFFF
#define USB_D_DMABUFFERADDR4_S  0


/** USB_DTXFSTS5_REG register
 *  Device IN Endpoint Transmit FIFO Status Register 5
 */
#define USB_DTXFSTS5_REG (SOC_DPORT_USB_BASE + 0x9b8)
/** USB_D_INEPTXFSPCAVAIL5 : RO; bitpos: [16:0]; default: 0;
 *  Indicates the amount of free space available in the Endpoint  TxFIFO.
 */
#define USB_D_INEPTXFSPCAVAIL5    0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL5_M  (USB_D_INEPTXFSPCAVAIL5_V << USB_D_INEPTXFSPCAVAIL5_S)
#define USB_D_INEPTXFSPCAVAIL5_V  0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL5_S  0


/** USB_DIEPDMAB5_REG register
 *  Device IN Endpoint 16 Buffer Address Register
 */
#define USB_DIEPDMAB5_REG (SOC_DPORT_USB_BASE + 0x9bc)
/** USB_D_DMABUFFERADDR5 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_D_DMABUFFERADDR5    0xFFFFFFFF
#define USB_D_DMABUFFERADDR5_M  (USB_D_DMABUFFERADDR5_V << USB_D_DMABUFFERADDR5_S)
#define USB_D_DMABUFFERADDR5_V  0xFFFFFFFF
#define USB_D_DMABUFFERADDR5_S  0


/** USB_DTXFSTS6_REG register
 *  Device IN Endpoint Transmit FIFO Status Register 6
 */
#define USB_DTXFSTS6_REG (SOC_DPORT_USB_BASE + 0x9d8)
/** USB_D_INEPTXFSPCAVAIL6 : RO; bitpos: [16:0]; default: 0;
 *  Indicates the amount of free space available in the Endpoint  TxFIFO.
 */
#define USB_D_INEPTXFSPCAVAIL6    0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL6_M  (USB_D_INEPTXFSPCAVAIL6_V << USB_D_INEPTXFSPCAVAIL6_S)
#define USB_D_INEPTXFSPCAVAIL6_V  0x0000FFFF
#define USB_D_INEPTXFSPCAVAIL6_S  0


/** USB_DIEPDMAB6_REG register
 *  Device IN Endpoint 16 Buffer Address Register
 */
#define USB_DIEPDMAB6_REG (SOC_DPORT_USB_BASE + 0x9dc)
/** USB_D_DMABUFFERADDR6 : RO; bitpos: [32:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress. This register is present
 *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
 */
#define USB_D_DMABUFFERADDR6    0xFFFFFFFF
#define USB_D_DMABUFFERADDR6_M  (USB_D_DMABUFFERADDR6_V << USB_D_DMABUFFERADDR6_S)
#define USB_D_DMABUFFERADDR6_V  0xFFFFFFFF
#define USB_D_DMABUFFERADDR6_S  0




#ifdef __cplusplus
}
#endif
